{
  "success": true,
  "date_range": {
    "start": "2024-12-16T00:00:00+00:00",
    "end": "2024-12-18T21:07:42.134700+00:00"
  },
  "summary": {
    "total_tickets": 16,
    "resolved_tickets": 5,
    "open_tickets": 11
  },
  "ticket_breakdown": [
    {
      "category": "Uncategorized",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "bug",
      "received": 12,
      "resolved": 4,
      "pending": 8
    },
    {
      "category": "status:new",
      "received": 4,
      "resolved": 1,
      "pending": 3
    },
    {
      "category": "app:desktop application",
      "received": 13,
      "resolved": 4,
      "pending": 9
    },
    {
      "category": "os:linux",
      "received": 5,
      "resolved": 2,
      "pending": 3
    },
    {
      "category": "app:pieces os",
      "received": 9,
      "resolved": 4,
      "pending": 5
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 5,
      "resolved": 2,
      "pending": 3
    },
    {
      "category": "status:triaged",
      "received": 3,
      "resolved": 1,
      "pending": 2
    },
    {
      "category": "on the roadmap",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "P0",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "os:windows",
      "received": 6,
      "resolved": 2,
      "pending": 4
    },
    {
      "category": "app:vs code",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "app:pieces copilot module",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "app:web extension",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:visual studio",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "duplicate",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:jetbrains",
      "received": 2,
      "resolved": 2,
      "pending": 0
    }
  ],
  "most_active_tickets": [
    {
      "number": 471,
      "title": "I´m sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app",
      "activity_level": 18.51
    },
    {
      "number": 526,
      "title": "Can't turn on long term memory engine",
      "activity_level": 7.89
    },
    {
      "number": 528,
      "title": "I can't use any GPT models other than 'GPT-4o Mini'",
      "activity_level": 7.25
    },
    {
      "number": 530,
      "title": "Vscode and PHPStorm plugins stopped working after Pieces OS update",
      "activity_level": 7.0
    },
    {
      "number": 527,
      "title": "Manually downloading a LLM",
      "activity_level": 6.38
    },
    {
      "number": 487,
      "title": "\"This message exceeded the context limit for this LLM. Please select a different LLM and try again, or shorten your prompt.\" issue",
      "activity_level": 5.76
    },
    {
      "number": 531,
      "title": "Pieces Desktop App - Lost Connection to PiecesOS",
      "activity_level": 5.5
    },
    {
      "number": 537,
      "title": "Ollama Fails to Install on Linux",
      "activity_level": 5.36
    },
    {
      "number": 536,
      "title": "Bug: Adding Folder as context (typescript repo) appears to crash PiecesOS within the Copilot",
      "activity_level": 5.36
    },
    {
      "number": 535,
      "title": "Bug: Claude 3.5 Sonnet Copilot response issues \"I'm Sorry something went wrong with the processing...\"",
      "activity_level": 5.36
    },
    {
      "number": 534,
      "title": "Pieces os says: port already in use if i start phpstorm with pieces plugin",
      "activity_level": 4.5
    },
    {
      "number": 533,
      "title": "Taskbar is not able to be  used while accessing pieces",
      "activity_level": 3.5
    },
    {
      "number": 442,
      "title": "Can't turn on Long-Term Memory Engine",
      "activity_level": 3.37
    },
    {
      "number": 538,
      "title": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins",
      "activity_level": 3.15
    },
    {
      "number": 507,
      "title": "Pieces for Developers app keeps crashing continuously on attempts to upload files and folder and needs restart on my windows 11 laptop",
      "activity_level": 3.04
    },
    {
      "number": 458,
      "title": "Subject: Live Context Feature Not Working",
      "activity_level": 2.14
    }
  ],
  "common_issues": [
    {
      "title": "LLM Context Limit and Rate Limiting Errors",
      "description": "Users encounter errors related to context limits being exceeded or rate limiting when using various LLM models. This can manifest as misleading error messages or failed requests. Solutions include shortening prompts, updating Pieces OS, authenticating accounts, and contacting support for rate limit increases.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 487,
          "title": "\"This message exceeded the context limit for this LLM. Please select a different LLM and try again, or shorten your prompt.\" issue",
          "text": "\"This message exceeded the context limit for this LLM. Please select a different LLM and try again, or shorten your prompt.\" issue\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n10.1.15\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI wanted to demo the power of pieces using the day one challenge of advent of code.\n\nI received an error that the messages exceeded the context:\n![Image](https://github.com/user-attachments/assets/9c170105-22d6-4ccb-99f7-650f87357eda)\n\nI tried in a new chat and is started working as expected:\n![Image](https://github.com/user-attachments/assets/ebb0dfa9-a246-4ade-a8a8-c21723db07e0)\n\nLogs:\npOS: [log-12032024.txt](https://github.com/user-attachments/files/17993900/log-12032024.txt)\nPfD: [log-12032024.txt](https://github.com/user-attachments/files/17993911/log-12032024.txt)\n\nHere is the complete message for reproduction:\n```\nCan you give a short plan on how to implement this:\n--- Day 1: Historian Hysteria ---\n\nThe Chief Historian is always present for the big Christmas sleigh launch, but nobody has seen him in months! Last anyone heard, he was visiting locations that are historically significant to the North Pole; a group of Senior Historians has asked you to accompany them as they check the places they think he was most likely to visit.\n\nAs each location is checked, they will mark it on their list with a star. They figure the Chief Historian must be in one of the first fifty places they'll look, so in order to save Christmas, you need to help them get fifty stars on their list before Santa takes off on December 25th.\n\nCollect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!\n\nYou haven't even left yet and the group of Elvish Senior Historians has already hit a problem: their list of locations to check is currently empty. Eventually, someone decides that the best place to check first would be the Chief Historian's office.\n\nUpon pouring into the office, everyone confirms that the Chief Historian is indeed nowhere to be found. Instead, the Elves discover an assortment of notes and lists of historically significant locations! This seems to be the planning the Chief Historian was doing before he left. Perhaps these notes can be used to determine which locations to search?\n\nThroughout the Chief's office, the historically significant locations are listed not by name but by a unique number called the location ID. To make sure they don't miss anything, The Historians split into two groups, each searching the office and trying to create their own complete list of location IDs.\n\nThere's just one problem: by holding the two lists up side by side (your puzzle input), it quickly becomes clear that the lists aren't very similar. Maybe you can help The Historians reconcile their lists?\n\nFor example:\n\n3   4\n4   3\n2   5\n1   3\n3   9\n3   3\nMaybe the lists are only off by a small amount! To find out, pair up the numbers and measure how far apart they are. Pair up the smallest number in the left list with the smallest number in the right list, then the second-smallest left number with the second-smallest right number, and so on.\n\nWithin each pair, figure out how far apart the two numbers are; you'll need to add up all of those distances. For example, if you pair up a 3 from the left list with a 7 from the right list, the distance apart is 4; if you pair up a 9 with a 3, the distance apart is 6.\n\nIn the example list above, the pairs and distances would be as follows:\n\nThe smallest number in the left list is 1, and the smallest number in the right list is 3. The distance between them is 2.\nThe second-smallest number in the left list is 2, and the second-smallest number in the right list is another 3. The distance between them is 1.\nThe third-smallest number in both lists is 3, so the distance between them is 0.\nThe next numbers to pair up are 3 and 4, a distance of 1.\nThe fifth-smallest numbers in each list are 3 and 5, a distance of 2.\nFinally, the largest number in the left list is 4, while the largest number in the right list is 9; these are a distance 5 apart.\nTo find the total distance between the left list and the right list, add up the distances between all of the pairs you found. In the example above, this is 2 + 1 + 0 + 1 + 2 + 5, a total distance of 11!\n\nYour actual left and right lists contain many location IDs. What is the total distance between your lists?\n```\n## Conversation Summary: \n\n**Key points:**\n\n* Infrequent issue involving empty prediction from Pieces\n* Likely due to errors being suppressed on AOT side\n* Occurs when LLM returns empty output instead of error code\n\n**Problems:**\n\n* Misleading error message due to suppressed error\n* Hard to troubleshoot without knowing the actual cause\n\n**Solutions:**\n\n* **Proposed:** Change error message to be more informative\n* **Proposed:** Implement retry mechanism on error code detection\n* **Investigated:** Potential fix in release 11.0.0 of os server\n\n**Current status:**\n\n* Awaiting confirmation from hra42 if the issue persists on the new release\n\n**Outcome:**\n\n* Dependent on further testing and potential contact with Vertex AI regarding the issue\n\n**Additional comments:**\n\n* The problem appears specific to Claude models and may be related to harmful content detection errors or internal server issues. \n* Further communication with Google Cloud contacts on the Vertex AI team may be necessary.",
          "activity_level": 5.76
        },
        {
          "id": 471,
          "title": "I´m sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app",
          "text": "I´m sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.13\n\n### Early Access Program\n\n- [x] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n[com.pieces.pfd.zip](https://github.com/user-attachments/files/17891327/com.pieces.pfd.zip)\n![Image](https://github.com/user-attachments/assets/c9a6f930-4d30-41ad-8d70-b81d9c3f7e6f)\n![Image](https://github.com/user-attachments/assets/99d91958-8fb7-4f27-9efa-9d628127e90f)\n![Image](https://github.com/user-attachments/assets/8d1c630b-816c-488d-87f9-202a86d63820)\n![Image](https://github.com/user-attachments/assets/8e8278a0-eca0-4b4e-bcaa-a5b195da5562)\n\n## Summary of GitHub Issue Conversation about Rate Limiting Error\n\n**Problem:**\n\n* Users experience an error message when using copilot models like Claude, Chat Bison, and Gemini.\n* The underlying issue is rate limiting implemented by PiecesOS to prevent abuse.\n* Error message was unclear, making troubleshooting difficult.\n\n**Solutions:**\n\n* **Short term:**\n    * Users can contact @mark-at-pieces with specific information to increase their rate limit.\n    * Local processing works, cloud processing is affected.\n* **Long term:**\n    * Authentication will be required for cloud processing.\n    * Improved error message will be implemented.\n    * Bug causing over-aggressive rate limiting has been fixed.\n\n**Current Status:**\n\n* The issue is mostly resolved.\n* Some users may still experience rate limiting due to ongoing adjustments.\n* Updating to PiecesOS 11.0.0 and signing in can significantly increase rate limit window.\n* Users encountering persistent issues can contact @mark-at-pieces for further assistance.\n\n**Key Points:**\n\n* The rate limiting prevents abuse but can inconvenience legitimate users.\n* Communication and collaboration between users and developers is crucial for resolving issues.\n* Authentication and clearer error messages will improve the user experience.\n\n**Unresolved Issues:**\n\n* Some users still report issues despite updates.\n* Long-term solution of authentication might not be ideal for all users.\n\n**Additional Notes:**\n\n* @mark-at-pieces is actively engaged in resolving the issue and providing support.\n* The PiecesOS team is working on improving the system and communication.\n* Users are encouraged to provide feedback and report any ongoing issues.",
          "activity_level": 18.51
        },
        {
          "id": 528,
          "title": "I can't use any GPT models other than 'GPT-4o Mini'",
          "text": "I can't use any GPT models other than 'GPT-4o Mini'\n### Software\n\nDesktop Application, JetBrains, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.15\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n\"I'm sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app\"\n\nIf the model is 4o Mini, everything works fine.\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* An unexpected error message is encountered when interacting with Copilot.\n* This issue has been reported before in various forms.\n* The issue might be related to rate limiting problems or conversation flow issues.\n\n**Problems Identified:**\n\n* The user receives an error message while trying to use Copilot.\n* The cause of the error message is unclear.\n* The issue may be related to specific configurations or limitations.\n\n**Solutions Proposed/Implemented:**\n\n* Update to PiecesOS 11.0.0 to potentially resolve the rate limiting problem.\n* Authenticate to avoid rate limiting issues.\n* Schedule a meeting with the support team if the issue persists after authentication and updating to PiecesOS 11.0.0.\n\n**Current Status/Outcome:**\n\n* The issue is marked as a duplicate of another reported issue.\n* The conversation is closed, suggesting the issue is resolved or requires further action from the user.\n\n**Additional Notes:**\n\n* The provided resources might be helpful for further troubleshooting or information regarding the issue.",
          "activity_level": 7.25
        }
      ]
    },
    {
      "title": "Copilot Model Processing Errors",
      "description": "Users are experiencing \"Something went wrong with processing...\" errors when using Copilot models, particularly Claude and GPT. This is often due to rate limiting. Solutions include updating to the latest Pieces OS, authenticating, and contacting support for rate limit increases.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 535,
          "title": "Bug: Claude 3.5 Sonnet Copilot response issues \"I'm Sorry something went wrong with the processing...\"",
          "text": "Bug: Claude 3.5 Sonnet Copilot response issues \"I'm Sorry something went wrong with the processing...\"\n### Software\n\nCopilot Module\n\n### Operating System / Platform\n\nmacOS, Windows, Linux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHey 👋,\n\nWe are experiencing some issues on and off w/ Claude Sonnet 3.5 within the Copilot Modules of all the applications.\n\nIf you are experiencing this issue please first:\n1. change the Model runtime to OpenAI or Gemini as these are working very consistently.\n2. Ensure you sign in to the Pieces Ecosystem, this will ensure that you have a larger rate limit than those users who are NOT authenticated.\n\nPlease feel free to comment in this thread if you are experiencing similar issues!\n\n\n## Issue Summary: Slow GPT-4 Response Time\n\n**Key Points:**\n\n* User reported slow response time from GPT-4 model.\n* Pieces support bot provided a timeframe for response and some helpful resources.\n* The issue might be related to existing issues with GPT models.\n\n**Problems Identified:**\n\n* GPT-4 model is experiencing slow response times.\n* User is unable to utilize the full potential of the model.\n\n**Solutions Proposed/Implemented:**\n\n* No specific solution proposed in this initial conversation.\n* The user is advised to wait for further updates and explore available resources.\n\n**Current Status/Outcome:**\n\n* The issue is being investigated by the Pieces team.\n* The user is awaiting further communication.\n\n**Additional Notes:**\n\n* The referenced issues may provide clues about the potential causes of the slow response time.\n* The user can explore the resources provided by the support bot for more information and troubleshooting tips.",
          "activity_level": 5.36
        },
        {
          "id": 528,
          "title": "I can't use any GPT models other than 'GPT-4o Mini'",
          "text": "I can't use any GPT models other than 'GPT-4o Mini'\n### Software\n\nDesktop Application, JetBrains, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.15\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n\"I'm sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app\"\n\nIf the model is 4o Mini, everything works fine.\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* An unexpected error message is encountered when interacting with Copilot.\n* This issue has been reported before in various forms.\n* The issue might be related to rate limiting problems or conversation flow issues.\n\n**Problems Identified:**\n\n* The user receives an error message while trying to use Copilot.\n* The cause of the error message is unclear.\n* The issue may be related to specific configurations or limitations.\n\n**Solutions Proposed/Implemented:**\n\n* Update to PiecesOS 11.0.0 to potentially resolve the rate limiting problem.\n* Authenticate to avoid rate limiting issues.\n* Schedule a meeting with the support team if the issue persists after authentication and updating to PiecesOS 11.0.0.\n\n**Current Status/Outcome:**\n\n* The issue is marked as a duplicate of another reported issue.\n* The conversation is closed, suggesting the issue is resolved or requires further action from the user.\n\n**Additional Notes:**\n\n* The provided resources might be helpful for further troubleshooting or information regarding the issue.",
          "activity_level": 7.25
        },
        {
          "id": 471,
          "title": "I´m sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app",
          "text": "I´m sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.13\n\n### Early Access Program\n\n- [x] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n[com.pieces.pfd.zip](https://github.com/user-attachments/files/17891327/com.pieces.pfd.zip)\n![Image](https://github.com/user-attachments/assets/c9a6f930-4d30-41ad-8d70-b81d9c3f7e6f)\n![Image](https://github.com/user-attachments/assets/99d91958-8fb7-4f27-9efa-9d628127e90f)\n![Image](https://github.com/user-attachments/assets/8d1c630b-816c-488d-87f9-202a86d63820)\n![Image](https://github.com/user-attachments/assets/8e8278a0-eca0-4b4e-bcaa-a5b195da5562)\n\n## Summary of GitHub Issue Conversation about Rate Limiting Error\n\n**Problem:**\n\n* Users experience an error message when using copilot models like Claude, Chat Bison, and Gemini.\n* The underlying issue is rate limiting implemented by PiecesOS to prevent abuse.\n* Error message was unclear, making troubleshooting difficult.\n\n**Solutions:**\n\n* **Short term:**\n    * Users can contact @mark-at-pieces with specific information to increase their rate limit.\n    * Local processing works, cloud processing is affected.\n* **Long term:**\n    * Authentication will be required for cloud processing.\n    * Improved error message will be implemented.\n    * Bug causing over-aggressive rate limiting has been fixed.\n\n**Current Status:**\n\n* The issue is mostly resolved.\n* Some users may still experience rate limiting due to ongoing adjustments.\n* Updating to PiecesOS 11.0.0 and signing in can significantly increase rate limit window.\n* Users encountering persistent issues can contact @mark-at-pieces for further assistance.\n\n**Key Points:**\n\n* The rate limiting prevents abuse but can inconvenience legitimate users.\n* Communication and collaboration between users and developers is crucial for resolving issues.\n* Authentication and clearer error messages will improve the user experience.\n\n**Unresolved Issues:**\n\n* Some users still report issues despite updates.\n* Long-term solution of authentication might not be ideal for all users.\n\n**Additional Notes:**\n\n* @mark-at-pieces is actively engaged in resolving the issue and providing support.\n* The PiecesOS team is working on improving the system and communication.\n* Users are encouraged to provide feedback and report any ongoing issues.",
          "activity_level": 18.51
        }
      ]
    },
    {
      "title": "Pieces OS 11.0.0 Plugin Compatibility Issues",
      "description": "Users are experiencing compatibility issues with various plugins after updating to Pieces OS 11.0.0.  This includes plugins for VS Code, JetBrains IDEs, and potentially others. The issue seems to stem from the update requiring newer plugin versions that are not yet available or accessible. Users are advised to wait for plugin updates or contact Pieces OS support for assistance.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 538,
          "title": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins",
          "text": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins\n### Software\n\nDesktop Application, Pieces OS, Web Extension, JetBrains, VS Code, Visual Studio, Obsidian, JupyterLab, Sublime Plugin, Raycast Extension, Pieces CLI, Neovim\n\n### Operating System / Platform\n\nmacOS/Windows/Linux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHey 👋,\n\nWe introduce one of the largest releases in the Pieces Ecosystem.\n\nLots of bug fixes - targeting some of the largest hitches in the user journey to name a few: rate limiting(authenticate to bypass, + better error messaging), entirely new Ollama (local LLM) infrastructure w/ in the copilot, and tackling installation head-on.\n\nThe detailed list of changes is not quite ready yet; however, it will be here shortly. (I will post them here when they are)\n\nHowever, this issue is here let you know to update all your plugins and provide the status of all of the new plugins(in the case they are not yet out in production)\n\nPieces For Developers(Desktop Application): 3.3.0 - Live\nPiecesOs: 11.0.0 - Live\nvscode: 2.0.0 - Live\nJetBrains: 11.0.0 - Live\nVisual Studio: 4.0.0 - Live\nJupyter: 1.21.0 - Live\nObsidian: 1.21.0 - live\nSublime: 1.5.0 - (This is under review)\nCLI: - 1.9.0 (This is under review)\nNeoVim: - 1.3.0 (This is under review)\nChrome(web) Extension: - 4.0.0 (This is under review)\n\nPlease, if you have any questions about the release or are having trouble updating to the latest, comment in this thread, and we can help you out!!\nNo comments found on this issue.",
          "activity_level": 3.15
        },
        {
          "id": 530,
          "title": "Vscode and PHPStorm plugins stopped working after Pieces OS update",
          "text": "Vscode and PHPStorm plugins stopped working after Pieces OS update\n### Software\n\nVS Code, Visual Studio\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nYesterday was working great. Minutes ago it prompt me to update Pieces OS and Pieces for Developers. After the update both Vscode and PHPStorm plugins stopped working.\n\nPHPStorm says - It looks like port 1000 is occupied by another application. Pieces OS uses this port to communicate with plugins. Please, enable Pieces OS to run on port 1000.\n\nAnd Vscode says - Please update the Pieces for VS Code extension to the latest version. This version is only compatible with Pieces OS versions less than 11.0.0, and  you have 11.0.0 installed. But there isn't any Vscode plugin update.\n\nCan you help? Is there a way to downgrade?\n\n![Image](https://github.com/user-attachments/assets/973ecc53-1230-4b25-93df-b8f258273f19)\n\n![Image](https://github.com/user-attachments/assets/a0d82807-7d45-4279-af39-b223896bd4ca)\n\n## Summary of GitHub Issue Conversation: \n\n**Key Points:**\n\n* A new version of Pieces OS was released on December 17, 2024.\n* @rafael-a-g-n reported an antivirus issue with the new version, flagging it as suspicious access.\n\n**Problems Identified:**\n\n* Antivirus software flagged the new Pieces OS update as a potential threat.\n* This may deter users from updating and cause concerns about the software's safety.\n\n**Proposed Solutions:**\n\n* The Pieces OS team acknowledged the issue and attempted to address it.\n* Further investigation and solutions are likely needed.\n\n**Current Status/Outcome:**\n\n* The issue remains unresolved. \n* The Pieces OS team is aware and working on a solution.\n\n**Additional Notes:**\n\n* The issue was reported by a single user, so it's unclear how widespread it is. \n* The specific antivirus software involved is not mentioned. \n\n**Recommendation:** \n\n* Users experiencing similar issues should report them to the Pieces OS support team. \n* The team will likely provide more information and updates as they become available.",
          "activity_level": 7.0
        },
        {
          "id": 528,
          "title": "I can't use any GPT models other than 'GPT-4o Mini'",
          "text": "I can't use any GPT models other than 'GPT-4o Mini'\n### Software\n\nDesktop Application, JetBrains, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.15\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n\"I'm sorry. Something went wrong with processing. Please wait a few seconds and try again, or contact support@pieces.app\"\n\nIf the model is 4o Mini, everything works fine.\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* An unexpected error message is encountered when interacting with Copilot.\n* This issue has been reported before in various forms.\n* The issue might be related to rate limiting problems or conversation flow issues.\n\n**Problems Identified:**\n\n* The user receives an error message while trying to use Copilot.\n* The cause of the error message is unclear.\n* The issue may be related to specific configurations or limitations.\n\n**Solutions Proposed/Implemented:**\n\n* Update to PiecesOS 11.0.0 to potentially resolve the rate limiting problem.\n* Authenticate to avoid rate limiting issues.\n* Schedule a meeting with the support team if the issue persists after authentication and updating to PiecesOS 11.0.0.\n\n**Current Status/Outcome:**\n\n* The issue is marked as a duplicate of another reported issue.\n* The conversation is closed, suggesting the issue is resolved or requires further action from the user.\n\n**Additional Notes:**\n\n* The provided resources might be helpful for further troubleshooting or information regarding the issue.",
          "activity_level": 7.25
        }
      ]
    },
    {
      "title": "Pieces OS Plugin Connectivity Issues After Update",
      "description": "Users are experiencing connectivity problems with Pieces OS plugins (VSCode, PHPStorm) after the latest update.  Issues include port conflicts and plugin incompatibility.  Suggested solutions involve ensuring Pieces OS is running on the correct port, reinstalling/updating plugins, and waiting for official updates from the Pieces team.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 534,
          "title": "Pieces os says: port already in use if i start phpstorm with pieces plugin",
          "text": "Pieces os says: port already in use if i start phpstorm with pieces plugin\n### Software\n\nPieces OS\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.0 2024-12-17\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nif i start my computer, pieces-os starts. Then, if i start phpstorm, there's a message: \n> It looks like port 5323 is occupied by another application. Pieces OS uses this port to communicate with plugins. Please, enable Pieces OS to run on port 5323.\n\nEven if I kill the pieces-os on port 5323 and start up phpstorm, it still get's this error. So it looks like phpstorm is trying to start piecec-os again, and I think more than once.\nI did snap refresh pieces-os => snap \"pieces-os\" has no updates available\nphp storm plugin is to be 10.0.0\n\n##  GitHub Issue Summary: Developer Suite Update Issue \n\n**Key Points:**\n\n* Developer suite for Pieces OS is experiencing issues.\n* VScode and PHPStorm plugins are not working.\n* Issue has been acknowledged by Pieces support team.\n\n**Problems:**\n\n* Plugins are not working after a Pieces OS update.\n* Users are unable to use the developer suite.\n\n**Solutions:**\n\n* Pieces team is updating the developer suite.\n* Waiting for the latest JetBrains plugin to be verified. \n\n**Current Status:**\n\n* Update is ongoing. \n* Solution expected within 12-24 hours. \n* Original ticket will be updated with progress.",
          "activity_level": 4.5
        },
        {
          "id": 530,
          "title": "Vscode and PHPStorm plugins stopped working after Pieces OS update",
          "text": "Vscode and PHPStorm plugins stopped working after Pieces OS update\n### Software\n\nVS Code, Visual Studio\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nYesterday was working great. Minutes ago it prompt me to update Pieces OS and Pieces for Developers. After the update both Vscode and PHPStorm plugins stopped working.\n\nPHPStorm says - It looks like port 1000 is occupied by another application. Pieces OS uses this port to communicate with plugins. Please, enable Pieces OS to run on port 1000.\n\nAnd Vscode says - Please update the Pieces for VS Code extension to the latest version. This version is only compatible with Pieces OS versions less than 11.0.0, and  you have 11.0.0 installed. But there isn't any Vscode plugin update.\n\nCan you help? Is there a way to downgrade?\n\n![Image](https://github.com/user-attachments/assets/973ecc53-1230-4b25-93df-b8f258273f19)\n\n![Image](https://github.com/user-attachments/assets/a0d82807-7d45-4279-af39-b223896bd4ca)\n\n## Summary of GitHub Issue Conversation: \n\n**Key Points:**\n\n* A new version of Pieces OS was released on December 17, 2024.\n* @rafael-a-g-n reported an antivirus issue with the new version, flagging it as suspicious access.\n\n**Problems Identified:**\n\n* Antivirus software flagged the new Pieces OS update as a potential threat.\n* This may deter users from updating and cause concerns about the software's safety.\n\n**Proposed Solutions:**\n\n* The Pieces OS team acknowledged the issue and attempted to address it.\n* Further investigation and solutions are likely needed.\n\n**Current Status/Outcome:**\n\n* The issue remains unresolved. \n* The Pieces OS team is aware and working on a solution.\n\n**Additional Notes:**\n\n* The issue was reported by a single user, so it's unclear how widespread it is. \n* The specific antivirus software involved is not mentioned. \n\n**Recommendation:** \n\n* Users experiencing similar issues should report them to the Pieces OS support team. \n* The team will likely provide more information and updates as they become available.",
          "activity_level": 7.0
        },
        {
          "id": 531,
          "title": "Pieces Desktop App - Lost Connection to PiecesOS",
          "text": "Pieces Desktop App - Lost Connection to PiecesOS\n_PiecesOS Information_\n\n**ID:** 18986c5c-5aef-40f4-ac00-93da40fd8b47\n**User:** 1446bb64-5370-4644-a0ee-5ab3b4f3a7ac\n**Current Version:** Unknown\n**Min Version Supported:** 11.0.0\n**Max Version Supported:** 12.0.0\n**Local Port:** 127.0.0.1:39300\n\n_Device Information_\n\n**Operating System:** Windows\n**Current Version:** \"Windows 10 Pro\" 10.0 (Build 26100)\n**Min Version Supported:** Windows 10 Build 1903\n\nPieces for developers always loosing connection and self closing pieces OS\n## Summary of GitHub Issue Conversation\n\n**Key points:**\n\n* User rafael-a-g-n reported an issue where Pieces Desktop and OS cannot connect after upgrading to the latest version.\n* The issue was automatically triaged and routed to the proper team member.\n\n**Problems identified:**\n\n* Pieces Desktop and OS cannot connect after updating to the latest version.\n\n**Solutions proposed/implemented:**\n\n* The user was encouraged to schedule a call using the provided link to discuss the issues in detail.\n* The user was requested to share a video demonstrating the problem for better understanding.\n\n**Current status/outcome:**\n\n* User provided an image showing the error message.\n* The issue is currently being investigated by the Pieces team.\n\n**Additional Information:**\n\n* Related issues and helpful resources were shared with the user.\n\n## Important Details:\n\n1. Specific error message:  The image shared by the user provides information about the specific error.\n2. Timeframe of the update: It was the new update that is causing this problem.",
          "activity_level": 5.5
        }
      ]
    },
    {
      "title": "Ollama and LLM Download and Installation Issues",
      "description": "Users are experiencing difficulties downloading, installing, and enabling LLMs, particularly with Ollama integration on Linux. Issues include failed installations, interrupted downloads, and problems recognizing manually downloaded models. Solutions involve improved download resumption, clearer instructions for manual imports, and bug fixes for Ollama installation.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 537,
          "title": "Ollama Fails to Install on Linux",
          "text": "Ollama Fails to Install on Linux\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nUser reports immediate \"Ollama failed to install\" diaglog upon clicking install Ollama install button in Pieces desktop app\n## Github Issue Conversation Summary\n\n**Key Points Raised:**\n\n* User Brian reported an issue related to the application.\n* The issue was automatically triaged and routed to the appropriate Pieces team member.\n\n**Problems Identified:**\n\n* The specific nature of the issue Brian reported is not available.\n\n**Solutions Proposed/Implemented:**\n\n* The bot provided links to relevant support resources and related issues.\n\n**Current Status/Outcome:**\n\n* Brian should receive a follow-up from the Pieces team within 24 hours.\n\n**Additional Information:**\n\n* The specific issue Brian reported will be addressed by the Pieces team.\n* The issue may be related to downloading a LLM, Long-Term Memory Engine, or onboarding issues.\n\n**Next Steps:**\n\n* Brian should wait for the follow-up from the Pieces team.\n\n## Summary\n\nBrian reported an issue with the Pieces application. The issue was automatically routed to the proper team member, and Brian should receive a follow-up within 24 hours. The specific problem and solution remain unclear in this conversation snippet.",
          "activity_level": 5.36
        },
        {
          "id": 527,
          "title": "Manually downloading a LLM",
          "text": "Manually downloading a LLM\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\nLatest\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI am attempting to install Pieces with a local LLM. Unfortunately, I have an unstable network connection (which is why I want a local model in the first place.) I am trying to get Mistral-7B.\n\nI found that Pieces wants to download the whole model (4 GB) all at once. If it fails for whatever reason, it restarts from the beginning.  This is annoying and it makes downloading virtually impossible, because my network connection does not stay long enough to pull 4GB in one go.\n\nI have figured out where the file is being downloaded to and from, and managed to download it manually with wget. Now the problem is that Pieces refuses to recognize it. Even if I put it in the right place, the Pieces app stil shows the Download button in the UI, and clicking Download truncates the file to zero and starts the download from the beginning.\n\nI tried to edit models.db and change \"downloaded\" to true in the relevant line, but it has no effect.\n\nIs there anything else I could do?\n## GitHub Issue Summary\n\n**Issue:** \n* Importing downloaded model manually into Pieces was not successful.\n* Updating to newest Pieces version caused Ollama installation failure.\n\n**Key points:**\n* Difficulty importing manually downloaded model.\n* Model installation failing with error messages.\n* Partial model downloads unable to resume.\n* User unable to utilise local LLMs after update.\n\n**Identified problems:**\n* Unclear instructions on manual model import.\n* Existing issue with model resuming interrupted downloads.\n* Ollama installation failure for local model use.\n\n**Proposed solutions:**\n* Add manual import instructions or allow import from UI.\n* Implement download resumption for interrupted sessions.\n* Fix Ollama installation issues.\n\n**Implemented solutions:**\n* New Pieces release featuring download resumption.\n* Ollama download link provided for self-installation.\n\n**Current status:**\n* Manual import remains unclear.\n* New Pieces release should address download resumption failures.\n* Users can self-install Ollama for now.\n\n**Additional information:**\n* Separate issue regarding Ollama installation created (#537).\n\n**Overall, ongoing development is addressing model download and installation issues. The new Pieces release should improve user experience, but manual import options remain unclear.**",
          "activity_level": 6.38
        },
        {
          "id": 442,
          "title": "Can't turn on Long-Term Memory Engine",
          "text": "Can't turn on Long-Term Memory Engine\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\nPieces OS 10.1.11 and Pieces for Developers 3.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHello all and thanks again for that great Pieces app!\r\nI have a problem, i can't turn on Long-Term Memory Engine in the option menu\r\nI can't turn it on when i start a copilot chat, i see the box to enable it, i click on it, i can see the green valid mark that shows the  Long-Term Memory Engine is on but when i try to write something and send the request, i just see that:\r\n\r\n\"In order to get the most out of Long-Term Memory (LTM) Context, you need to enbale the Long-Term Memory Engine, which provides time-based contextual awereness for your Copilot.\"\r\nWith 2 buttons under the text : \r\n-  \"Enbale Long-Term Memory engine\" (which is not working when i click on it) \r\n-  \"Learn about LTM Context\"\r\n\r\nI can't use anymore Copilot chat which is a bit difficult to use PIeces well. If you need more info related on my configuration or something else feel free to ask :)\n## GitHub Issue Summary\n\n**Title:** (Not provided)\n\n**Key Points:**\n\n* LTM Engine not working properly on Linux.\n* Issue appears to be specific to the menu popover and not the PiecesOS desktop app.\n* Occurs on both Manjaro and Pop!_OS with x11.\n* Ubuntu users do not seem to be affected.\n\n**Problems:**\n\n* LTM Engine not turning on properly.\n\n**Solutions:**\n\n* A new LTM Engine solution that works for both Wayland and x11 is in testing phase and should be rolled out soon.\n\n**Current Status:**\n\n* Issue should be resolved in PiecesOS version 11.0.0.\n* Users experiencing the issue are advised to reopen or create a new ticket.\n\n**Outcome:**\n\n* Issue closed with the release of version 11.0.0. \n\n**Additional Notes:**\n\n* The specific versions of PiecesOS and Pieces For Developers used by users experiencing the issue are noted.",
          "activity_level": 3.37
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize LLM and Copilot Issues:** Focus on resolving issues related to \"LLM Context Limit and Rate Limiting Errors\" and \"Copilot Model Processing Errors\" as they are the most frequent and impactful.",
    "**Improve Plugin Compatibility and Communication:** Address the \"Pieces OS 11.0.0 Plugin Compatibility Issues\" urgently and provide clear communication and instructions to users on updating plugins.",
    "**Enhance Ollama Installation Experience:** Investigate and resolve the \"Ollama and LLM Download and Installation Issues\" to ensure a smoother onboarding process for users wanting to utilize local LLMs.",
    "**Review and Improve Error Messages:** Analyze the common issues and active tickets to identify unclear or unhelpful error messages, and work on improving them to aid user troubleshooting.",
    "**Provide Clearer Documentation for Manual Operations:** Create or update documentation for manually downloading and importing LLMs, as well as resolving port conflicts, to empower users facing these challenges.",
    "**Monitor Plugin Update Rollouts:** Implement a system to closely monitor plugin updates after major Pieces OS releases to quickly identify and address compatibility issues.",
    "**Consider a Staged Plugin Update Approach:** Explore a staged rollout of plugin updates, potentially with beta testing, to catch compatibility issues before they impact a wider user base.",
    "**Gather User Feedback on Rate Limiting:** Collect feedback from users experiencing rate limiting to understand their use cases and adjust the system accordingly to minimize disruption for legitimate users.",
    "**Investigate Antivirus False Positives:** Work with antivirus vendors to address the reported false positive detection of Pieces OS 11.0.0 to prevent unnecessary user concern and update barriers.",
    "**Proactively Communicate Known Issues:** Maintain a public-facing list of known issues and workarounds, such as the plugin compatibility issues, to keep users informed and manage expectations during updates or outages.",
    "**Analyze Ticket Trends for Proactive Support:** Regularly analyze support ticket trends and activity levels to identify recurring issues, predict potential problem areas, and proactively address them before they escalate.",
    "**Develop Automated Troubleshooting Tools:** Explore developing automated troubleshooting tools or diagnostic scripts that users can run to identify common problems, such as port conflicts or plugin version mismatches, to reduce the support burden and resolution time.",
    "**Create a Dedicated Plugin Support Channel:** Consider establishing a dedicated support channel or forum specifically for plugin-related issues to streamline troubleshooting and provide a centralized resource for users facing these challenges.",
    "**Implement User-Facing Rate Limit Information:** Provide users with clear information about their rate limit status, usage, and options for increasing it, if applicable, to improve transparency and reduce frustration related to rate limiting errors.",
    "**Enhance In-App Guidance and Support Resources:** Improve in-app guidance and integrate support resources, such as FAQs, troubleshooting tips, and links to relevant documentation, directly within the Pieces OS interface to empower users to self-serve and find solutions quickly."
  ],
  "message": "Daily support report generated successfully."
}