{
  "success": true,
  "date_range": {
    "start": "2025-01-06T00:00:00+00:00",
    "end": "2025-01-10T21:06:22.205978+00:00"
  },
  "summary": {
    "total_tickets": 20,
    "resolved_tickets": 5,
    "open_tickets": 15
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 14,
      "resolved": 4,
      "pending": 10
    },
    {
      "category": "status:new",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "app:desktop application",
      "received": 7,
      "resolved": 1,
      "pending": 6
    },
    {
      "category": "os:macos",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "app:pieces copilot module",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "status:triaged",
      "received": 9,
      "resolved": 0,
      "pending": 9
    },
    {
      "category": "P0",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "app:obsidian",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:in_progress",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:resolved",
      "received": 5,
      "resolved": 4,
      "pending": 1
    },
    {
      "category": "known_issue",
      "received": 3,
      "resolved": 2,
      "pending": 1
    },
    {
      "category": "app:vs code",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "announcement",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:linux",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "app:pieces os",
      "received": 7,
      "resolved": 3,
      "pending": 4
    },
    {
      "category": "documentation",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:jetbrains",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:jupyterlab",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:web extension",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "app:visual studio",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:cli",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:neovim",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:sublime plugin",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces cli",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:raycast plugin",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "resolved",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:raycast extension",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "blocked",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "on the roadmap",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:sharing web app",
      "received": 1,
      "resolved": 1,
      "pending": 0
    }
  ],
  "most_active_tickets": [
    {
      "number": 550,
      "title": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)",
      "activity_level": 7.97
    },
    {
      "number": 540,
      "title": "LTM doesn't work; the copilot model by defaults not saved",
      "activity_level": 6.89
    },
    {
      "number": 572,
      "title": "Pieces OS Does not recognize folders or files",
      "activity_level": 6.65
    },
    {
      "number": 568,
      "title": "Long-Term Memory Feature Not Working on Linux",
      "activity_level": 5.52
    },
    {
      "number": 538,
      "title": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins",
      "activity_level": 4.79
    },
    {
      "number": 584,
      "title": "Copilot is not giving any feedback",
      "activity_level": 4.42
    },
    {
      "number": 574,
      "title": "Obsidian Plugin",
      "activity_level": 4.1
    },
    {
      "number": 556,
      "title": "Live context seems not to work on linux",
      "activity_level": 4.08
    },
    {
      "number": 443,
      "title": "Unable to generate personal shareable links for 6+ months",
      "activity_level": 3.71
    },
    {
      "number": 562,
      "title": "Chrome Extension Fills Developer Console with Errors",
      "activity_level": 3.55
    },
    {
      "number": 564,
      "title": "Unable to open Pieces Copilot Service",
      "activity_level": 3.38
    },
    {
      "number": 566,
      "title": "Pieces Copilot not working on Windsurf",
      "activity_level": 3.33
    },
    {
      "number": 561,
      "title": "Copilot Bug: 'I'm sorry. Something went wrong with processing. Please...' copilot response",
      "activity_level": 3.06
    },
    {
      "number": 576,
      "title": "Unable to get any response for any question from Co-pilot for model Claude 3.5 Sonnet",
      "activity_level": 3.0
    },
    {
      "number": 553,
      "title": "Can't turn on Long-Term Memory",
      "activity_level": 2.89
    },
    {
      "number": 582,
      "title": "Saved Snippets Welcome Screen",
      "activity_level": 2.8
    },
    {
      "number": 565,
      "title": "Starting error: No available configurations for the given RGBA pixel format",
      "activity_level": 2.75
    },
    {
      "number": 581,
      "title": "Unable to open Pieces Copilot Service",
      "activity_level": 2.15
    },
    {
      "number": 577,
      "title": "Announcement: For the short-term(next couple of weeks) we are re-routing all Claude requests to Gemini",
      "activity_level": 1.93
    },
    {
      "number": 573,
      "title": "extension Raycast is outdated",
      "activity_level": 1.58
    }
  ],
  "common_issues": [
    {
      "title": "Long-Term Memory (LTM) Engine Issues",
      "description": "Users are experiencing problems enabling and using the Long-Term Memory (LTM) Engine in Pieces OS. This includes issues with LTM not activating, downloaded LLMs overriding saved data, and potential conflicts with the Qdrant dependency. Solutions include patches to prevent data overrides and planned infrastructure updates to address Qdrant boot issues.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 572,
          "title": "Pieces OS Does not recognize folders or files",
          "text": "Pieces OS Does not recognize folders or files\n### Software\n\nDesktop Application, VS Code, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS 11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nSo until about a weekish ago, Everything would work smoothly, except for some other issues that did annoy me, but I had workarounds for them. Those issues was pieces os not working after a while. Not a big deal since I would just close it in task manager and reopen it once it was all closed to force a hard restart of the whole system. But, now (thanks for listening to my little rant up there) there is an issue that I cannot workaround. For some reason pieces cannot get any context from any files or folders, and its getting pretty annoying to the fact that I have started using other softwares because at least they can look at the files and suggest changes or edits that actually have something to do with my code. I believe this happened ever since i updated pieces os about 2-3 updates ago, but cannot pinpoint any specific cause. Another cause may be that fact that I downloaded Ollama but never really used it.\n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* User (RamanBaig) reported an issue where Pieces could recognize files and their names but could not read their content unless it was copied and pasted into the chat.\n* This issue was particularly troublesome for large files with thousands of lines of code.\n\n**Problems Identified:**\n\n* The long term memory feature seemed to be a factor.\n* The issue persisted across all file types and folders.\n* The issue occurred on Windows 11 and with both Claude and GPT models.\n\n**Solutions Proposed/Implemented:**\n\n* Sam, a Pieces team member, asked for more details to reproduce the issue and tried to identify potential fixes.\n* They offered to schedule a call with the user for further troubleshooting.\n* Mark, another Pieces team member, offered their own calendar availability for a call. \n\n**Current Status/Outcome:**\n\n* The root cause of the problem remains unidentified. \n* A potential solution was implemented, but its effectiveness is yet to be confirmed.\n* A call between the user and either Sam or Mark is scheduled to investigate further.\n\n**Additional Information:**\n\n* The specific version of Windows 11 used by the user is Windows 11 Home, 24H2.\n* The affected folder contained approximately 9 files, with 4 of them being actively used and containing thousands of lines of code.\n\n**Next Steps:**\n\n* Conduct the scheduled call between the user and Pieces team members for further troubleshooting.\n* Verify if the implemented solution resolves the issue. \n\nI hope this summary is helpful!",
          "activity_level": 6.65
        },
        {
          "id": 540,
          "title": "LTM doesn't work; the copilot model by defaults not saved",
          "text": "LTM doesn't work; the copilot model by defaults not saved\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n[https://disk.yandex.ru/i/Z_U0FzYA8NBrNg](url)\nThere is a video here that describes the problem\n## Summary of GitHub Issue Conversation: Long-Term Memory Engine (LTM) not working\n\n**Key Points Raised:**\n\n* User reported LTM not enabling and provided a video demonstrating the issue.\n* Logs and video confirmed the problem, showcasing an override of saved data by downloaded LLM.\n\n**Problems Identified:**\n\n* Downloaded LLM state overrides saved selected model, preventing LTM activation.\n* Dependency for LTM Engine (Qdrant) fails to boot on user's machine.\n* High idle time expense observed by user.\n\n**Solutions Proposed/Implemented:**\n\n* Patch released to fix downloaded LLM state overriding saved data (v11.0.1 of PiecesOS and v3.3.1 of Desktop app).\n* Database infrastructure update planned to address Qdrant boot issues.\n\n**Current Status/Outcome:**\n\n* User confirmed LTM is still not enabled after the update.\n* Investigation ongoing to determine if Qdrant boot failure is a separate issue or caused by slow boot time.\n* User's PyCharm plugin crashes when using Copilot with Shift+Enter.\n* User observes high idle time expense with LTM.\n\n**Additional Notes:**\n\n* User reinstalled Pieces from Microsoft Store, which resolved the LTM issue but introduced a PyCharm plugin crash.\n* User communicates using Yandex Translate, requiring extra consideration in conversation.\n* Issue remains open as investigation and solution for Qdrant boot failure and high idle time expense are ongoing.",
          "activity_level": 6.89
        },
        {
          "id": 553,
          "title": "Can't turn on Long-Term Memory",
          "text": "Can't turn on Long-Term Memory\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nFirst of all amazing job guys, It feels amazing to use the pieces app but recently i'm getting a very unusual error.\n\n![Image](https://github.com/user-attachments/assets/eafefce0-3f8e-4aa8-baad-0b14d3661a18)\n\n![Image](https://github.com/user-attachments/assets/f19e9d10-63cf-404a-bd11-a050132c6854)\n\nAfter the activating loading state i get the same message again when i ask a question.\n\nIn order to get the most out of Long-Term Memory (LTM) Context, you need to enable the Long-Term Memory Engine, which provides time-based contextual awereness for your Copilot.\"\nWith 2 buttons under the text :\n\n\"Enbale Long-Term Memory engine\" (which is not working when i click on it)\n\"Learn about LTM Context\"\n## GitHub Issue Summary: Long-Term Memory Engine (LTM) not turning on\n\n**Key Points:**\n\n* User (@Shariq12345) reported an issue with the Long-Term Memory Engine (LTM) not turning on on their machine.\n* The issue was automatically triaged by Pieces support bot.\n* Pieces Support team acknowledged the issue and informed the user about ongoing efforts to replace the current infrastructure.\n* The user expressed appreciation for Pieces' work and UI.\n* Pieces Support team provided an update on the migration of the database stack, aiming for a resolution by the end of January 2025.\n\n**Problems:**\n\n* User was unable to turn on the LTM feature in Pieces.\n\n**Solutions:**\n\n* Pieces Support team is working on replacing the current infrastructure responsible for the LTM feature.\n* A migration of the database stack is planned for completion by the end of January 2025, which is expected to resolve the issue.\n\n**Current Status:**\n\n* The issue is acknowledged and being addressed by the Pieces Support team.\n* A fix is expected to be implemented with the database stack migration by the end of January 2025.\n\n**Outcome:**\n\n* Once the database stack migration is complete, users should be able to turn on the LTM feature in Pieces without problems.",
          "activity_level": 2.89
        }
      ]
    },
    {
      "title": "Pieces OS Connectivity Issues in Remote Environments",
      "description": "Users reported difficulties connecting to Pieces OS from VS Code in remote environments like Docker containers, encountering error messages and API check failures. This was attributed to network changes in Pieces OS 11.0.0. A patch in VS Code extension v2.0.1 aimed to resolve this, but some users still faced issues, requiring further debugging.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 550,
          "title": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)",
          "text": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)\n### Software\n\nVS Code\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.02\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI'm having the same problem as this: https://github.com/pieces-app/support/issues/269\n\nUsing VS Code project within a docker container and getting this message:\n\n> Woops! It seems like you are running VS Code in a remote environment & Pieces for VS Code cannot connect to Pieces OS. Please refer to our documentation on how to resolve this issue.\n\n![Image](https://github.com/user-attachments/assets/ffeb53fd-0787-4bc2-9faf-c5f3d179294b)\n\nPieces OS version:\n\n![Image](https://github.com/user-attachments/assets/640d35af-6106-4717-9269-c51205ff23fb)\n\nI followed this guide but with no luck: https://docs.pieces.app/product-highlights-and-benefits/connecting-to-a-remote-pieces-os-instance\n\nLAN IP:\n\n<img width=\"567\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/1dfb849d-0764-4ae0-801c-c55f9b3e5d7e\" />\n\nVS Code settings, pieces custom URL:\n\n![Image](https://github.com/user-attachments/assets/aaed7eb8-36e7-49cb-b6e0-84271adb8027)\n\nWhat else can I try?\n\nThanks!\n\n## Conversation Summary:\n\n**Problem:** User @malanciault was unable to connect to Pieces OS from VS Code when using a remote container in Docker, resulting in error messages. This issue persisted even when opening a project or not.\n\n**Troubleshooting and Diagnosis:**\n\n* Initial troubleshooting advice by the Pieces Support Bot included reviewing related issues and documentation.\n* @robert-at-pieces identified documentation inconsistencies regarding port changes in newer versions of Pieces OS. \n* User confirmed the port number and tried connecting, but without success.\n* It was confirmed that the VSCode remote instance was hosted inside Docker.\n* Further testing revealed issues arising specifically when opening remote projects within the container.\n\n**Cause:** Networking changes in Pieces OS 11.0.0 restricted server listening to the loopback interface by default, causing a disconnect between the remote container and Pieces OS.\n\n**Solution:**\n\nA patch was planned to allow Pieces Server to listen on all interfaces again.\nA complex workaround involving DNS configuration was offered as a temporary solution until the patch was deployed.\n\n**Patch Deployment:**\n\nThe VSCode extension was updated to version 2.0.1, incorporating the necessary patch. Users were instructed to update the plugin and try connecting with a blank custom URL.\n\n**Outcome:**\n\nThe user confirmed updating the plugin but reported the issue persisted. A video call was suggested for deeper debugging.\n\n\n## Key Points:\n\n* The user experienced a connection issue between a Docker container and Pieces OS.\n* The problem originated from network restrictions in the latest Pieces OS version.\n* A patch addressing the problem was deployed in VSCode extension version 2.0.1.\n* The user still faced connectivity issues after installing the patch and further assistance through a video call was offered.\n\n## Current Status:\n\nWhile the patch addressed the root cause, the user continues to experience connection errors. A scheduled video call aims to delve deeper into the issue and find a definitive resolution.",
          "activity_level": 7.97
        },
        {
          "id": 562,
          "title": "Chrome Extension Fills Developer Console with Errors",
          "text": "Chrome Extension Fills Developer Console with Errors\n### Software\n\nWeb Extension\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nIt appears the browser extension is sniffing a bunch of local ports - starting with 1000.  This is a bit concerning, and a little invasive, but I do have the Pieces OS running, and it does finally get a response at a high port.\n\nThis fills my devtools console tab, degrading my development experience by clouding errors I'm looking for in my own app.\n\nFor a product designed to enhance my development experience I'm marking this as a bug.\n\n<img width=\"753\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/6b95b2c4-881c-4682-a544-3ae138e644ae\" />\n\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* After updates to Pieces OS, the designated port for the API can change, causing failed API checks in development tools.\n* The failed calls are only attempts to verify Pieces OS is active and don't scan for anything else.\n* Users raised concerns about privacy invasion and development tool usability due to the error flooding.\n\n**Problems Identified:**\n\n* Failed API check calls flood the dev tool and appear as errors, making debugging difficult.\n* This may be due to a bug in Chrome, causing the extension's handled failures to surface in the dev tool logs.\n\n**Solutions Proposed/Implemented:**\n\n* Rutvik from Pieces explored hiding or better handling errors from inactive port checks.\n* Rutvik planned a fix in the upcoming extension patch (January 6th, 2025) to address the issue.\n* Rutvik suggested users could use the \"Hide Network Messages\" option to prevent the network logs in dev tools (though feasibility was unsure).\n\n**Current Status/Outcome:**\n\n* Rutvik discovered the issue might stem from a Chrome bug, making a permanent solution uncertain.\n* The proposed solution of hiding network messages in dev tools might be a temporary workaround for users.\n* It is unclear whether the bug in Chrome has been resolved, making a definitive fix in Pieces uncertain at this time.",
          "activity_level": 3.55
        },
        {
          "id": 581,
          "title": "Unable to open Pieces Copilot Service",
          "text": "Unable to open Pieces Copilot Service\nError: ApiException 500: Format Metrics snapshot failed.\n\n**Installation Details**\n\nSucceeded: true\nPath: /Applications/Pieces OS.app/Contents/MacOS/Pieces OS\n\n**PiecesOS Information**\n\nID: 82313D61-B87D-497A-A189-4BEC467D8715\nUser: a90f1391-91a7-4d45-9a67-ef0d76ea0cd4\nCurrent Version: 11.0.0\nMin Version Supported: 11.0.0\nMax Version Supported: 12.0.0\nLocal Port: 39300\n\n**Device Information**\n\nOperating System: MacOS\nCurrent Version: Version 15.2 (Build 24C101)\nMin Version Supported: 12.0.0 Monterey\n## GitHub Issue Conversation Summary\n\n**Key Points:**\n\n* User Minhajms reported an issue with PiecesOS.\n* The issue has been resolved in PiecesOS release 11.0.3.\n* The user is advised to update to the latest version.\n\n**Problems Identified:**\n\n* The user was experiencing an issue with PiecesOS.\n* The specific nature of the issue is not mentioned.\n\n**Solutions Proposed/Implemented:**\n\n* Update to PiecesOS version 11.0.3 to resolve the issue.\n\n**Current Status/Outcome:**\n\n* The issue is resolved.\n* The user is encouraged to update to the latest version.\n\n## Additional Notes\n\n* The conversation is brief and does not provide much detail about the specific issue or the user's experience.\n* It is unclear if the user has updated to the latest version or if the issue remains resolved.",
          "activity_level": 2.15
        }
      ]
    },
    {
      "title": "Long-Term Memory Feature Issues",
      "description": "Users report the Long-Term Memory (LTM) feature is not working as expected, particularly on Linux. Issues include feature unavailability, failure to activate, and inability to access LTM context. Proposed solutions involve infrastructure improvements, database migration, and software updates. Users are encouraged to update to the latest version and try specific prompting techniques for better LTM performance.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 568,
          "title": "Long-Term Memory Feature Not Working on Linux",
          "text": "Long-Term Memory Feature Not Working on Linux\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n### Description\nI'm experiencing issues with the Long-Term Memory feature on Linux. While the Discord team has confirmed that this feature should be available on Linux, the Pieces OS interface explicitly shows that the feature is not available for Linux systems.\n\n### Current Behavior\n- Pieces OS shows a message indicating Long-Term Memory is not available for Linux\n- Long-Term Memory functionality does not work on the Linux platform\n- Other operating systems appear to have this feature working correctly\n\n### Expected Behavior\n- Long-Term Memory feature should be available and functional on Linux, as confirmed by the Discord team\n\n### Evidence\n- [Discord communication confirming feature availability](https://discord.com/channels/1098986658851999776/1320479548797882430/1320643614443048971)\n\n- ![Screenshot showing Pieces OS message about feature unavailability on Linux](https://github.com/user-attachments/assets/ca6cb2d0-ef52-4194-bd57-c8a84be2d0db)\n\n\n\n### Questions\n1. When can Linux users expect this feature to be fully available?\n2. Is there a planned timeline for Linux support?\n3. Are there any workarounds available in the meantime?\n\n### System Information\n- Operating System: Linux [Zorin OS 17.2 based on Linux 6.8.0-50-generic~22.04.1-Ubuntu]\n- Pieces OS Version: [PiecesOS 11.0.3]\n- Desktop App: [Pieces for Developers 3.3.2]\n\n### Additional Notes\nThis feature is currently working on other operating systems, and Linux users would greatly benefit from having access to this functionality.\n\n## Summary of GitHub Issue Conversation Regarding Long-Term Memory Feature on Linux\n\n**Key Points:**\n\n* Long-Term Memory (LTM) feature is currently in testing on Linux.\n* It is working on X11 but not Wayland.\n* The Discord team may have provided incorrect information about its availability.\n* There are some issues causing the LTM feature not to work for some users.\n\n**Problems Identified:**\n\n* The LTM feature is not working for some users on Wayland.\n* The user interface does not clearly indicate that the feature is not working.\n\n**Solutions Proposed/Implemented:**\n\n* Users are encouraged to switch to X11 to use the LTM feature.\n* The developers are working on deprecating the dependency that is causing the issue.\n* Users are asked to share their logs to help diagnose the problem.\n* A live troubleshooting session is scheduled to help affected users.\n\n**Current Status/Outcome:**\n\n* The LTM feature is still in testing and not yet fully functional on Linux.\n* The developers are working on fixing the issues and making the feature more stable.\n* Affected users are encouraged to participate in the troubleshooting session to help resolve the problem.\n\n**Additional Notes:**\n\n* The conversation mentions a similar issue reported in another GitHub issue (#553).\n* Users are encouraged to refer to the linked issue for further information and updates.",
          "activity_level": 5.52
        },
        {
          "id": 553,
          "title": "Can't turn on Long-Term Memory",
          "text": "Can't turn on Long-Term Memory\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nFirst of all amazing job guys, It feels amazing to use the pieces app but recently i'm getting a very unusual error.\n\n![Image](https://github.com/user-attachments/assets/eafefce0-3f8e-4aa8-baad-0b14d3661a18)\n\n![Image](https://github.com/user-attachments/assets/f19e9d10-63cf-404a-bd11-a050132c6854)\n\nAfter the activating loading state i get the same message again when i ask a question.\n\nIn order to get the most out of Long-Term Memory (LTM) Context, you need to enable the Long-Term Memory Engine, which provides time-based contextual awereness for your Copilot.\"\nWith 2 buttons under the text :\n\n\"Enbale Long-Term Memory engine\" (which is not working when i click on it)\n\"Learn about LTM Context\"\n## GitHub Issue Summary: Long-Term Memory Engine (LTM) not turning on\n\n**Key Points:**\n\n* User (@Shariq12345) reported an issue with the Long-Term Memory Engine (LTM) not turning on on their machine.\n* The issue was automatically triaged by Pieces support bot.\n* Pieces Support team acknowledged the issue and informed the user about ongoing efforts to replace the current infrastructure.\n* The user expressed appreciation for Pieces' work and UI.\n* Pieces Support team provided an update on the migration of the database stack, aiming for a resolution by the end of January 2025.\n\n**Problems:**\n\n* User was unable to turn on the LTM feature in Pieces.\n\n**Solutions:**\n\n* Pieces Support team is working on replacing the current infrastructure responsible for the LTM feature.\n* A migration of the database stack is planned for completion by the end of January 2025, which is expected to resolve the issue.\n\n**Current Status:**\n\n* The issue is acknowledged and being addressed by the Pieces Support team.\n* A fix is expected to be implemented with the database stack migration by the end of January 2025.\n\n**Outcome:**\n\n* Once the database stack migration is complete, users should be able to turn on the LTM feature in Pieces without problems.",
          "activity_level": 2.89
        },
        {
          "id": 556,
          "title": "Live context seems not to work on linux",
          "text": "Live context seems not to work on linux\n### Software\n\nDesktop Application, Pieces OS, Web Extension, Sublime Plugin\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.2\n\n### Early Access Program\n\n- [x] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nit seems that live context doesn't work on my linux distro. Try to use it from desktop app, sublime plugin and web extension, but as i ask something even basilar about the context, the copilot does not know nothing. \nTried different LLMs too. I can't disable LTM either. \n\nI read in another issue that running pieces-os as snap app, could be a problem for load other system dependencies. Don't know if this could help.\n\nDon't know which other info could be helpful\n## GitHub Issue Conversation Summary\n\n**Key Points:**\n\n* User scotch86 reported an issue with the LTM on Ubuntu 24.10. They were unable to use features like asking about past activities or visited pages, despite having LTM context enabled.\n* Mark-at-pieces, a developer, acknowledged the issue and confirmed it was being addressed in EOD 11.0.3.\n\n**Problems Identified:**\n\n* LTM functionality not working as expected on Linux.\n* Difficulty in prompting the LTM effectively.\n\n**Solutions Proposed/Implemented:**\n\n* EOD 11.0.3 was released to fix the LTM issue on Linux.\n* Developer provided suggestions for better LTM prompting:\n    * Specifying a time range\n    * Referring to a specific topic or person\n    * Focusing on a particular application\n\n**Current Status/Outcome:**\n\n* The issue should be resolved with EOD 11.0.3.\n* Users are encouraged to try the suggested prompting techniques for improved LTM experience.\n\n**Additional Notes:**\n\n* User confirmed the issue persists after updating to the latest version.\n* Developer suggests waiting for further updates if the problem is still present.",
          "activity_level": 4.08
        }
      ]
    },
    {
      "title": "Pieces for Developers Obsidian Plugin Installation Issues",
      "description": "Users report the Pieces for Developers Obsidian plugin fails to load after installation, despite successful installation messages.  Troubleshooting steps include checking console logs, updating Pieces OS and the plugin to the latest versions, and ensuring compatibility between Pieces OS, the plugin, and Obsidian versions. ",
      "frequency": 3,
      "related_issues": [
        {
          "id": 574,
          "title": "Obsidian Plugin",
          "text": "Obsidian Plugin\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHi! I'm attempting to get the Pieces for Devs Obsidian plugin to work. The installation of the Pieces for Devs \" Pieces for Obsidian plugin\" goes seemingly faultless as it reports in green: \" Pieces for Obsidian plugin installed successfully\". \n\n However, as soon as I attempt to enable the plugin (v1.21.1)the following error pops up ”Failed to load plugin ‘pieces-for-developers’”. \n- Obsidian v1.7.7 is up to date, and running. \n- Pieces OS v11.0.3 is running, and \n- Pieces for Devs Desktop is up and running @ v3.3.3. \n- The OS is Windows 10 Pro 64 bit Version 22H2, Build 19045.5247 updated 02-02-2025\n\nI have followed the guidelines in the following documentation (https://docs.pieces.app/extensions-plugins/obsidian). The install fails with a not-very-helpful answer. ”Failed to load plugin ‘pieces-for-developers’”\n\nReferring to the section \"https://docs.pieces.app/extensions-plugins/obsidian#having-trouble-with-the-pieces-for-developers-obsidian-plugin\" in the documentation still fails to provide the expected results, so the next step would be to attempt to find related installation logs that might shed light on the issue.\n\nI've searched for possible issues indicating this type of bug/issue but none were found here on GitHub.\nI had a look at the `obsidian.log` file in the `C:\\Users\\[user]\\AppData\\Roaming\\obsidian` folder but there's no indication at all nor any mention of any plugins or installations related to such.\n\nRepeat uninstall/reinstall advice does not resolve the problem either.\nCould you indicate which other Pieces, Obsidian and Win-OS logs would be the most appropriate to investigate which might shed light on the cause, please?\n\n**Edit:**\nI'm using other plugins without any issues.\n![Image](https://github.com/user-attachments/assets/19b3dcd2-05fa-4171-ae2e-dc71b5ce451c)\n\nThank you for looking into this.\n## GitHub Issue Conversation Summary\n\n**Key points raised:**\n\n* Andre is experiencing an issue with the Pieces for Obsidian plugin.\n* Bishoy requests that Andre share his console logs to diagnose the problem.\n* Andre clarifies which console he should access as there are multiple options in different software.\n\n**Problems identified:**\n\n* Andre is unable to understand Bishoy's instructions due to their ambiguous wording and lack of context.\n* Andre is unsure which console to use as there are several options across different applications.\n\n**Solutions proposed/implemented:**\n\n* Bishoy provides a more explicit explanation, guiding Andre to the specific console within Obsidian.\n* Bishoy shares a link to a relevant forum discussion and screenshots for further clarification.\n\n**Current status/outcome:**\n\n* Andre has not yet provided the console logs.\n* The issue remains unresolved.\n\n**Additional notes:**\n\n* The conversation highlights a communication breakdown due to unclear instructions and varying user perspectives.\n* Bishoy's revised explanation and additional resources are likely to improve Andre's understanding and facilitate resolution.",
          "activity_level": 4.1
        },
        {
          "id": 581,
          "title": "Unable to open Pieces Copilot Service",
          "text": "Unable to open Pieces Copilot Service\nError: ApiException 500: Format Metrics snapshot failed.\n\n**Installation Details**\n\nSucceeded: true\nPath: /Applications/Pieces OS.app/Contents/MacOS/Pieces OS\n\n**PiecesOS Information**\n\nID: 82313D61-B87D-497A-A189-4BEC467D8715\nUser: a90f1391-91a7-4d45-9a67-ef0d76ea0cd4\nCurrent Version: 11.0.0\nMin Version Supported: 11.0.0\nMax Version Supported: 12.0.0\nLocal Port: 39300\n\n**Device Information**\n\nOperating System: MacOS\nCurrent Version: Version 15.2 (Build 24C101)\nMin Version Supported: 12.0.0 Monterey\n## GitHub Issue Conversation Summary\n\n**Key Points:**\n\n* User Minhajms reported an issue with PiecesOS.\n* The issue has been resolved in PiecesOS release 11.0.3.\n* The user is advised to update to the latest version.\n\n**Problems Identified:**\n\n* The user was experiencing an issue with PiecesOS.\n* The specific nature of the issue is not mentioned.\n\n**Solutions Proposed/Implemented:**\n\n* Update to PiecesOS version 11.0.3 to resolve the issue.\n\n**Current Status/Outcome:**\n\n* The issue is resolved.\n* The user is encouraged to update to the latest version.\n\n## Additional Notes\n\n* The conversation is brief and does not provide much detail about the specific issue or the user's experience.\n* It is unclear if the user has updated to the latest version or if the issue remains resolved.",
          "activity_level": 2.15
        },
        {
          "id": 538,
          "title": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins",
          "text": "Announcement: 11.0.0 POS Breaking Change - TLDR: please update all plugins\n### Software\n\nDesktop Application, Pieces OS, Web Extension, JetBrains, VS Code, Visual Studio, Obsidian, JupyterLab, Sublime Plugin, Raycast Extension, Pieces CLI, Neovim\n\n### Operating System / Platform\n\nmacOS/Windows/Linux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHey 👋,\n\nWe introduce one of the largest releases in the Pieces Ecosystem.\n\nLots of bug fixes - targeting some of the largest hitches in the user journey to name a few: rate limiting(authenticate to bypass, + better error messaging), entirely new Ollama (local LLM) infrastructure w/ in the copilot, and tackling installation head-on.\n\nThe detailed list of changes is not quite ready yet; however, it will be here shortly. (I will post them here when they are)\n\nHowever, this issue is here let you know to update all your plugins and provide the status of all of the new plugins(in the case they are not yet out in production)\n\nPieces For Developers(Desktop Application): 3.3.0 - Live\nPiecesOs: 11.0.0 - Live\nvscode: 2.0.0 - Live\nJetBrains: 11.0.0 - Live\nVisual Studio: 4.0.0 - Live\nJupyter: 1.21.0 - Live\nObsidian: 1.21.0 - Live\nSublime: 1.5.0 - Live\nCLI: - 1.9.0 Live\nNeoVim: - 1.3.0 Live\nChrome(web) Extension: - 4.0.0 (This is under review)\n\nPlease, if you have any questions about the release or are having trouble updating to the latest, comment in this thread, and we can help you out!!\n## Summary of GitHub Issue Discussion:\n\n**Key Points Raised:**\n\n- Browser extension blinking excessively (Pixel-Staff-01, mark-at-pieces)\n- Browser window opening on PiecesOS startup is annoying (luckycreationsindia)\n- JetBrains plugin displays incompatible version requirements (luckycreationsindia, mark-at-pieces)\n- Browser popup promoting plugin updates is unwelcome (seantiz)\n\n**Problems Identified:**\n\n- Annoying popup behavior\n- Plugin version mismatch in JetBrains plugin\n- Unnecessary browser opening\n- Update popups for uninstalled plugins\n\n**Solutions Proposed/Implemented:**\n\n- Pop-up removal in next PiecesOS update (pieces-app/os_server#1476) \n- Troubleshooting steps for blinking browser extension (rutvik110)\n\n**Current Status/Outcome:**\n\n- Pop-up removal pending for future update\n- Blinking browser extension reproduction inconclusive\n- JetBrains plugin version issue requires further clarification\n- Unprompted update popups for uninstalled plugins need investigation\n\n**Additional Notes:**\n\n- This issue is ongoing, with various individuals reporting problems.\n- The developers are actively working on solutions, but some issues remain unresolved.",
          "activity_level": 4.79
        }
      ]
    },
    {
      "title": "Pieces for Developers Bugs and Issues",
      "description": "Users are experiencing various bugs in Pieces for Developers including a welcome message appearing after every saved snippet, Copilot not generating code, and issues generating shareable links. Solutions vary from bug fixes in upcoming releases to temporary workarounds. Users are encouraged to check for updates and report any issues.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 582,
          "title": "Saved Snippets Welcome Screen",
          "text": "Saved Snippets Welcome Screen\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen I save a snippet I get a Welcome Message with the first saved snippet every time:\n![Image](https://github.com/user-attachments/assets/7f8c393f-0097-4f17-997a-75d20c526ce3)\n\nPfD Version: 3.3.3\n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* A bug was identified in the GitHub Desktop App (version not specified).\n* The bug was successfully reproduced by @mack-at-pieces.\n* A fix for the bug will be included in the next Desktop App release.\n\n**Problems Identified:**\n\n* The specific problem causing the bug is not mentioned in the conversation.\n\n**Solutions Proposed/Implemented:**\n\n* A fix for the bug will be implemented and included in the next release of the Desktop App.\n\n**Current Status/Outcome:**\n\n* The bug fix is currently in development and will be released with the next Desktop App update. \n* The exact date of the release is not specified.",
          "activity_level": 2.8
        },
        {
          "id": 584,
          "title": "Copilot is not giving any feedback",
          "text": "Copilot is not giving any feedback\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPieces for Developers 3.3.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe copilot is not generating anything, it just keeps on loading.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @gittydia reported an issue with Pieces Copilot.\n* The issue is related to an error message \"I'm sorry. Something went wrong with processing. Please...\"\n\n**Problems Identified:**\n\n* The user is unable to use Pieces Copilot due to the error message.\n* The issue may be related to other reported Copilot bugs.\n\n**Solutions Proposed/Implemented:**\n\n* The Pieces Support Bot automatically triaged the issue and routed it to the appropriate team member.\n* The bot suggested the user review related issues and resources.\n\n**Current Status/Outcome:**\n\n* The user is waiting for a follow-up from the Pieces team within 24 hours.\n* The outcome of the issue is currently unknown.\n\n**Additional Notes:**\n\n* The conversation took place on January 10, 2025.\n* The user's GitHub handle is @gittydia.",
          "activity_level": 4.42
        },
        {
          "id": 443,
          "title": "Unable to generate personal shareable links for 6+ months",
          "text": "Unable to generate personal shareable links for 6+ months\n### Software\n\nDesktop Application, Web Extension, VS Code, Sharing Web App\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.12\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI've been unable to generate shareable personal links and utilize the web sharing app since before June '24. I've created an issue about this twice before, and the last time was just completely disregarded and it was closed out.\r\n\r\nHere is the screenshot from within my Pieces Desktop when trying to generate a personal link, as well as generate a GitHub Gist:\r\n\r\n![image](https://github.com/user-attachments/assets/0966a1a9-3076-4d9b-9006-88a14673cc9f)\n## Summary of GitHub Issue Conversation\n\n### Key Points\n\n* **Original issue:** Shareable links were failing for some users.\n* **Reported on:** 2024-11-07\n* **Affected users:** tombinga and potentially others experiencing the same problem.\n* **Cause of the issue:** Stale infrastructure powering Shareable links.\n\n### Solutions\n\n* **Temporary solution:** Book an appointment with mark-at-pieces to clean up individual users' cloud.\n* **Future solution:** Major upgrades for Shareable links and other cloud features expected in December 2024.\n\n### Implementation\n\n* Fix implemented in version 10.1.13 and expected to be released between 2024-11-19 and 2024-11-21.\n\n### Outcome\n\n* Original problem with stale infrastructure seemingly fixed with 10.1.13 update.\n* New problem with GitHub gist generation reported by tombinga on 2025-01-06. This needs further troubleshooting and a new separate GitHub issue will be filed.\n* Original issue closed on 2025-01-06 as it appears to be fixed.\n\n## Current Status\n\n* Shareable links should work correctly with updated infrastructure, but any remaining problems can be addressed through the December update or by scheduling with mark-at-pieces.\n* New issue with GitHub gist generation needs a separate investigation with additional details provided by the reporter (tomibinga).",
          "activity_level": 3.71
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize LTM Issues:** Allocate resources to address the ongoing issues with the Long-Term Memory (LTM) feature, particularly on Linux. This includes investigating and resolving problems with feature unavailability, activation failures, and inconsistent context access.",
    "**Improve Remote Environment Connectivity:** Investigate and address the persistent connectivity issues users face when using Pieces OS in remote environments like Docker containers, even after implementing the patch in VS Code extension v2.0.1.",
    "**Resolve Obsidian Plugin Installation Issues:** Investigate and fix the problem preventing the Pieces for Developers Obsidian plugin from loading for some users, despite successful installation messages. Ensure clear documentation and troubleshooting steps are available.",
    "**Address Pieces for Developers Bugs:** Dedicate resources to resolve reported bugs in Pieces for Developers, such as the welcome message appearing repeatedly, Copilot loading issues, and problems with shareable links. Communicate known issues and workarounds clearly.",
    "**Review Support Documentation:** Review and update support documentation, particularly regarding connecting to Pieces OS from remote environments and troubleshooting plugin installations. Ensure consistency and clarity in instructions.",
    "**Enhance Communication Clarity:** Encourage support staff to provide clear and concise instructions to users, avoiding technical jargon and ambiguity. Utilize visual aids like screenshots and videos when helpful.",
    "**Gather User Feedback:** Implement a system for gathering user feedback on support interactions. This can help identify areas for improvement in communication, issue resolution, and documentation."
  ],
  "message": "Daily support report generated successfully."
}