{
  "success": true,
  "date_range": {
    "start": "2025-04-07T00:00:00+00:00",
    "end": "2025-04-13T05:11:40.053553+00:00"
  },
  "summary": {
    "total_tickets": 3,
    "resolved_tickets": 0,
    "open_tickets": 3
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "os:windows",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "status:new",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 3,
      "resolved": 0,
      "pending": 3
    },
    {
      "category": "app:pieces os",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "status:triaged",
      "received": 2,
      "resolved": 0,
      "pending": 2
    }
  ],
  "most_active_tickets": [
    {
      "number": 685,
      "title": "Stuck at https://authentication.pieces.services/",
      "activity_level": 5.68
    },
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 3.73
    },
    {
      "number": 672,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 3.5
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS Installation and Login Issues",
      "description": "Users are experiencing issues with Pieces OS installation, updates, and login processes. Antivirus software flagging the app as a false positive, infinite loading on the login page, and problems with Google account linking are among the reported issues. Proposed solutions include whitelisting the app in antivirus settings, downloading from the Microsoft Store, and waiting for a fix from the Pieces team.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 685,
          "title": "Stuck at https://authentication.pieces.services/",
          "text": "Stuck at https://authentication.pieces.services/\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.3.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nAfter updating pieces to latest version, I was loggged out (This was part of the update, which I saw in the update / release notes.). But when I try to log in, always end up at https://authentication.pieces.services/ without moving forward. that page keep loading and nothing happens.\n## Summary of GitHub Issue Conversation\n\n**Issue:** User @AlexanderSLoburev reports being unable to log in after updating to Pieces OS version 11.3.0 on Windows 11. The user is unable to link their Google account and experiences infinite loading on the https://authentication.pieces.services/ login page. \n\n**Key Points:**\n\n* Issue appeared after updating to Pieces OS version 11.3.0\n* User cannot link their Google account\n* Login page https://authentication.pieces.services/ is stuck in an infinite loading loop\n\n**Problems Identified:**\n\n* Potential bug in Pieces OS 11.3.0 related to Google account linking\n* Login process is not functioning properly on https://authentication.pieces.services/\n\n**Solutions Proposed/Implemented:**\n\n* No specific solutions proposed or implemented yet.\n\n**Current Status/Outcome:**\n\n* Issue acknowledged by Pieces support bot.\n* Team member assigned to investigate the issue within 24 hours.\n* User advised to check related issues and resources in the meantime.\n\n**Next Steps:**\n\n* Wait for the assigned team member to investigate and provide further assistance.\n* Monitor the issue thread for updates and potential solutions.",
          "activity_level": 5.68
        },
        {
          "id": 672,
          "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
          "text": "Invalid Port (at character 18) http://127.0.0.1:null/connect\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nLatest from 17032025 (can't find it)\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHi I am stuck at the initial stages. Where the desktop app is being initialized. I am at verify dependency connections and it says unable to open pieces core services. \"FormatException: Invalid Port (at character 18) http://127.0.0.1:null/connect.\n\nIt might be an antivirus stopping it. I am not sure. But I have restarted and reinstalled to no effect.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* SherlockSol is experiencing issues with Pieces Desktop not launching on their Windows PC.\n* The issue has not been able to be reproduced or fully identified.\n\n**Problems Identified:**\n\n* Pieces Desktop is not launching.\n* The cause of the issue is unknown.\n\n**Solutions Proposed/Implemented:**\n\n* **Request for additional information:**\n    * nathan-courtney-pieces requested log files and hardware information from SherlockSol.\n* **Troubleshooting call:**\n    * mack-at-pieces requested a video call with SherlockSol for live troubleshooting.\n\n**Current Status/Outcome:**\n\n* SherlockSol has provided log files and hardware information.\n* A video call with SherlockSol has been scheduled to further troubleshoot the issue.\n* uzaxirr reported experiencing the same issue and has scheduled a video call with the Pieces team.\n\n**Additional Notes:**\n\n* Related issues have been suggested in the conversation for reference.\n\n**Overall:**\n\n* The issue is still ongoing and being actively investigated by the Pieces team. \n* A further troubleshooting call with SherlockSol has been scheduled to gather more information and hopefully identify the cause of the problem.",
          "activity_level": 3.5
        },
        {
          "id": 663,
          "title": "Kaspersky Internet Security flags Pieces OS as a virus",
          "text": "Kaspersky Internet Security flags Pieces OS as a virus\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS_11.2.2.0_x64\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![Image](https://github.com/user-attachments/assets/160ed12d-f0a1-46be-bf36-05502353405e)\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* User @crimso is experiencing issues with their antivirus software (Nod32 and Malwarebytes) blocking Pieces OS updates and installations.\n* User @merlauz is also facing similar issues with ESET Antivirus.\n* @crimso confirmed the issue persists even when installing from the Microsoft Store.\n\n**Problems Identified:**\n\n* Certain antivirus software incorrectly flags Pieces OS as a false positive.\n* The issue prevents users from updating and using the latest version of the app.\n* The problem seems to be related to the app writing files to the User/Documents directory.\n\n**Solutions Proposed/Implemented:**\n\n* Manually add the Pieces OS executable to the antivirus allowlist.\n* Download and install from the Microsoft Store, where Microsoft validates the software.\n\n**Current Status/Outcome:**\n\n* The issue remains unresolved.\n* Users are advised to add the executable to their allowlist or download from the Microsoft Store.\n* The Pieces team is actively working on preventing their software from being flagged as malicious by antivirus software.\n* Future updates may allow users to choose where the User/Documents directory is stored.\n\n**Additional Notes:**\n\n* The issue discussion spanned from March 12th, 2025 to April 10th, 2025.\n* The Pieces support bot initially responded with related resources, aiming to help the user.\n* Technical support representative Nathan-Courtney-Pieces offered solutions and explanations throughout the conversation.\n* The user, @crimso, seeks a definitive resolution to the problem and awaits further updates.",
          "activity_level": 3.73
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize resolution of Pieces OS installation and login issues:** This appears to be the most common problem, impacting multiple users. Focus on addressing antivirus false positives, login page loading errors, and Google account linking problems.",
    "**Improve communication around known issues:** Provide clear and concise instructions on how to whitelist Pieces OS in antivirus software. Consider creating a dedicated FAQ or knowledge base article addressing installation and login troubleshooting.",
    "**Investigate and resolve the \"Invalid Port\" error:** This issue, while less frequent, seems to be blocking users from even launching the application. Gather more information from affected users and prioritize finding a solution.",
    "**Monitor antivirus software compatibility:**  Given the recurring issue with antivirus software, establish a process for proactively monitoring and addressing compatibility issues with popular antivirus programs.",
    "**Gather more detailed user data:** Encourage users to provide system information, logs, and steps to reproduce the issue. This will help in diagnosing and resolving problems more efficiently.",
    "**Consider alternative distribution channels:** Given the challenges with antivirus software, explore alternative distribution channels like the Microsoft Store, which might offer a more streamlined installation experience."
  ],
  "message": "Daily support report generated successfully."
}