{
  "success": true,
  "date_range": {
    "start": "2025-04-07T00:00:00+00:00",
    "end": "2025-04-11T13:13:00.215818+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:windows",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces os",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 4.2
    }
  ],
  "common_issues": [
    {
      "title": "Antivirus software falsely flags Pieces OS updates",
      "description": "Multiple antivirus programs (Kaspersky, Nod32, Malwarebytes, ESET) are incorrectly identifying Pieces OS updates as malicious, preventing users from updating. This primarily affects updates downloaded from the Pieces website.  Workarounds include whitelisting Pieces OS in the antivirus software or downloading the app from the Microsoft Store.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 663,
          "title": "Kaspersky Internet Security flags Pieces OS as a virus",
          "text": "Kaspersky Internet Security flags Pieces OS as a virus\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS_11.2.2.0_x64\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![Image](https://github.com/user-attachments/assets/160ed12d-f0a1-46be-bf36-05502353405e)\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* Users are experiencing issues with antivirus software (Kaspersky, Nod32, Malwerbytes, ESET) blocking or deleting Pieces OS updates.\n* The issue seems to be specific to updates downloaded from the Pieces website, not the Microsoft Store.\n\n**Problems Identified:**\n\n* Antivirus software mistakenly flags Pieces OS as malicious.\n* This prevents users from updating to the latest version and using the app.\n\n**Solutions Proposed/Implemented:**\n\n* Add Pieces OS to the antivirus whitelist.\n* Download and install Pieces OS from the Microsoft Store, where it has been validated as safe.\n\n**Current Status/Outcome:**\n\n* The issue is ongoing and Pieces is working on a solution to prevent their software from being flagged as malicious by antivirus software.\n* Users can currently avoid the issue by using the Microsoft Store version or by whitelisting Pieces OS in their antivirus software.",
          "activity_level": 4.2
        }
      ]
    }
  ],
  "recommendations": [
    "Investigate and resolve the root cause of antivirus software falsely flagging Pieces OS updates.",
    "Update support documentation and FAQs to include a section on how to whitelist Pieces OS in common antivirus programs.",
    "Consider proactively reaching out to antivirus vendors like Kaspersky, Nod32, Malwarebytes, and ESET to address the false positive detections.",
    "Monitor the effectiveness of downloading Pieces OS from the Microsoft Store and promote this method if it consistently avoids antivirus issues."
  ],
  "message": "Daily support report generated successfully."
}