{
  "success": true,
  "date_range": {
    "start": "2025-03-20T00:00:00+00:00",
    "end": "2025-03-20T13:11:26.395455+00:00"
  },
  "summary": {
    "total_tickets": 3,
    "resolved_tickets": 0,
    "open_tickets": 3
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "os:windows",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "app:desktop application",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "status:triaged",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "app:pieces os",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 650,
      "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
      "activity_level": 12.11
    },
    {
      "number": 672,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 4.74
    },
    {
      "number": 315,
      "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
      "activity_level": 4.65
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS and Desktop App Performance Issues",
      "description": "Users report slow performance, high CPU usage, and lagging, particularly with Long Term Memory (LTM) enabled.  Issues persist across different Pieces OS and Desktop App versions.  Solutions include upgrading to the latest versions, disabling LTM for specific apps, and adjusting Processing Mode.  The Pieces team is actively investigating and releasing patches to address these issues.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 672,
          "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
          "text": "Invalid Port (at character 18) http://127.0.0.1:null/connect\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nLatest from 17032025 (can't find it)\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHi I am stuck at the initial stages. Where the desktop app is being initialized. I am at verify dependency connections and it says unable to open pieces core services. \"FormatException: Invalid Port (at character 18) http://127.0.0.1:null/connect.\n\nIt might be an antivirus stopping it. I am not sure. But I have restarted and reinstalled to no effect.\n## GitHub Issue Summary\n\n**Issue Title:** (Not provided)\n\n**Key Points Raised:**\n\n* SherlockSol is experiencing an issue with Pieces.\n* The issue has been automatically triaged and routed to the proper team member.\n* SherlockSol might find related issues helpful.\n* Some helpful resources are provided.\n\n**Problems Identified:**\n\n* SherlockSol is unable to use Pieces.\n* The specific problem is not stated.\n\n**Solutions Proposed/Implemented:**\n\n* Nathan-courtney-pieces requests SherlockSol to provide logs.\n* SherlockSol provides logs and their Windows Build Number.\n\n**Current Status/Outcome:**\n\n* Nathan-courtney-pieces will likely analyze the logs and provide further assistance.\n\n**Additional Notes:**\n\n* The logs are not attached to the summary.\n* The specific issue remains unclear.\n* The conversation is ongoing.",
          "activity_level": 4.74
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## GitHub Issue Conversation Summary\n\n**Key Points Raised:**\n\n* Copilot was significantly slower than before.\n* Hard-Reset Active Runtime was not working properly.\n* Copilot infinitely hung on \"...\" loading indicator.\n* High CPU usage and blocked responses.\n* Context files not being read even when specified.\n\n**Problems Identified:**\n\n* Bug in the Copilot hard reset functionality.\n* Performance issues in the latest updates.\n\n**Solutions Proposed/Implemented:**\n\n* Fix the hard reset bug (released in a patch).\n* Released Pieces OS 10.0.2 & Pieces Desktop 3.0.2 with performance improvements.\n* Released Desktop app version 3.1.0 with further performance improvements.\n\n**Current Status/Outcome:**\n\n* Copilot performance has improved for some users, but some are still experiencing slowness.\n* Pieces team is requesting system details from users who are still having problems.\n\n**Additional Notes:**\n\n* The conversation took place between July 2024 and March 2025.\n* Some users reported that the problem was resolved after updating to the latest versions, while others continued to experience issues.\n* The Pieces team is actively investigating the problem and working on further improvements.",
          "activity_level": 4.65
        },
        {
          "id": 650,
          "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
          "text": "Long Term Memory still slows down my PC, even after updating to LTM-2\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nTurning on Long Term Memory has been slowing down my desktop computer, even before LTM-2. After updating today, it still happens. It's most noticeable when I use Slack and Discord, and disabling those apps on LTM doesn't work. Even after switching the Processing Mode to Cloud, as suggested by HRA42 on the Discord server, the lag still occurs. At some point, the total CPU usage went up by over 90%.\n\n![Image](https://github.com/user-attachments/assets/eaef0d65-b19b-41f0-bf8a-f143fa8d1e43)\n\nMy computer specs:\n- CPU: Intel(R) Core(TM) i3-6300 CPU @ 3.80GHz\n- RAM: DDR4 32 GB\n- Graphics: GeForce GTX 950 2 GB\n\nI'm yet to notice significant slowness on other programs, but if I'm getting a lot of lag on those chat apps, I can imagine I would get them too on something heavier like Visual Studio.\n## Summary of GitHub Conversation\n\n**Key Points Raised:**\n\n* High CPU usage in PiecesOS 11.2.2, particularly with Microsoft Edge and LTM2 enabled.\n\n**Problems Identified:**\n\n* LTM2 contributing to high CPU usage.\n* Microsoft Edge experiencing performance issues with LTM2 enabled.\n\n**Solutions Proposed/Implemented:**\n\n* Hotfix released to improve performance.\n* Patches released to address CPU issues.\n\n**Current Status:**\n\n* CPU usage seems to have improved for some users, particularly those who use SSDs with NTFS filesystem.\n* Microsoft Edge performance issue still unresolved for some users.\n\n**Additional Information:**\n\n* Enabling and disabling LTM2 appears to temporarily reduce CPU usage for some.\n* Moving folders to ReFS filesystem and creating symbolic links seems to have a positive impact.\n\n**Action Items for Pieces Team:**\n\n* Further investigate the root cause of the CPU usage issue and implement additional fixes.\n* Investigate and address the performance issue with Microsoft Edge and LTM2.\n* Continue monitoring user reports and provide updates and solutions as available.\n\n**Overall, the conversation highlights ongoing efforts by the Pieces team to address high CPU usage and improve overall performance. However, some users still experience issues, and further improvement is required.**",
          "activity_level": 12.11
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize performance improvements:** The most common issue revolves around slow performance, high CPU usage, and lagging, especially with Long Term Memory (LTM). Focus development efforts on optimizing LTM and overall application performance.",
    "**Investigate Pieces OS and Desktop App compatibility:** Users experience issues across different versions, suggesting potential compatibility problems.  Increase testing for various combinations to ensure seamless integration.",
    "**Improve error messaging and troubleshooting:** The \"Invalid Port\" error message lacks clarity. Provide more informative error messages and improve documentation to help users troubleshoot common problems.",
    "**Gather more system information:** Request detailed system specs from users experiencing performance issues to identify potential hardware or software conflicts.",
    "**Consider a dedicated support channel for performance issues:** Given the frequency, create a dedicated channel or FAQ section to address performance-related questions and solutions efficiently.",
    "**Enhance communication about ongoing efforts:**  Acknowledge the user experience with transparency regarding ongoing investigations and patch releases to manage expectations and build trust."
  ],
  "message": "Daily support report generated successfully."
}