{
  "success": true,
  "date_range": {
    "start": "2025-04-10T00:00:00+00:00",
    "end": "2025-04-10T21:06:39.514678+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:windows",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces os",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 4.2
    }
  ],
  "common_issues": [
    {
      "title": "Antivirus Software Falsely Flags Pieces OS",
      "description": "Multiple users report antivirus software (Kaspersky, Nod32, ESET) incorrectly identifying Pieces OS as a virus. This false positive prevents installation or triggers removal.  Workarounds include downloading from Microsoft Store (where available) or whitelisting the executable in antivirus settings. Pieces is investigating long-term solutions to prevent these false detections.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 663,
          "title": "Kaspersky Internet Security flags Pieces OS as a virus",
          "text": "Kaspersky Internet Security flags Pieces OS as a virus\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS_11.2.2.0_x64\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![Image](https://github.com/user-attachments/assets/160ed12d-f0a1-46be-bf36-05502353405e)\n## Summary of GitHub Issue Conversation: Antivirus Issues with PiecesOS\n\n**Key Points Raised:**\n\n* Users are experiencing issues with antivirus software (Kaspersky, Nod32, ESET) blocking or deleting PiecesOS upon download or update.\n* This appears to be a false positive detection by the antivirus programs.\n* Users are concerned about the security risk of allowing PiecesOS to run despite the warnings.\n\n**Problems Identified:**\n\n* False positive detection by antivirus software.\n* Lack of whitelist options for PiecesOS in some antivirus programs.\n* User concerns about security risks.\n\n**Solutions Proposed/Implemented:**\n\n* Download PiecesOS and Pieces for Developers from the Microsoft Store, where Microsoft validates the software.\n* Add the PiecesOS executable to the allow list in the antivirus software.\n* In the future, allow users to select where their user-generated data is stored to avoid conflict with antivirus software.\n\n**Current Status/Outcome:**\n\n* The issue is ongoing.\n* Pieces is working on ways to prevent false positive detections by antivirus software.\n* Users are advised to either download from the Microsoft Store or add the executable to their allow list in the meantime.\n\n**Additional Notes:**\n\n* The issue was first reported on March 12, 2025.\n* The latest update from Pieces was on April 10, 2025.\n* The issue is affecting users with Kaspersky, Nod32, and ESET antivirus software.",
          "activity_level": 4.2
        }
      ]
    }
  ],
  "recommendations": [
    "Investigate and address the false positive detection of Pieces OS by antivirus software (Kaspersky, Nod32, ESET).",
    "Explore options for users to whitelist Pieces OS within their antivirus software or provide clear instructions on how to do so.",
    "Consider implementing a feature allowing users to choose the storage location for user-generated data to potentially avoid antivirus conflicts.",
    "Monitor the effectiveness of downloading Pieces OS from the Microsoft Store in mitigating the antivirus issue.",
    "Continue to communicate updates and workarounds to users experiencing the antivirus problem, emphasizing the safety of Pieces OS."
  ],
  "message": "Daily support report generated successfully."
}