{
  "success": true,
  "date_range": {
    "start": "2025-03-22T00:00:00+00:00",
    "end": "2025-03-22T21:05:57.263195+00:00"
  },
  "summary": {
    "total_tickets": 2,
    "resolved_tickets": 0,
    "open_tickets": 2
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "os:windows",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces os",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 650,
      "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
      "activity_level": 12.86
    },
    {
      "number": 459,
      "title": "Bug: unable to cancel the download of an LLLM",
      "activity_level": 1.79
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS Performance and Download Issues",
      "description": "Users report slow performance, especially with Long Term Memory (LTM) enabled, particularly on Windows. High CPU usage is observed, impacting apps like Slack, Discord, and browsers.  Updating Pieces OS and web browsers sometimes helps. Separately, downloading large language models, like Mistral, can get stuck, requiring a full data deletion and reinstall as a temporary fix.",
      "frequency": 2,
      "related_issues": [
        {
          "id": 650,
          "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
          "text": "Long Term Memory still slows down my PC, even after updating to LTM-2\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nTurning on Long Term Memory has been slowing down my desktop computer, even before LTM-2. After updating today, it still happens. It's most noticeable when I use Slack and Discord, and disabling those apps on LTM doesn't work. Even after switching the Processing Mode to Cloud, as suggested by HRA42 on the Discord server, the lag still occurs. At some point, the total CPU usage went up by over 90%.\n\n![Image](https://github.com/user-attachments/assets/eaef0d65-b19b-41f0-bf8a-f143fa8d1e43)\n\nMy computer specs:\n- CPU: Intel(R) Core(TM) i3-6300 CPU @ 3.80GHz\n- RAM: DDR4 32 GB\n- Graphics: GeForce GTX 950 2 GB\n\nI'm yet to notice significant slowness on other programs, but if I'm getting a lot of lag on those chat apps, I can imagine I would get them too on something heavier like Visual Studio.\n## Conversation Summary - High CPU Usage in Pieces OS\n\n**Key points raised:**\n\n* High CPU usage while using Pieces OS, especially after enabling LTM-2.\n* Discord, Microsoft Edge, and VSCode were particularly affected.\n* Issues reported on Windows 10 and 11 with various hardware configurations.\n\n**Problems identified:**\n\n* Resource-intensive processing with LTM-2 enabled led to high CPU utilization.\n* Microsoft Edge seemed to be the main culprit, especially with numerous open tabs.\n* Potential conflict between VSCode plugin and LTM-2 causing temporary spikes.\n\n**Solutions proposed/implemented:**\n\n* Hotfix released initially, but marginal improvement reported.\n* Microsoft Edge and WebView2 updates resolved the issue for some users.\n* Further investigation revealed issue with plugin snapshots contributing to spiking CPU usage.\n* Potential solution using Symbolic Links with ReFS filesystem suggested by a user.\n* Pieces OS v11.2.3 update implemented by Pieces team with successful results.\n\n**Current status/outcome:**\n\n* High CPU issue appears to be resolved for most users with v11.2.3 update.\n* LTM-2 can now be used without noticeable performance degradation.\n* Further investigation and optimization might be needed for specific configurations.\n\n**Additional notes:**\n\n* User KnifMelti provided insightful troubleshooting and reported successful resolution with the update.\n* Acknowledgment and appreciation towards Pieces team for addressing the issue.",
          "activity_level": 12.86
        },
        {
          "id": 459,
          "title": "Bug: unable to cancel the download of an LLLM",
          "text": "Bug: unable to cancel the download of an LLLM\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nlatest\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![image](https://github.com/user-attachments/assets/6e730898-a168-4571-ab0d-6331c4d389a4)\r\n\r\ni want stop but its not working \r\n\n## GitHub Issue Summary: Mistral Model Download Issues\n\n**Key Points:**\n\n* **Problem:** Users are experiencing issues downloading Mistral models, particularly the 8 7b model. \n* **Symptoms:**\n    * Stop download button doesn't work.\n    * Download gets stuck on \"Initialization\" after multiple stop attempts.\n    * Download cannot be stopped at all.\n* **Users Impacted:** Windows and macOS users.\n\n**Solutions Proposed/Implemented:**\n\n* **Temporary fix:** Delete all files from `C:/Users/[YOUR-USERNAME]/Documents/com.pieces.os/` and reinstall Pieces OS and desktop app.\n* **Other attempted fixes (unsuccessful):**\n    * Reinstalling Pieces OS and desktop app without deleting data.\n    * Reinstalling Ollama\n    * Disconnecting from internet\n    * Restarting machine\n\n**Current Status/Outcome:**\n\n* The issue persists for some users.\n* Pieces team is aware of the problem and is working on a solution.\n* Local Large Language Model stack is being replaced, with an expected deployment within 2-3 weeks (as of November 2023).\n* No further updates are available as of November 2023.\n\n**Additional Information:**\n\n* AkhilTrivediX provided screenshots of the issue.\n* jaybuidl confirmed the issue on macOS silicon.\n* mark-at-pieces offered assistance and provided a link to their calendar for real-time communication.",
          "activity_level": 1.79
        }
      ]
    }
  ],
  "recommendations": [
    "**Investigate and address the performance issues with Long Term Memory (LTM) on Windows.** This appears to be a recurring problem impacting user experience, particularly with apps like Slack and Discord.  Prioritize finding a permanent solution beyond temporary workarounds.",
    "**Improve the download and cancellation process for large language models.** Users are experiencing difficulties downloading and canceling downloads, particularly with the Mistral model. Ensure clear communication of download status, progress, and options for cancellation. ",
    "**Provide more detailed documentation and troubleshooting steps for common issues.** This will empower users to resolve problems independently and reduce the support ticket volume.",
    "**Consider creating a dedicated forum or knowledge base section for Pieces OS on Windows.** This will allow users to share their experiences, find solutions, and seek help from the community.",
    "**Monitor the impact of the upcoming Local Large Language Model stack replacement.** Ensure a smooth transition and address any new issues that may arise from the update. "
  ],
  "message": "Daily support report generated successfully."
}