{
  "success": true,
  "date_range": {
    "start": "2025-06-28T00:00:00+00:00",
    "end": "2025-06-28T05:07:32.930168+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:windows",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:new",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 771,
      "title": "Chash when scrolling or moving a window to another screen",
      "activity_level": 4.42
    }
  ],
  "common_issues": [
    {
      "title": "App crashes when scrolling or moving window",
      "description": "Pieces desktop app on Windows crashes when moving the window to another screen or scrolling in chat list/chat window.  Issue occurs in PiecesOS 12.0.0 and Pieces for Developers 4.2.1.  No further information on reproducing the error was provided by the user.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 771,
          "title": "Chash when scrolling or moving a window to another screen",
          "text": "Chash when scrolling or moving a window to another screen\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS 12.0.0, Pieces for Developers 4.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI don't know how to provide more info.\nEvery time I move the app on my left screen, it crashes. Oftentimes when I scroll the chats list or the chat itself, it crashes, too.\nError generating summary: 404 Publisher Model `projects/pi3c3s-cloud-server/locations/us-east1/publishers/google/models/gemini-pro` was not found or your project does not have access to it. Please ensure you are using a valid model version. For more information, see: https://cloud.google.com/vertex-ai/generative-ai/docs/learn/model-versions",
          "activity_level": 4.42
        }
      ]
    }
  ],
  "recommendations": [
    "Investigate the crash issue related to scrolling or moving the Pieces desktop app window on Windows. This appears to be the most frequent and active issue.",
    "Gather more information from users experiencing the crash to determine steps to reproduce the issue and identify potential solutions.",
    "Prioritize resolving the crash issue as it impacts Windows users with PiecesOS 12.0.0 and Pieces for Developers 4.2.1.",
    "Consider adding debugging or logging mechanisms to the application to capture more detailed information about the crash.",
    "Check for compatibility issues between the Pieces desktop application, PiecesOS 12.0.0, and Pieces for Developers 4.2.1 on Windows."
  ],
  "message": "Daily support report generated successfully."
}