{
  "success": true,
  "date_range": {
    "start": "2025-01-13T00:00:00+00:00",
    "end": "2025-01-16T21:06:20.639076+00:00"
  },
  "summary": {
    "total_tickets": 12,
    "resolved_tickets": 4,
    "open_tickets": 8
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 8,
      "resolved": 2,
      "pending": 6
    },
    {
      "category": "os:windows",
      "received": 4,
      "resolved": 1,
      "pending": 3
    },
    {
      "category": "app:desktop application",
      "received": 6,
      "resolved": 1,
      "pending": 5
    },
    {
      "category": "status:triaged",
      "received": 5,
      "resolved": 1,
      "pending": 4
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 3,
      "resolved": 2,
      "pending": 1
    },
    {
      "category": "app:pieces os",
      "received": 4,
      "resolved": 2,
      "pending": 2
    },
    {
      "category": "stale",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "eap",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:jetbrains",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:vs code",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "P1",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:cli",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "queued for release",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:in_progress",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces copilot module",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "resolved",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "os:macos",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "ongoing",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:new",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:web extension",
      "received": 1,
      "resolved": 1,
      "pending": 0
    }
  ],
  "most_active_tickets": [
    {
      "number": 550,
      "title": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)",
      "activity_level": 7.78
    },
    {
      "number": 586,
      "title": "Pieces plugin for UltraEdit is unresponsive after asking copilot to describe ~3000 line .py script",
      "activity_level": 5.8
    },
    {
      "number": 588,
      "title": "Neural Code Search returns no results",
      "activity_level": 4.5
    },
    {
      "number": 150,
      "title": "PiecesOS using too much RAM/spike in CPU",
      "activity_level": 4.23
    },
    {
      "number": 561,
      "title": "Copilot Bug: 'I'm sorry. Something went wrong with processing. Please...' copilot response",
      "activity_level": 3.98
    },
    {
      "number": 585,
      "title": "Failed to load resource: net::ERR_CONNECTION_REFUSED     http://127.0.0.1:1000/.well-known/health",
      "activity_level": 2.71
    },
    {
      "number": 584,
      "title": "Copilot is not giving any feedback",
      "activity_level": 2.68
    },
    {
      "number": 582,
      "title": "Saved Snippets Welcome Screen",
      "activity_level": 2.46
    },
    {
      "number": 456,
      "title": "Not Working",
      "activity_level": 2.4
    },
    {
      "number": 131,
      "title": "Unable to Launch Pieces Windows Desktop Version",
      "activity_level": 2.3
    },
    {
      "number": 421,
      "title": "Pieces OS does not connect to Jetbrains plugin",
      "activity_level": 2.26
    },
    {
      "number": 489,
      "title": "VSCode extension issue rendering Copilot when installed via snap in WSL2",
      "activity_level": 1.89
    }
  ],
  "common_issues": [
    {
      "title": "Pieces Copilot Unresponsive or Returning Errors",
      "description": "Users are reporting Pieces Copilot being unresponsive or returning errors like \"I'm sorry. Something went wrong with the processing...\". This issue appears across different Pieces versions and operating systems. Suggested solutions include updating to the latest Pieces version (11.0.4), checking for invalid OpenAI API keys, and switching to a different model like GPT4o.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 586,
          "title": "Pieces plugin for UltraEdit is unresponsive after asking copilot to describe ~3000 line .py script",
          "text": "Pieces plugin for UltraEdit is unresponsive after asking copilot to describe ~3000 line .py script\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nIn UltraEdit I opened the python script available at https://github.com/eldraco/domain_analyzer/blob/master/domain_analyzer.py. I opened the Pieces plugin and using default settings prompted it to describe the script: \"What does this Python script do?\" The UE plugin never returns any content and seems to be unresponsive. \n\nIn Pieces Desktop, I do see the result, however interaction with it is latent indicating some sort of continual background processing even though the LLM has completed processing. Additionally, there seem to be significant scroll issues, and the code view doesn't appear to be calculating line numbers correctly, showing many empty lines after line 1,918, when line 2,837 is the last line in the file.\n\nFinally, the Pieces Desktop code view shows a wrap in the line number margin.\n\n![Image](https://github.com/user-attachments/assets/9be69032-f2e2-4379-843c-cd0bf14da63a)\n## Summary of GitHub Issue Conversation\n\n**Key points:**\n\n* User @bschwenk reported two issues with a specific file: 1) context issues and 2) line number wrapping.\n* Support bot responded with helpful resources and suggested related issues.\n* @mark-at-pieces confirmed the context issue and reported being able to reproduce the line wrapping issue. \n* @sam-at-pieces identified a fix for the context issue and provided a link to the asset.\n* @mark-at-pieces confirmed the context issue resolution and release date.\n* @bschwenk expressed gratitude.\n\n**Problems identified:**\n\n* Context issue: The file provided by the user was not included in the context.\n* Line number wrapping issue.\n\n**Solutions proposed/implemented:**\n\n* Fix for the context issue was identified and implemented for the upcoming release.\n* Line number wrapping issue is still being investigated.\n\n**Current status/outcome:**\n\n* Context issue has been resolved and will be released in Pieces version 11.0.4.\n* Line number wrapping issue is being investigated.\n\n**Overall, the support team was responsive and worked collaboratively to identify and address the reported issues.**",
          "activity_level": 5.8
        },
        {
          "id": 584,
          "title": "Copilot is not giving any feedback",
          "text": "Copilot is not giving any feedback\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPieces for Developers 3.3.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe copilot is not generating anything, it just keeps on loading.\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* User gittydia created an issue for a bug in the Pieces Copilot service.\n* The issue involved receiving the error message \"I'm sorry. Something went wrong with the processing...\" when using Copilot.\n* User provided details about the issue, including the platform and steps to reproduce it.\n\n**Problems Identified:**\n\n* The bug prevented users from accessing Copilot responses.\n* The cause of the bug was not identified in the conversation.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support confirmed a fix for the issue in the upcoming PiecesOS release (version 11.0.4).\n* User is requested to report back if the issue persists after installing the update.\n\n**Current Status/Outcome:**\n\n* The issue is expected to be resolved after the release of PiecesOS version 11.0.4.\n* The user will confirm the outcome after updating their system.\n\n**Additional Information:**\n\n* The conversation provides links to related issues and helpful resources.\n\n**Conciseness:**\n\nThis summary provides the essential details of the conversation in a concise format, focusing on the key points, problems, solutions, and outcome.",
          "activity_level": 2.68
        },
        {
          "id": 561,
          "title": "Copilot Bug: 'I'm sorry. Something went wrong with processing. Please...' copilot response",
          "text": "Copilot Bug: 'I'm sorry. Something went wrong with processing. Please...' copilot response\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nhi i have been using it for 2 days but for the last 2 hours the desktop and visual studio extension are not working. \n\nNo matter what I type, it gives me this error. There was an update message for the app, it was about installing a version, I installed it but it didn't fix it.\nalways the same message \nvisual studio ide 2022 17.12 \nwindows 10 pro\n![Image](https://github.com/user-attachments/assets/c64d85bd-eb1a-4f1c-a25e-570c9a55ccd1)\n![Image](https://github.com/user-attachments/assets/55b600a6-95f4-4e71-aee1-1b1ce8b6599c)\n\n\n## GitHub Issue Summary\n\n**Key points:**\n\n* Users reported issues with the \"me too\" functionality.\n* The issue was linked to invalid OpenAI API keys.\n* The problem appears to have been resolved by removing the API key or switching to a different model (GPT4o).\n\n**Problems identified:**\n\n* Invalid OpenAI API keys caused the \"me too\" functionality to malfunction.\n* Claude and Gemini models faced performance issues, leading to errors.\n\n**Solutions proposed/implemented:**\n\n* **Removing OpenAI API key:** This worked for some users, and is currently recommended.\n* **Switching to GPT4o model:** Offered as an alternative solution due to issues with other models.\n* **Updating to 11.0.3 and signing in to Pieces:** This should enhance rate limits and improve functionality.\n\n**Current status/outcome:**\n\n* The problem seems to be resolved for users who removed their OpenAI API key or switched models.\n* Further investigation is needed to identify the cause of API key failures and address performance issues with Claude and Gemini models.",
          "activity_level": 3.98
        }
      ]
    },
    {
      "title": "Pieces OS Connection Issues",
      "description": "Users report difficulties connecting to Pieces OS from VSCode, particularly in remote environments (WSL2, Docker) or when Pieces OS is installed via snap.  This seems to be caused by network configuration issues, potentially related to Pieces OS listening on the wrong network interface. Proposed solutions include ensuring Pieces OS listens on all interfaces, configuring DNS settings, and using systemd in WSL2.  Some users experience issues with the Pieces desktop app launching or connecting to the Pieces OS server.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 489,
          "title": "VSCode extension issue rendering Copilot when installed via snap in WSL2",
          "text": "VSCode extension issue rendering Copilot when installed via snap in WSL2\n### Software\n\nVS Code\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.15\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen Pieces OS is installed via snap in WSL2 for windows and VSCode is also installed through snap in WSL2, there is an issue detecting Pieces OS location and setting the proper API url.\n\n\nSetting a custom url to the linux port 'http://localhost:5323' and following the WSL steps listed here: https://docs.pieces.app/product-highlights-and-benefits/connecting-to-a-remote-pieces-os-instance allows for communication between the VSCode extension and Pieces OS itself.\n\nHowever, when VSCode attempts to request the Pieces Copilot -- The applet is launched on a port, the port is returned to the extension, but the Copilot fails to render in VSCode.\n\nUntil the root cause is detected and resolved, the recommended workaround is to install Pieces OS via Pieces Suite and run VSCode outside of WSL2 if at all possible.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* Hra42 suggests network issues as a root cause, potentially related to WSL2 or snap installations.\n* They propose exploring solutions like Systemd support and the dns-tunnel in WSL2.\n* Robert-at-pieces reports using systemd in their WSL2 configuration and notes that the Pieces VSCode extension can connect to Pieces OS. However, Copilot's dynamic port hosting is failing.\n\n**Problems Identified:**\n\n* Network issues potentially preventing proper Copilot rendering.\n* Unknown cause whether WSL2 or snap installation related.\n\n**Solutions Proposed/Implemented:**\n\n* Investigating Systemd support and the dns-tunnel in WSL2.\n* Debugging snap installation.\n\n**Current Status/Outcome:**\n\n* The investigation is ongoing. Robert-at-pieces will update the ticket with further progress.\n\n**Action Items:**\n\n* Further investigation to determine the root cause of the issue.\n* Testing the proposed solutions, including Systemd support and dns-tuning.\n* Updating the ticket with any new findings.",
          "activity_level": 1.89
        },
        {
          "id": 550,
          "title": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)",
          "text": "Seems like you are running VS Code in a remote environment (VS Code running remote docker container)\n### Software\n\nVS Code\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.02\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI'm having the same problem as this: https://github.com/pieces-app/support/issues/269\n\nUsing VS Code project within a docker container and getting this message:\n\n> Woops! It seems like you are running VS Code in a remote environment & Pieces for VS Code cannot connect to Pieces OS. Please refer to our documentation on how to resolve this issue.\n\n![Image](https://github.com/user-attachments/assets/ffeb53fd-0787-4bc2-9faf-c5f3d179294b)\n\nPieces OS version:\n\n![Image](https://github.com/user-attachments/assets/640d35af-6106-4717-9269-c51205ff23fb)\n\nI followed this guide but with no luck: https://docs.pieces.app/product-highlights-and-benefits/connecting-to-a-remote-pieces-os-instance\n\nLAN IP:\n\n<img width=\"567\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/1dfb849d-0764-4ae0-801c-c55f9b3e5d7e\" />\n\nVS Code settings, pieces custom URL:\n\n![Image](https://github.com/user-attachments/assets/aaed7eb8-36e7-49cb-b6e0-84271adb8027)\n\nWhat else can I try?\n\nThanks!\n\n## Summary of GitHub Issue Conversation\n\n### Key Points:\n\n* Malanciault reported an issue where they were unable to connect to Pieces OS from their remote VSCode instance hosted inside Docker.\n* They provided screenshots of the error message and tried various troubleshooting steps.\n* Robert from Pieces identified the issue as a change in listening interface in the latest major release, causing security restrictions.\n* A workaround involving DNS configuration was suggested, but a patch was recommended for a simpler solution.\n* VSCode extension version 2.0.1 was released with the patch, but Malanciault still encountered issues.\n* A video call was scheduled to further investigate the problem.\n\n### Problems Identified:\n\n* Pieces OS server listening on loopback interface by default, causing connection issues for remote clients.\n* Custom URL workaround not functioning properly for webview tool windows.\n\n### Solutions Proposed/Implemented:\n\n* Patch in VSCode extension 2.0.1 allowing listening on all interfaces.\n* Enabling automatic detection of Pieces OS without custom URL.\n\n### Current Status/Outcome:\n\n* Issue resolved in Pieces for VSCode extension version 2.0.2.\n* Further investigation via video call might be needed for Malanciault's specific case.",
          "activity_level": 7.78
        },
        {
          "id": 131,
          "title": "Unable to Launch Pieces Windows Desktop Version",
          "text": "Unable to Launch Pieces Windows Desktop Version\n### Software\n\nDesktop Application\n\n### Operating System\n\nWindows\n\n### Your Pieces OS Version\n\nversion: 8.0\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n**Issue:**\r\nI am encountering difficulties with installing and launching the Pieces Windows desktop version. After a successful installation, the software fails to open properly. Despite confirming its presence in the task manager, there is no visible output on the screen.\r\n\r\n**Steps to Reproduce:**\r\n\r\n- Download and install the Pieces Windows desktop version.\r\n- Attempt to launch the software.\r\n- Observe that the program does not open on the screen.\r\n- Check the task manager to confirm the software is running in the background.\r\n\r\n**Expected Behavior:**\r\nUpon installation, the Pieces Windows desktop version should launch and display its interface on the screen, allowing users to interact with it\r\n\r\n**Actual Behavior:**\r\nAfter installation, the software does not open as expected. Despite running in the background according to the task manager, there is no visible output on the screen.\r\n\r\n**System Information:**\r\n\r\n- Windows version: 22H2 (OS Build 19045)\r\n\r\n**Additional Notes:**\r\nI have attempted to troubleshoot this issue without success. Any assistance or insights into resolving this matter would be greatly appreciated. Thank you for your attention to this matter.\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* Pieces OS is not launching when accessed from the Pieces suite or start menu.\n* The system tray icon opens a window that says \"Connecting Pieces Apps\" but fails to connect.\n* The Pieces Chrome extension encounters a \"Failed to connect to Pieces OS\" error.\n* This issue occurs on both Windows 11 and MacOS.\n\n**Problems Identified:**\n\n* Pieces OS launch failure.\n* Connection problems between Pieces OS and the system tray icon.\n* Connection issues between Pieces OS and the Chrome extension.\n\n**Solutions Proposed/Implemented:**\n\n* Checking App Installer for updates (Windows).\n* Checking for similar issues in other GitHub threads.\n* No confirmed solutions implemented yet.\n\n**Current Status/Outcome:**\n\n* Issue remains unresolved as of November 8, 2024. \n* Several users have reported experiencing the same problem.\n\n**Additional Notes:**\n\n* The issue appears to affect both Windows and MacOS users.\n* The specific versions of Pieces OS, desktop app, and Chrome extension are mentioned in the conversation. \n* Users are encouraged to provide additional information about their device and software versions if they encounter this issue.",
          "activity_level": 2.3
        }
      ]
    },
    {
      "title": "Pieces Desktop Application Bugs and Fixes",
      "description": "Users reported various bugs in the Pieces Desktop Application, including issues with saved snippets welcome screen, unresponsive Copilot, and plugin functionalities.  Solutions involved bug fixes, patches in upcoming releases, and continuous investigation by the support team.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 582,
          "title": "Saved Snippets Welcome Screen",
          "text": "Saved Snippets Welcome Screen\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen I save a snippet I get a Welcome Message with the first saved snippet every time:\n![Image](https://github.com/user-attachments/assets/7f8c393f-0097-4f17-997a-75d20c526ce3)\n\nPfD Version: 3.3.3\n## GitHub Issue Conversation Summary\n\n**Key Points:**\n\n* A bug was identified and reported by the author (@mack-at-pieces).\n* The bug was successfully reproduced by another user (@hra42).\n* A patch will be implemented in the next Desktop App release.\n\n**Problems Identified:**\n\n* The specific details of the bug are not provided in the conversation excerpt.\n\n**Solutions Proposed/Implemented:**\n\n* A patch will be implemented in the next Desktop App release to fix the bug.\n\n**Current Status/Outcome:**\n\n* The bug has been identified and will be fixed in the next release.\n\n**Additional Notes:**\n\n* The conversation excerpt does not provide information on the severity of the bug or the impact it has on users. \n* It would be helpful to have more context about the bug and its resolution for a more complete understanding of the issue.",
          "activity_level": 2.46
        },
        {
          "id": 584,
          "title": "Copilot is not giving any feedback",
          "text": "Copilot is not giving any feedback\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPieces for Developers 3.3.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe copilot is not generating anything, it just keeps on loading.\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* User gittydia created an issue for a bug in the Pieces Copilot service.\n* The issue involved receiving the error message \"I'm sorry. Something went wrong with the processing...\" when using Copilot.\n* User provided details about the issue, including the platform and steps to reproduce it.\n\n**Problems Identified:**\n\n* The bug prevented users from accessing Copilot responses.\n* The cause of the bug was not identified in the conversation.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support confirmed a fix for the issue in the upcoming PiecesOS release (version 11.0.4).\n* User is requested to report back if the issue persists after installing the update.\n\n**Current Status/Outcome:**\n\n* The issue is expected to be resolved after the release of PiecesOS version 11.0.4.\n* The user will confirm the outcome after updating their system.\n\n**Additional Information:**\n\n* The conversation provides links to related issues and helpful resources.\n\n**Conciseness:**\n\nThis summary provides the essential details of the conversation in a concise format, focusing on the key points, problems, solutions, and outcome.",
          "activity_level": 2.68
        },
        {
          "id": 586,
          "title": "Pieces plugin for UltraEdit is unresponsive after asking copilot to describe ~3000 line .py script",
          "text": "Pieces plugin for UltraEdit is unresponsive after asking copilot to describe ~3000 line .py script\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nIn UltraEdit I opened the python script available at https://github.com/eldraco/domain_analyzer/blob/master/domain_analyzer.py. I opened the Pieces plugin and using default settings prompted it to describe the script: \"What does this Python script do?\" The UE plugin never returns any content and seems to be unresponsive. \n\nIn Pieces Desktop, I do see the result, however interaction with it is latent indicating some sort of continual background processing even though the LLM has completed processing. Additionally, there seem to be significant scroll issues, and the code view doesn't appear to be calculating line numbers correctly, showing many empty lines after line 1,918, when line 2,837 is the last line in the file.\n\nFinally, the Pieces Desktop code view shows a wrap in the line number margin.\n\n![Image](https://github.com/user-attachments/assets/9be69032-f2e2-4379-843c-cd0bf14da63a)\n## Summary of GitHub Issue Conversation\n\n**Key points:**\n\n* User @bschwenk reported two issues with a specific file: 1) context issues and 2) line number wrapping.\n* Support bot responded with helpful resources and suggested related issues.\n* @mark-at-pieces confirmed the context issue and reported being able to reproduce the line wrapping issue. \n* @sam-at-pieces identified a fix for the context issue and provided a link to the asset.\n* @mark-at-pieces confirmed the context issue resolution and release date.\n* @bschwenk expressed gratitude.\n\n**Problems identified:**\n\n* Context issue: The file provided by the user was not included in the context.\n* Line number wrapping issue.\n\n**Solutions proposed/implemented:**\n\n* Fix for the context issue was identified and implemented for the upcoming release.\n* Line number wrapping issue is still being investigated.\n\n**Current status/outcome:**\n\n* Context issue has been resolved and will be released in Pieces version 11.0.4.\n* Line number wrapping issue is being investigated.\n\n**Overall, the support team was responsive and worked collaboratively to identify and address the reported issues.**",
          "activity_level": 5.8
        }
      ]
    },
    {
      "title": "Pieces Software Functionality Issues",
      "description": "Users report various issues with Pieces software, including Neural Code Search not returning results and Copilot not generating responses. Troubleshooting steps often involve checking for updates or providing logs to support. Solutions include bug fixes in upcoming releases or further investigation by the Pieces support team.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 588,
          "title": "Neural Code Search returns no results",
          "text": "Neural Code Search returns no results\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI have four materials entered since a few days ago and NCS type search never returns anything.\n\n![Image](https://github.com/user-attachments/assets/cea82b95-b382-45f3-8777-227d3abd2269)\n\n![Image](https://github.com/user-attachments/assets/175e6117-9ef6-49c0-94f2-26812b788080)\n## Summary of GitHub Issue Conversation: \n\n**Key Points:**\n\n* User (@hovek) reported issues with searching in Pieces app.\n* Support acknowledged the issue and provided troubleshooting suggestions.\n* Existing search methods explained:\n    * NCS: Semantic code search for finding similar code based on function.\n    * FTS: Character-based search for exact text matches.\n    * Blended: Fuzzy search across content, metadata, and related information.\n* Support confirmed a search upgrade is planned for the end of the quarter.\n\n**Problems Identified:**\n\n* Existing search functionalities are confusing and don't meet user expectations.\n* Missing features like character-based search and metadata searching in NCS and FTS, respectively.\n\n**Solutions Proposed/Implemented:**\n\n* No immediate solution implemented, but a major search upgrade is planned for the future.\n\n**Current Status/Outcome:**\n\n* The user's issue is acknowledged and understood. \n* They are advised to use existing search methods with their limitations in mind until the planned upgrade arrives. \n* The upgrade is scheduled for the end of the quarter, improving search capabilities significantly.",
          "activity_level": 4.5
        },
        {
          "id": 584,
          "title": "Copilot is not giving any feedback",
          "text": "Copilot is not giving any feedback\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPieces for Developers 3.3.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe copilot is not generating anything, it just keeps on loading.\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* User gittydia created an issue for a bug in the Pieces Copilot service.\n* The issue involved receiving the error message \"I'm sorry. Something went wrong with the processing...\" when using Copilot.\n* User provided details about the issue, including the platform and steps to reproduce it.\n\n**Problems Identified:**\n\n* The bug prevented users from accessing Copilot responses.\n* The cause of the bug was not identified in the conversation.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support confirmed a fix for the issue in the upcoming PiecesOS release (version 11.0.4).\n* User is requested to report back if the issue persists after installing the update.\n\n**Current Status/Outcome:**\n\n* The issue is expected to be resolved after the release of PiecesOS version 11.0.4.\n* The user will confirm the outcome after updating their system.\n\n**Additional Information:**\n\n* The conversation provides links to related issues and helpful resources.\n\n**Conciseness:**\n\nThis summary provides the essential details of the conversation in a concise format, focusing on the key points, problems, solutions, and outcome.",
          "activity_level": 2.68
        },
        {
          "id": 456,
          "title": "Not Working",
          "text": "Not Working\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nLatest \n\n### Early Access Program\n\n- [X] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![image](https://github.com/user-attachments/assets/99814116-7444-4cb0-8666-86b81dd9f580)\r\nIts Keep on showing connecting and its not getting connected and it gets stck\n## GitHub Issue Summary\n\n**Key Points:**\n\n* User @Ganesh-2-4 encountered an issue with the software.\n* The issue is related to logs located at Documents > com.pieces.os.\n\n**Problems Identified:**\n\n* The exact nature of the issue is unclear from the conversation snippet provided.\n\n**Solutions Proposed/Implemented:**\n\n* @rosie-at-pieces requested the user to zip up the logs and send them to support@pieces.app for further investigation.\n\n**Current Status/Outcome:**\n\n* The issue is currently being investigated by the Pieces support team.\n* The outcome of the investigation is unknown at this time.",
          "activity_level": 2.4
        }
      ]
    },
    {
      "title": "PiecesOS Performance Issues",
      "description": "Users report high RAM/CPU usage with PiecesOS, potentially linked to internet connectivity or on-device ML processing. Temporary solution: restart PiecesOS. Developers are working on optimization and memory leak fixes. Users experiencing persistent issues are encouraged to contact support and provide logs for troubleshooting.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 150,
          "title": "PiecesOS using too much RAM/spike in CPU",
          "text": "PiecesOS using too much RAM/spike in CPU\nSeveral users have called in recently about Pieces using too much RAM or causing a spike in CPU up to 100%. We are trying to track down this issue, and would appreciate any feedback about your experience with this if you are experiencing it. \r\n\r\nWe have a hunch it has something to do with internet connections, but aren't fully sure yet. \r\n\r\nIf you're experiencing this and wouldn't mind hopping on a call with us to show us, we would really appreciate it to help us troubleshoot! You can schedule a call [here](https://calendar.google.com/calendar/u/0/appointments/schedules/AcZssZ2iaRWpd1kA2k_xg2KrVi_jiTHo0POiMZSI9WAYsxs5jJ9sU2Rd2zKitLuSFd7l3FhatGzy5Vgt\r\n). \r\n\r\nA short-term solution is to restart PiecesOS whenever this occurs. \n## Summary of GitHub Issue Conversation on Pieces Memory Usage\n\n**Key Points Raised:**\n\n* PiecesOS has high memory usage, sometimes exceeding 5 GB.\n* This issue affects various users, particularly on Ubuntu and macOS.\n* High CPU usage causing system slowdowns is also reported.\n\n**Problems Identified:**\n\n* Memory leaks, likely related to on-device ML processing.\n* Resource-intensive features like Live Context.\n\n**Solutions Proposed/Implemented:**\n\n* Optimize Memory feature to unload unused ML models.\n* Ongoing development efforts to improve memory performance.\n\n**Current Status/Outcome:**\n\n* High memory and CPU usage remains a problem for many users.\n* The issue is attributed to the resource-intensive nature of on-device ML.\n* Further development is needed to improve performance and address the concerns of early adopters.\n\n**Additional Notes:**\n\n* Some users are disabling PiecesOS due to performance issues.\n* Specific details of memory usage are provided for different operating systems and setups.\n\n**Overall, the issue highlights the challenges of running on-device ML models with limitations in resource availability. While Pieces is actively working on improvements, users are experiencing performance issues that impact their workflow.**",
          "activity_level": 4.23
        },
        {
          "id": 456,
          "title": "Not Working",
          "text": "Not Working\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nLatest \n\n### Early Access Program\n\n- [X] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![image](https://github.com/user-attachments/assets/99814116-7444-4cb0-8666-86b81dd9f580)\r\nIts Keep on showing connecting and its not getting connected and it gets stck\n## GitHub Issue Summary\n\n**Key Points:**\n\n* User @Ganesh-2-4 encountered an issue with the software.\n* The issue is related to logs located at Documents > com.pieces.os.\n\n**Problems Identified:**\n\n* The exact nature of the issue is unclear from the conversation snippet provided.\n\n**Solutions Proposed/Implemented:**\n\n* @rosie-at-pieces requested the user to zip up the logs and send them to support@pieces.app for further investigation.\n\n**Current Status/Outcome:**\n\n* The issue is currently being investigated by the Pieces support team.\n* The outcome of the investigation is unknown at this time.",
          "activity_level": 2.4
        },
        {
          "id": 584,
          "title": "Copilot is not giving any feedback",
          "text": "Copilot is not giving any feedback\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPieces for Developers 3.3.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe copilot is not generating anything, it just keeps on loading.\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* User gittydia created an issue for a bug in the Pieces Copilot service.\n* The issue involved receiving the error message \"I'm sorry. Something went wrong with the processing...\" when using Copilot.\n* User provided details about the issue, including the platform and steps to reproduce it.\n\n**Problems Identified:**\n\n* The bug prevented users from accessing Copilot responses.\n* The cause of the bug was not identified in the conversation.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support confirmed a fix for the issue in the upcoming PiecesOS release (version 11.0.4).\n* User is requested to report back if the issue persists after installing the update.\n\n**Current Status/Outcome:**\n\n* The issue is expected to be resolved after the release of PiecesOS version 11.0.4.\n* The user will confirm the outcome after updating their system.\n\n**Additional Information:**\n\n* The conversation provides links to related issues and helpful resources.\n\n**Conciseness:**\n\nThis summary provides the essential details of the conversation in a concise format, focusing on the key points, problems, solutions, and outcome.",
          "activity_level": 2.68
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize resolution of Pieces Copilot issues:** This issue theme has the highest frequency and is associated with the most active tickets. Focus development efforts on addressing unresponsiveness, errors, and inconsistencies across platforms and Pieces versions.",
    "**Investigate and address Pieces OS connection problems:**  Explore solutions to network configuration issues, particularly in remote environments (WSL2, Docker) and snap installations. Ensure Pieces OS listens on all interfaces and provide clear documentation for users.",
    "**Improve Pieces Desktop Application stability and performance:** Address reported bugs related to saved snippets, welcome screen behavior, and plugin functionality. Investigate and optimize RAM/CPU usage, potentially caused by memory leaks or on-device ML processing.",
    "**Enhance communication and documentation:** Provide timely updates on bug fixes and new releases. Update documentation to include troubleshooting steps for common issues, especially those related to remote environments and network configurations.",
    "**Gather more user data and feedback:** Encourage users to report issues and provide detailed logs. Analyze this data to identify patterns and prioritize development efforts based on user impact and frequency of issues.",
    "**Consider expanding testing efforts:** Implement more rigorous testing procedures, particularly for remote environments, different operating systems, and various IDE integrations, to catch issues early in the development cycle."
  ],
  "message": "Daily support report generated successfully."
}