{
  "success": true,
  "date_range": {
    "start": "2025-02-15T00:00:00+00:00",
    "end": "2025-02-15T05:06:23.423303+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:macos",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:pieces os",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 625,
      "title": "PiecesOS crash immediately after launch",
      "activity_level": 13.35
    }
  ],
  "common_issues": [
    {
      "title": "PiecesOS crashes on launch after upgrade",
      "description": "Users reported PiecesOS crashing immediately after launching version 11.1.1 on macOS. The issue stemmed from AVX2 incompatibility with CPUs older than 2016/2017. The Pieces team addressed this in version 11.1.2. Users with older CPUs experiencing this issue are recommended to upgrade to the latest PiecesOS version.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 625,
          "title": "PiecesOS crash immediately after launch",
          "text": "PiecesOS crash immediately after launch\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.1.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nAfter upgrade PiecesOS to version 11.1..1 it crashes every time immediately after launch. Previous version worked well. Attached is the crash report log.\n\nEnvironment: \n\n- OS MacOS 15.2\n- CPU Intel \n\n[trace.log](https://github.com/user-attachments/files/18777512/trace.log)\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* @gonzososa reported an issue with PiecesOS failing to launch on their macOS (Arm architecture) system.\n* The issue seems related to the new vector library having AVX2 issues on certain systems.\n* @gonzososa provided their CPU information (Intel(R) Core(TM) i5-3210M CPU @ 2.50GHz).\n* @hra42 identified the root cause as the lack of AVX2 support on CPUs before 2016/2017.\n\n**Problems Identified:**\n\n* PiecesOS was not launching on certain macOS systems due to AVX2 incompatibility.\n* This affected users with older CPUs (pre-2016/2017).\n\n**Solutions Proposed/Implemented:**\n\n* The Pieces team acknowledged the issue and worked on a solution.\n* A fix was released in version 11.1.2 of the application.\n\n**Current Status/Outcome:**\n\n* The issue has been resolved with the release of version 11.1.2.\n* @gonzososa confirmed that the fix worked for them. \n\n**Additional Notes:**\n\n* The issue was also related to another reported issue (#620).\n* Users with older CPUs may need to upgrade to a newer system to use the latest version of PiecesOS.",
          "activity_level": 13.35
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize resolving the PiecesOS crash issue:** This issue is impacting users with older CPUs and has caused a spike in support tickets. Focusing on providing a permanent fix for this issue should be a top priority.",
    "**Improve communication around known issues:** Proactively communicate known issues like the AVX2 incompatibility to users, potentially through release notes or in-app messaging. This can help reduce user frustration and support tickets.",
    "**Consider CPU compatibility in future releases:**  Given the AVX2 issue, establish a robust testing process for new releases to ensure compatibility with a wider range of CPU models, preventing similar issues in the future.",
    "**Gather more detailed system information:**  Collect more detailed system information from users during the bug reporting process, such as CPU model and macOS version. This will help in faster diagnosis and resolution of issues.",
    "**Create a dedicated knowledge base article for the crash issue:**  Publish a detailed knowledge base article addressing the crash issue, including troubleshooting steps and workarounds. This can help users resolve the issue independently and reduce the load on support agents."
  ],
  "message": "Daily support report generated successfully."
}