{
  "success": true,
  "date_range": {
    "start": "2025-03-10T00:00:00+00:00",
    "end": "2025-03-15T21:06:25.878324+00:00"
  },
  "summary": {
    "total_tickets": 15,
    "resolved_tickets": 3,
    "open_tickets": 12
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 13,
      "resolved": 3,
      "pending": 10
    },
    {
      "category": "status:triaged",
      "received": 7,
      "resolved": 3,
      "pending": 4
    },
    {
      "category": "ollama",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "os:windows",
      "received": 9,
      "resolved": 0,
      "pending": 9
    },
    {
      "category": "app:pieces os",
      "received": 8,
      "resolved": 0,
      "pending": 8
    },
    {
      "category": "os:macos",
      "received": 3,
      "resolved": 1,
      "pending": 2
    },
    {
      "category": "app:web extension",
      "received": 3,
      "resolved": 2,
      "pending": 1
    },
    {
      "category": "status:new",
      "received": 5,
      "resolved": 0,
      "pending": 5
    },
    {
      "category": "app:desktop application",
      "received": 11,
      "resolved": 0,
      "pending": 11
    },
    {
      "category": "app:vs code",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "blocked",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:visual studio",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "enhancement",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:pending_release",
      "received": 2,
      "resolved": 0,
      "pending": 2
    }
  ],
  "most_active_tickets": [
    {
      "number": 652,
      "title": "\"Secret Message\" Example doesn't work properly",
      "activity_level": 7.7
    },
    {
      "number": 659,
      "title": "Chrome Extension messing out stackoverflow",
      "activity_level": 5.99
    },
    {
      "number": 661,
      "title": "Pieces desktop this message is empty please try again",
      "activity_level": 5.34
    },
    {
      "number": 654,
      "title": "Pieces OS Update fails",
      "activity_level": 4.86
    },
    {
      "number": 570,
      "title": "Pieces OS conflicting with Installed Ollama Server?",
      "activity_level": 4.47
    },
    {
      "number": 315,
      "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
      "activity_level": 4.16
    },
    {
      "number": 658,
      "title": "Personal Domain backup",
      "activity_level": 3.91
    },
    {
      "number": 666,
      "title": "Response \"I'll get back to you with my findings as soon as possible\"",
      "activity_level": 3.88
    },
    {
      "number": 668,
      "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
      "activity_level": 3.5
    },
    {
      "number": 667,
      "title": "Opening Issue",
      "activity_level": 3.5
    },
    {
      "number": 655,
      "title": "Pieces Visual Studio 2022 extension conflict with SQL Server Object Explorer",
      "activity_level": 3.38
    },
    {
      "number": 562,
      "title": "Chrome Extension Fills Developer Console with Errors",
      "activity_level": 3.15
    },
    {
      "number": 665,
      "title": "Installation doesn't follow the System Apps default location",
      "activity_level": 2.15
    },
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 1.93
    },
    {
      "number": 460,
      "title": "pieces desktop and its extension not working",
      "activity_level": 1.52
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS Performance Issues and Unexpected Responses",
      "description": "Users report slow performance, unresponsiveness, and vague responses like \"I'll get back to you.\"  Issues appear related to specific Pieces OS versions and features like Hard Reset.  Solutions include updating Pieces OS and Desktop app, restarting Pieces OS, and providing detailed bug reports.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 666,
          "title": "Response \"I'll get back to you with my findings as soon as possible\"",
          "text": "Response \"I'll get back to you with my findings as soon as possible\"\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n**The Bug**\nThe chat assistant will respond claiming that it's working on a solution and will get back to you at a later date. \n\n**Expected Behaviour**\nGet an actionable response with some suggested action/code.\n\n**Details**\nMost recent example of this kind of response (\"_\" is not part of the response just a redaction):\n\n> \"I'll carefully examine the data flow related to _, _, _, _, and _  to see if any inconsistencies could lead to bugs. Please give me a few minutes to review the code thoroughly with this specific focus in mind. I'll get back to you with my findings as soon as possible.\"\n\nThis has happened in three different conversations. I first noticed the behaviour this month, so not before updates preceding March. I promise I'm not trying to be lazy on this one, it's difficult to offer reproduction steps.\n\nI use Claude 3.5 more than any option regularly.\n\nThe last conversation where this happened:\n\n- I loaded 15 files into the context menu\n- I sent 22 requests (and received 22 responses where it happened on the 22nd response)\n\nI'll update this issue if there's anything I can do to make the reproduction more narrow.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @seantiz reported a bug where files weren't loading into the context after 11 requests and responses.\n* The report lacks specific steps to reproduce the issue.\n\n**Problems Identified:**\n\n* Files not loading into the context after a certain number of requests.\n* Difficulty in reproducing the issue due to lack of specific steps.\n\n**Solutions Proposed/Implemented:**\n\n* No specific solutions proposed or implemented in the conversation.\n\n**Current Status/Outcome:**\n\n* The issue is acknowledged and routed to the relevant team member.\n* User is advised to provide more details for better troubleshooting.\n\n**Additional Notes:**\n\n* The user is directed to relevant resources like existing issues, documentation, and the Pieces YouTube channel.",
          "activity_level": 3.88
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users are experiencing performance issues with the Copilot feature, including slow response times and hangs.\n* The issue appears to be related to a bug in the \"Hard-Reset Active Runtime\" functionality.\n* A fix was implemented and released in version 10.0.2 of Pieces OS and version 3.0.2 of Pieces Desktop.\n\n**Problems Identified:**\n\n* Slow response times, particularly after using \"Hard-Reset Active Runtime\".\n* In some cases, Copilot hangs indefinitely with \"...\" loading indicator.\n* High CPU usage and blocked responses.\n* Context files not being read.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix for the \"Hard-Reset Active Runtime\" functionality was implemented and released.\n* Significant performance improvements were released in version 3.1.0 of the Desktop app.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for some users, including those on Windows 11.\n* However, some users are still experiencing performance issues after the latest updates.\n* Further investigation and troubleshooting may be needed for those users still experiencing problems.\n\n**Additional Information:**\n\n* Users experiencing issues are encouraged to provide feedback to the Pieces team by scheduling a call or providing additional information about their specific situation.\n* The issue was originally reported in July 2024 and the latest update was provided in March 2025.",
          "activity_level": 4.16
        },
        {
          "id": 652,
          "title": "\"Secret Message\" Example doesn't work properly",
          "text": "\"Secret Message\" Example doesn't work properly\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen using LTM-2 to test the secret message example:\nhttps://pieces.app/magic-moments/ltm\n\nI got a strange response from the LLM:\nClaude 3.5:\nFirst Try:\n![Image](https://github.com/user-attachments/assets/1962a3e4-8b02-4d3f-bc8c-4bdd72c80aa6)\n2. try: (waited longer on the website)\n![Image](https://github.com/user-attachments/assets/cd71c5c1-d5d5-4449-acd5-e070fb244fa9)\n\nGemini 2.0 Flash did fail completely:\n![Image](https://github.com/user-attachments/assets/50735f7a-28a1-4563-b490-e10c271eca23)\n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users are experiencing an issue where PiecesOS is running in basic mode due to device constraints.\n* This issue prevents the Pieces app from displaying updates from the LTM engine and accessing the \"Workstream Activity\" feature.\n* The issue seems to be affecting users with Apple M3 Macs running macOS 15.3.1.\n\n**Problems Identified:**\n\n* PiecesOS is mistakenly running in basic mode on certain devices, even though they should be capable of running the full version.\n* This bug prevents users from accessing key features and seeing updates from the LTM engine.\n\n**Solutions Proposed/Implemented:**\n\n* Restarting PiecesOS can temporarily fix the issue for some users.\n* A permanent fix will be included in the next version of PiecesOS.\n\n**Current Status/Outcome:**\n\n* The bug is being worked on and will be fixed in the next PiecesOS update.\n* Users can use the workaround of restarting PiecesOS until the fix is released.\n\n**Additional Information:**\n\n* The \"unknown origin\" element in the telemetry browser is likely related to a previous version of PiecesOS.\n* Mark-at-Pieces has offered to elaborate on the concept of \"basic mode\" if needed.\n\n## User Actions\n\n* Restart PiecesOS if you are experiencing the issue.\n* Wait for the next version of PiecesOS to be released for a permanent fix.\n* If you have further questions, you can reply to the GitHub issue or contact Pieces support.",
          "activity_level": 7.7
        }
      ]
    },
    {
      "title": "Pieces Extension Conflicts Causing Functionality Issues",
      "description": "Pieces extensions across different platforms (Chrome, VS Code) are causing conflicts that break core functionalities like editing text, viewing console logs, and interacting with specific applications. Solutions vary from disabling certain features in Pieces to waiting for bug fixes from the Pieces team.  The Pieces team is actively investigating and addressing these issues.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 659,
          "title": "Chrome Extension messing out stackoverflow",
          "text": "Chrome Extension messing out stackoverflow\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Web Extension\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nIt fills this text endlessly...\n\n![Image](https://github.com/user-attachments/assets/6b5edb10-b7cf-4fa6-a523-aa73af94cbee)\n## Summary of GitHub Issue Conversation\n\n**Problem:**\n\n* User @luceat-lux-vestra reported an issue where the PWE extension caused the browser tab to crash on specific pages.\n* This issue was likely due to enabled embed buttons on those pages, which the extension previously handled by blacklisting. \n\n**Solutions:**\n\n* **Temporary:** Disable embed buttons on the affected pages through the side panel settings as a workaround.\n* **Long-term:** Pieces team is investigating a permanent solution.\n\n**Current Status:**\n\n* The user confirmed that disabling embed buttons resolved the issue.\n* The Pieces team is working on a permanent fix.\n\n**Key Takeaways:**\n\n* Blacklisting problematic pages was a temporary fix for embedded button crashes. \n* Disabling embedded buttons is a current workaround for affected users. \n* A permanent solution is under development by the Pieces team.",
          "activity_level": 5.99
        },
        {
          "id": 562,
          "title": "Chrome Extension Fills Developer Console with Errors",
          "text": "Chrome Extension Fills Developer Console with Errors\n### Software\n\nWeb Extension\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nIt appears the browser extension is sniffing a bunch of local ports - starting with 1000.  This is a bit concerning, and a little invasive, but I do have the Pieces OS running, and it does finally get a response at a high port.\n\nThis fills my devtools console tab, degrading my development experience by clouding errors I'm looking for in my own app.\n\nFor a product designed to enhance my development experience I'm marking this as a bug.\n\n<img width=\"753\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/6b95b2c4-881c-4682-a544-3ae138e644ae\" />\n\n## Summary of GitHub Issue Conversation: Unexpected Port Checks\n\n**Key Points:**\n\n* Pieces OS updates resulted in unexpected port checks.\n* These checks flood the developer console, causing confusion and interfering with debugging.\n* Even though the checks are privacy-safe, users found them invasive.\n* The issue may be due to a Chrome bug.\n\n**Problems Identified:**\n\n* Unexpected port checks clutter the developer console, making it difficult to distinguish real errors from phantom ones.\n* The port checks were perceived as invasive by some users.\n\n**Solutions Proposed/Implemented:**\n\n* Rutvik, a developer at Pieces, proposed hiding or better handling the errors from the port checks.\n* Rutvik later suggested checking the \"Hide Network Messages\" box in the developer console settings to prevent network logs.\n* The issue was ultimately fixed in version `4.0.4` of the Pieces web extension.\n\n**Current Status/Outcome:**\n\n* The port checks issue has been resolved with the latest update of the web extension.\n* Users should update to version `4.0.4` or later to avoid the issue.\n\n**Additional Notes:**\n\n* The possibility of the issue being caused by a Chrome bug was investigated but remained unresolved.\n* The developers remain committed to improving user experience by addressing concerns related to privacy and clarity.",
          "activity_level": 3.15
        },
        {
          "id": 655,
          "title": "Pieces Visual Studio 2022 extension conflict with SQL Server Object Explorer",
          "text": "Pieces Visual Studio 2022 extension conflict with SQL Server Object Explorer\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nVisual Studio\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWith Pieces Extension installed in Visual studio 2022, SQL database field is not editable (not clickable?)\n\nReproduce: \n- Connect to any SQL server with some table, choose a table and right click -> View Data\n- Try edit the database's table field (the field will be unable to focus, so unable to edit)\n\n* SQL database is editable again after disable pieces extension and restart VS.\n* Try turn off everything in the extension's UserPreference did not work.\n* While you can not edit a field, but delete a row is possible (so maybe some UI conflict?)\n\nHere are some picture\n\nWithout the extension: the edit cursor shown up when click on field\n![Image](https://github.com/user-attachments/assets/c45dbafe-29c7-4acd-9827-b34cd0cd76f7)\n\nWith the extension: the edit cursor did not show up. Clicking just selected the field.\n![Image](https://github.com/user-attachments/assets/8f430ff6-18f8-41fe-a58e-42ebbeec3be2)\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @hikineet98 reported an issue where the cursor disappears after editing a cell in a script file using the Pieces for Visual Studio plugin.\n* The issue seems to be specific to script files and occurs when the user tabs or otherwise removes the edit cursor from the cell.\n\n**Problems Identified:**\n\n* The cause of the disappearing cursor is unclear.\n* The issue appears to be a conflict between the Pieces for Visual Studio plugin and the Tool Window.\n\n**Solutions Proposed/Implemented:**\n\n* The lead developer was able to replicate the issue and is investigating the cause.\n* No solution has been implemented yet.\n\n**Current Status/Outcome:**\n\n* The issue is still under investigation.\n* The user is unable to edit cells in script files after the cursor disappears.\n\n**Additional Notes:**\n\n* The user was provided with links to relevant resources while they wait for a solution.",
          "activity_level": 3.38
        }
      ]
    },
    {
      "title": "Pieces OS Performance Issues and Conflicts",
      "description": "Users report slow performance, unresponsiveness, and conflicts with external applications, particularly involving Ollama and keyboard handlers. Solutions include updating Pieces OS, reinstalling conflicting applications, and managing background processes. Some issues persist and require further investigation by the Pieces team.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 570,
          "title": "Pieces OS conflicting with Installed Ollama Server?",
          "text": "Pieces OS conflicting with Installed Ollama Server?\n### Software\n\nPieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.0.3\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nMy Pieces OS instance's Ollama server would always give errors regarding various Cuda dll files not being registered or not found, so I then installed Ollama server from its source which works and Pieces OS could also connect too and use, the problem I'm facing now is that Pieces OS on startup seems to keep starting its own Ollama instance rather than using the externally installed Ollama server instance which means I see the Cuda dll errors again.  My workaround is that I must quit Pieces OS completely then start Ollama server from its own shortcut then start Pieces OS??\n\nAny Ideas??\n## Summary of GitHub Issue Conversation between brian-at-pieces and johnkennyuk\n\n**Issue:** Johnkennyuk was encountering problems with Ollama on his Pieces OS, experiencing Cuda errors and conflicts between the Pieces OS Ollama instance and an externally installed one.\n\n**Key points raised:**\n\n* Johnkennyuk was experiencing Cuda errors with the Pieces OS Ollama instance.\n* Pieces OS was attempting to start its own Ollama instance even though an external one was already running.\n* Johnkennyuk suspected a race condition as the culprit.\n\n**Problems identified:**\n\n* Incomplete or broken Ollama installation.\n* Conflicting Ollama instances leading to errors.\n* Race condition causing Pieces OS to start its own Ollama instance despite the external one being active.\n\n**Solutions proposed/implemented:**\n\n* Uninstalling and reinstalling Ollama using OllamaSetup.exe.\n* Checking the Path environment variable.\n* Restarting Pieces OS and Ollama app in a specific order.\n* Updating to Pieces OS version 11.1.2 which addressed the race condition.\n\n**Current status/outcome:**\n\n* The issue seems to be resolved after updating to Pieces OS version 11.1.2.\n* Johnkennyuk will continue to monitor the situation and report any further occurrences.\n\n**Additional notes:**\n\n* Johnkennyuk suggested the capability for Pieces OS to detect and utilize an externally installed Ollama app instance.\n* Brian-at-pieces confirmed this is possible and encouraged Johnkennyuk to reach out if the issue persists.",
          "activity_level": 4.47
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* User @bpluly reported an issue with Long Term Memory (LTM) slowing down their PC, even after updating to LTM-2.\n* The issue has been triaged and routed to the responsible Pieces team member.\n* The bot provided links to potentially helpful resources, including related issues, documentation, and the Pieces YouTube channel.\n\n**Problems Identified:**\n\n* Long Term Memory (LTM) is slowing down the user's PC.\n\n**Solutions Proposed/Implemented:**\n\n* The issue has been assigned to the relevant team member for investigation and resolution.\n\n**Current Status/Outcome:**\n\n* The issue is currently being investigated by the Pieces team.\n\n**Additional Information:**\n\n* No further information is available at this time. \n* The user should expect a follow-up within 24 hours.",
          "activity_level": 3.5
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users are experiencing performance issues with the Copilot feature, including slow response times and hangs.\n* The issue appears to be related to a bug in the \"Hard-Reset Active Runtime\" functionality.\n* A fix was implemented and released in version 10.0.2 of Pieces OS and version 3.0.2 of Pieces Desktop.\n\n**Problems Identified:**\n\n* Slow response times, particularly after using \"Hard-Reset Active Runtime\".\n* In some cases, Copilot hangs indefinitely with \"...\" loading indicator.\n* High CPU usage and blocked responses.\n* Context files not being read.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix for the \"Hard-Reset Active Runtime\" functionality was implemented and released.\n* Significant performance improvements were released in version 3.1.0 of the Desktop app.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for some users, including those on Windows 11.\n* However, some users are still experiencing performance issues after the latest updates.\n* Further investigation and troubleshooting may be needed for those users still experiencing problems.\n\n**Additional Information:**\n\n* Users experiencing issues are encouraged to provide feedback to the Pieces team by scheduling a call or providing additional information about their specific situation.\n* The issue was originally reported in July 2024 and the latest update was provided in March 2025.",
          "activity_level": 4.16
        }
      ]
    },
    {
      "title": "Pieces Desktop App Performance Issues",
      "description": "Users reported slow response times, errors sending messages, and app crashes. The Pieces team acknowledged the issues and released patches and updates to address them. Users confirmed issue resolution after updates. Providing detailed information and logs helps in troubleshooting and faster resolution.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 661,
          "title": "Pieces desktop this message is empty please try again",
          "text": "Pieces desktop this message is empty please try again\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPieces for Developers 4.0.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen copy paste code sencond time in Ask anything give error  this message is empty please try again\n## GitHub Issue Summary\n**Issue:** Empty message error on Pieces desktop app after sending first message.\n**Reported by:** amarranjan1 (Mar 11, 2025)\n**Additional reports:**\n* veerendranath0312 (Mac version, Mar 11, 2025)\n* govard108 (Windows 10, Mar 12, 2025)\n**Proposed solution:** Patch release by Pieces team.\n**Implemented solution:** Patch release on Mar 12, 2025.\n**Current status:** Problem resolved, confirmed by govard108 on Mar 13, 2025.\n**Additional notes:**\n* The issue was causing an empty message error after sending the first message in new chats.\n* Several users reported the problem on various platforms (Windows, Mac).\n* Pieces team acknowledged the issue and released a patch within 24 hours. The problem was subsequently resolved.\n\n### Key Takeaways\n\n* Users experienced an error preventing sending messages after the first message in new chats.\n* The issue was platform-agnostic, affecting both Mac and Windows versions.\n* Pieces team responded promptly, identifying the cause and releasing a fix within a day.\n* The problem is now resolved, based on user confirmation.",
          "activity_level": 5.34
        },
        {
          "id": 460,
          "title": "pieces desktop and its extension not working",
          "text": "pieces desktop and its extension not working\n### Software\n\nDesktop Application, Pieces OS, Web Extension, VS Code\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nlatest\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nthe pieces os is working but the desktop app is saying it is not working and launch pieces os but when I click pieces od it take forever and still does not start, please fix this issue\n## Summary of GitHub Issue Conversation\n\n**Key points raised:**\n\n* User `satyam-acharya15462` reported issues with the desktop application not working.\n* User did not provide details like screenshots or videos.\n\n**Problems identified:**\n\n* Desktop application malfunctioning.\n* Lack of information from user to diagnose the issue.\n\n**Solutions proposed/implemented:**\n\n* Real-time communication suggested for diagnosis.\n* Link to calendar provided for scheduling a call.\n\n**Current status/outcome:**\n\n* User `rutvik-at-pieces` followed up for confirmation on issue resolution.\n* No response from user `satyam-acharya15462` on issue resolution or scheduling a call.\n\n**Unresolved:**\n\n* Whether the issue is fixed in the latest builds.\n* Whether the user wants to proceed with troubleshooting.\n\n**Note:** This summary is based on the provided information and may not reflect the complete picture.",
          "activity_level": 1.52
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users are experiencing performance issues with the Copilot feature, including slow response times and hangs.\n* The issue appears to be related to a bug in the \"Hard-Reset Active Runtime\" functionality.\n* A fix was implemented and released in version 10.0.2 of Pieces OS and version 3.0.2 of Pieces Desktop.\n\n**Problems Identified:**\n\n* Slow response times, particularly after using \"Hard-Reset Active Runtime\".\n* In some cases, Copilot hangs indefinitely with \"...\" loading indicator.\n* High CPU usage and blocked responses.\n* Context files not being read.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix for the \"Hard-Reset Active Runtime\" functionality was implemented and released.\n* Significant performance improvements were released in version 3.1.0 of the Desktop app.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for some users, including those on Windows 11.\n* However, some users are still experiencing performance issues after the latest updates.\n* Further investigation and troubleshooting may be needed for those users still experiencing problems.\n\n**Additional Information:**\n\n* Users experiencing issues are encouraged to provide feedback to the Pieces team by scheduling a call or providing additional information about their specific situation.\n* The issue was originally reported in July 2024 and the latest update was provided in March 2025.",
          "activity_level": 4.16
        }
      ]
    },
    {
      "title": "Pieces OS Installation and Update Issues",
      "description": "Users report problems with Pieces OS installation, updates, and personal domain management. Issues include installation failing to follow default system settings, update failures with error messages, and difficulties backing up and restoring personal domains. Suggested solutions involve checking system settings, updating Windows App Installer, and configuring antivirus software.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 658,
          "title": "Personal Domain backup",
          "text": "Personal Domain backup\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [x] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI want to sync this PC to another PC，but i cann't backup the lastest data.\n![Image](https://github.com/user-attachments/assets/bfb4fb14-5e7f-45c7-828f-5f77f550453a)\n\nthis is another PC\n\n![Image](https://github.com/user-attachments/assets/3c2d880e-a1b2-40c1-82b1-9935bffbf8fb)\n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* `laborer123` reported two issues:\n    * Unable to change personal domain after copying `com.pieces.os` and `com.pieces.pfd` to another PC.\n    * Unable to back up current computer with existing personal domain.\n\n**Problems Identified:**\n\n* Personal domain registration conflict.\n* Difficulty in backing up current computer with existing domain.\n\n**Solutions Proposed/Implemented:**\n\n* `mark-at-pieces` suggested trying to register a new domain to test functionality.\n* `mark-at-pieces` explained the restore process and provided a screenshot of the restore button.\n\n**Current Status/Outcome:**\n\n* User still unable to back up current computer with existing personal domain and desires to create a new one.\n\n**Additional Information:**\n\n* The issue was first reported on 2025-03-08 and last updated on 2025-03-10.\n* It appears the user needs further assistance with domain registration and backup creation.",
          "activity_level": 3.91
        },
        {
          "id": 665,
          "title": "Installation doesn't follow the System Apps default location",
          "text": "Installation doesn't follow the System Apps default location\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThere's no opportunity for the User to choose where the Pieces OS is installed or where any data that's collected is stored. From Windows 10 onwards there is a system feature to set where new content is to be stored by default. This is in Settings/System/Storage.\n\nYou can set where new Apps will be installed, new documents are stored, Music, etc.\n\nOnce this is set I would expect a current application to follow the default installation setting rather than hardcode it for the Boot drive.\n## Summary of GitHub Conversation regarding Pieces OS Issue\n\n**Key points raised:**\n\n- User @bpluly reported an issue (details not specified) with the Pieces OS.\n\n**Problems identified:**\n\n- Specific problem description is missing, but the issue is related to the Pieces OS.\n\n**Solutions proposed/implemented:**\n\n- The issue was automatically routed to the relevant Pieces team member for investigation.\n- The bot provided helpful resources such as related issues, documentation, and YouTube channel.\n\n**Current status/outcome:**\n\n- The issue is currently being investigated by the Pieces team.\n- No further updates are available as of the provided conversation.\n\n**Additional Notes:**\n\n- The conversation is from 2025-03-13, which is outdated. \n\n**Missing Information:**\n\n- Specific problem description is not available.\n- Current status of the issue is unclear.",
          "activity_level": 2.15
        },
        {
          "id": 654,
          "title": "Pieces OS Update fails",
          "text": "Pieces OS Update fails\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThe notification popped up saying an update was available so I clicked Update and a few seconds later got this message box:\n\n![Image](https://github.com/user-attachments/assets/b14dc8ab-632a-4095-b45b-7bbaba3c70ce)\n\nThis is on a very fresh Windows 11 installation.\n## GitHub Issue Summary\n\n**Issue:** Pieces OS failing to launch on Windows\n\n**Key Points:**\n\n* Users reported Pieces OS failing to launch, sometimes marked as a trojan by antivirus software.\n* The issue seems related to Windows App Installer and possibly antivirus blocking.\n\n**Problems Identified:**\n\n* Users unable to launch Pieces OS, hindering their ability to use the application.\n* False positive detection by antivirus software creates confusion and distrust.\n\n**Solutions Proposed/Implemented:**\n\n* Update Windows App Installer from the Microsoft Store.\n* Configure antivirus software to allow Pieces OS processes.\n* Potential need for developer intervention to address antivirus detection issue.\n\n**Current Status/Outcome:**\n\n* The issue appears unresolved, with no confirmed solution provided.\n* Users experiencing the problem are advised to update App Installer and configure antivirus software, but these steps may not guarantee success.\n* Further investigation and action from the Pieces development team is likely required.",
          "activity_level": 4.86
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize Pieces OS Performance:** Allocate additional resources to investigate and address the recurring reports of slow performance, unresponsiveness, and conflicts with external applications, especially those related to Ollama and keyboard handlers.",
    "**Improve Extension Compatibility:** Dedicate a team to focus on resolving conflicts between Pieces extensions across different platforms (Chrome, VS Code) to ensure smooth functionality and user experience.",
    "**Enhance Installation and Update Processes:** Review and refine the installation and update procedures for Pieces OS to address issues related to default system settings, update failures, and personal domain management.",
    "**Proactive Communication on Known Issues:** Provide clear and timely communication to users regarding known issues, workarounds, and expected resolution timelines, particularly for high-impact problems like extension conflicts and performance bottlenecks.",
    "**Gather Detailed User Feedback:** Implement mechanisms to collect more comprehensive user feedback on specific issues, including steps to reproduce, system configurations, and error logs, to facilitate faster troubleshooting and resolution.",
    "**Expand Knowledge Base and Troubleshooting Resources:** Enhance the Pieces support website with detailed troubleshooting guides, FAQs, and known issue documentation to empower users to self-resolve common problems.",
    "**Investigate Antivirus False Positives:** Collaborate with antivirus vendors like Kaspersky to address false positive detections of Pieces OS as a virus to prevent unnecessary user concern and installation roadblocks."
  ],
  "message": "Daily support report generated successfully."
}