{
  "success": true,
  "date_range": {
    "start": "2025-06-09T00:00:00+00:00",
    "end": "2025-06-09T05:08:47.332182+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:new",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:linux",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 744,
      "title": "Installation issue in cromebook",
      "activity_level": 4.42
    }
  ],
  "common_issues": [
    {
      "title": "Chromebook Installation Issues",
      "description": "Users experience screen flickering, slow buffering, and unresponsive buttons (e.g., \"Get Started\") during installation on Chromebooks.  Fullscreen mode also causes issues, requiring minimization to regain functionality.  Issue observed on Pieces OS 4.1.4 desktop application.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 744,
          "title": "Installation issue in cromebook",
          "text": "Installation issue in cromebook\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n4.1.4\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nThere are some issues with the Chromebook. When installing core dependencies, the screen flickers, and it takes a long time to buffer. Once loaded, you can't click any buttons, like the \"Get Started\" button. It just gets stuck on that page.\nalso it has issue with full screen you can to anything unless minimize\nError generating summary: 404 Publisher Model `projects/pi3c3s-cloud-server/locations/us-east1/publishers/google/models/gemini-pro` was not found or your project does not have access to it. Please ensure you are using a valid model version. For more information, see: https://cloud.google.com/vertex-ai/generative-ai/docs/learn/model-versions",
          "activity_level": 4.42
        }
      ]
    }
  ],
  "recommendations": [
    "Prioritize resolution of Chromebook installation issues due to high frequency and impact on user experience.",
    "Investigate and address the specific problems reported: screen flickering, slow buffering, unresponsive buttons, and fullscreen mode issues.",
    "Update support documentation and troubleshooting guides with solutions for Chromebook installation problems.",
    "Consider improving the installation process on Chromebooks to prevent these issues from occurring in the future.",
    "Monitor the activity level of related issues to track progress and identify any recurring problems or new issues arising from the fixes implemented.",
    "Proactively communicate known Chromebook installation issues and workarounds to users through relevant channels (e.g., support website, in-app notifications)."
  ],
  "message": "Daily support report generated successfully."
}