{
  "success": true,
  "date_range": {
    "start": "2025-03-17T00:00:00+00:00",
    "end": "2025-03-20T13:11:56.547767+00:00"
  },
  "summary": {
    "total_tickets": 15,
    "resolved_tickets": 3,
    "open_tickets": 12
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 13,
      "resolved": 3,
      "pending": 10
    },
    {
      "category": "os:windows",
      "received": 10,
      "resolved": 2,
      "pending": 8
    },
    {
      "category": "app:desktop application",
      "received": 13,
      "resolved": 3,
      "pending": 10
    },
    {
      "category": "status:triaged",
      "received": 9,
      "resolved": 1,
      "pending": 8
    },
    {
      "category": "app:pieces os",
      "received": 9,
      "resolved": 0,
      "pending": 9
    },
    {
      "category": "os:macos",
      "received": 3,
      "resolved": 1,
      "pending": 2
    },
    {
      "category": "status:resolved",
      "received": 2,
      "resolved": 2,
      "pending": 0
    },
    {
      "category": "status:pending_release",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:new",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "os:linux",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "known_issue",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "duplicate",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "enhancement",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 650,
      "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
      "activity_level": 12.11
    },
    {
      "number": 652,
      "title": "\"Secret Message\" Example doesn't work properly",
      "activity_level": 8.63
    },
    {
      "number": 648,
      "title": "Pieces Desktop not Launching on my Windows PC",
      "activity_level": 7.19
    },
    {
      "number": 537,
      "title": "Ollama Fails to Install on Linux",
      "activity_level": 5.72
    },
    {
      "number": 667,
      "title": "Unable to open Pieces for Developers",
      "activity_level": 5.05
    },
    {
      "number": 672,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 4.74
    },
    {
      "number": 661,
      "title": "Pieces desktop this message is empty please try again",
      "activity_level": 4.74
    },
    {
      "number": 666,
      "title": "Response \"I'll get back to you with my findings as soon as possible\"",
      "activity_level": 4.73
    },
    {
      "number": 315,
      "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
      "activity_level": 4.65
    },
    {
      "number": 658,
      "title": "Personal Domain backup",
      "activity_level": 4.35
    },
    {
      "number": 668,
      "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
      "activity_level": 3.5
    },
    {
      "number": 669,
      "title": "Pieces OS unable to enable LTM",
      "activity_level": 3.48
    },
    {
      "number": 665,
      "title": "Installation doesn't follow the System Apps default location",
      "activity_level": 2.84
    },
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 2.71
    },
    {
      "number": 671,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 2.15
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS High CPU Usage and Slow Performance",
      "description": "Users report high CPU usage and slow performance, especially in web browsers and chat applications, after enabling Long Term Memory. Proposed solutions include updating Pieces OS and web browsers, restarting the LTM service, and moving Pieces folders to a different drive. The Pieces team is actively investigating and releasing patches to address these issues.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 650,
          "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
          "text": "Long Term Memory still slows down my PC, even after updating to LTM-2\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nTurning on Long Term Memory has been slowing down my desktop computer, even before LTM-2. After updating today, it still happens. It's most noticeable when I use Slack and Discord, and disabling those apps on LTM doesn't work. Even after switching the Processing Mode to Cloud, as suggested by HRA42 on the Discord server, the lag still occurs. At some point, the total CPU usage went up by over 90%.\n\n![Image](https://github.com/user-attachments/assets/eaef0d65-b19b-41f0-bf8a-f143fa8d1e43)\n\nMy computer specs:\n- CPU: Intel(R) Core(TM) i3-6300 CPU @ 3.80GHz\n- RAM: DDR4 32 GB\n- Graphics: GeForce GTX 950 2 GB\n\nI'm yet to notice significant slowness on other programs, but if I'm getting a lot of lag on those chat apps, I can imagine I would get them too on something heavier like Visual Studio.\n## Summary of GitHub Issue Conversation\n\n**Problem:** High CPU usage, especially noticeable in web browsers like Microsoft Edge, after enabling Long Term Memory (LTM) 2 in Pieces OS 11.2.2.\n\n**Key points raised:**\n\n* Users reported high CPU usage after enabling LTM2.\n* Discord and WebView2-based applications were particularly affected.\n* The behavior appeared to be influenced by the number of browser tabs open.\n* Some users reported temporary improvement after restarting the LTM service.\n\n**Solutions proposed/implemented:**\n\n* Pieces team released a hotfix and patch for 11.2.2.\n* Users updated Microsoft Edge and WebView2 Runtime to 134.0.3124.51.\n* Some users moved the necessary folders from user profile to another drive via symbolic links.\n\n**Current status/outcome:**\n\n* The issue appears to be resolved for users who updated Microsoft Edge and WebView2 Runtime.\n* Other solutions provide temporary relief or workarounds.\n* Pieces team continues to investigate the issue and plans to release further fixes.\n\n**Additional Notes:**\n\n* The issue involved interaction between multiple applications and may have individual variations\n* Users are encouraged to explore different solutions\n* Pieces team suggests restarting LTM as a temporary fix until a permanent solution is available.",
          "activity_level": 12.11
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @bpluly experienced several issues with the Pieces application, including slow Long Term Memory, failure to launch PiecesOS, and boot-up problems.\n* The user provided details about the issues and expressed their disappointment.\n* The user ultimately uninstalled the application due to a frustrating first experience.\n\n**Problems Identified:**\n\n* The application displayed performance and functionality issues, hindering the user experience.\n* The initial setup and initial launch were problematic for the user.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support responded with a triage message offering resources and a follow-up within 24 hours.\n* They linked to related issues and resources that might be helpful.\n* A request was sent for the user to participate in a debugging call to discuss their experience and troubleshoot the problems.\n\n**Current Status/Outcome:**\n\n* The issue remains open, pending a response from the user regarding the call invitation.\n* The Pieces support team is awaiting further engagement to investigate and resolve the identified issues. \n\n**Additional Notes:**\n\n* This summary is based on the provided conversation excerpt.\n* The overall outcome of the issue resolution remains uncertain as it depends on further interaction and troubleshooting.",
          "activity_level": 3.5
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users reported significant slowdown in Copilot response times after the release of Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The issue appeared to be intermittent and not consistent for all users.\n* The problem was attributed to a bug in the Copilot experience related to clicking \"Hard-Reset Active Runtime\".\n* A fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n\n**Problems Identified:**\n\n* Copilot responses were significantly slower for some users.\n* The issue was not consistent and affected some users more than others.\n* The underlying cause was a bug in the Copilot experience related to the \"Hard-Reset Active Runtime\" feature.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The fix addressed the issue with the \"Hard-Reset Active Runtime\" feature.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for most users with the latest updates to Pieces OS and Pieces Desktop.\n* Some users continued to experience slow response times after the initial fix, with the issue resurfacing after the release of Pieces OS 10.0.3 and Desktop 3.0.2.\n* This issue was addressed by further performance improvements released in Desktop app version 3.1.0.\n\n**Additional Notes:**\n\n* As of November 2023, the reported issues are believed to be resolved.\n* However, new issues may arise in subsequent updates, and users are encouraged to report any problems they encounter.\n\nI hope this summary is helpful! Please let me know if you have any other questions.",
          "activity_level": 4.65
        }
      ]
    },
    {
      "title": "Copilot vague responses and slow performance",
      "description": "Users report Copilot providing vague responses instead of actionable solutions, often claiming it's examining data. This issue appears related to specific interactions or exceeding a certain number of requests. Additionally, users experience slow performance and lag, particularly after updates. Solutions include switching to Gemini 2.0 Flash LLM, restarting Pieces OS, or updating to the latest version with bug fixes.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 666,
          "title": "Response \"I'll get back to you with my findings as soon as possible\"",
          "text": "Response \"I'll get back to you with my findings as soon as possible\"\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n**The Bug**\nThe chat assistant will respond claiming that it's working on a solution and will get back to you at a later date. \n\n**Expected Behaviour**\nGet an actionable response with some suggested action/code.\n\n**Details**\nMost recent example of this kind of response (\"_\" is not part of the response just a redaction):\n\n> \"I'll carefully examine the data flow related to _, _, _, _, and _  to see if any inconsistencies could lead to bugs. Please give me a few minutes to review the code thoroughly with this specific focus in mind. I'll get back to you with my findings as soon as possible.\"\n\nThis has happened in three different conversations. I first noticed the behaviour this month, so not before updates preceding March. I promise I'm not trying to be lazy on this one, it's difficult to offer reproduction steps.\n\nI use Claude 3.5 more than any option regularly.\n\nThe last conversation where this happened:\n\n- I loaded 15 files into the context menu\n- I sent 22 requests (and received 22 responses where it happened on the 22nd response)\n\nI'll update this issue if there's anything I can do to make the reproduction more narrow.\n## Summary of GitHub Issue Conversation\n\n**Key points:**\n\n* User `seantiz` reported a bug where the copilot wasn't responding properly to their questions after sending 11 requests.\n* The bug was not reproducible by the support team.\n* The issue was likely fixed by switching to the Gemini 2.0 Flash LLM.\n\n**Problem identified:**\n\nThe copilot was malfunctioning and not responding to user prompts after a certain number of requests. \n\n**Solutions proposed/implemented:**\n\n* Switching to the Gemini 2.0 Flash LLM.\n\n**Outcome:**\n\nThe bug appears to be fixed with the new LLM. The issue will be monitored and reopened if the problem persists.",
          "activity_level": 4.73
        },
        {
          "id": 652,
          "title": "\"Secret Message\" Example doesn't work properly",
          "text": "\"Secret Message\" Example doesn't work properly\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen using LTM-2 to test the secret message example:\nhttps://pieces.app/magic-moments/ltm\n\nI got a strange response from the LLM:\nClaude 3.5:\nFirst Try:\n![Image](https://github.com/user-attachments/assets/1962a3e4-8b02-4d3f-bc8c-4bdd72c80aa6)\n2. try: (waited longer on the website)\n![Image](https://github.com/user-attachments/assets/cd71c5c1-d5d5-4449-acd5-e070fb244fa9)\n\nGemini 2.0 Flash did fail completely:\n![Image](https://github.com/user-attachments/assets/50735f7a-28a1-4563-b490-e10c271eca23)\n## Summary of GitHub Issue Conversation:\n\n**Key Points Raised:**\n\n* Users @hra42, @joelash, and @bartonfriedland encountered the \"running in basic mode due to device constraints\" error message on M3 MacBooks.\n* This message appeared in the menu item and prevented the proper functioning of secret messages and LTM engine updates.\n* @bartonfriedland also noticed an \"unknown origin\" element with version 1.0.10 in the telemetry browser.\n\n**Problems Identified:**\n\n* The bug caused PiecesOS to enter \"basic mode\" accidentally on M3 MacBooks, even though they support vector search.\n* This mode disabled certain features, including secret messages and LTM engine updates.\n* The cause of the \"unknown origin\" element was unclear.\n\n**Solutions Proposed/Implemented:**\n\n* @mark-at-pieces suggested restarting PiecesOS as a temporary fix.\n* A permanent fix for the \"basic mode\" issue was promised for the next PiecesOS version.\n* Investigating the \"unknown origin\" element was deferred.\n\n**Current Status/Outcome:**\n\n* The \"basic mode\" issue will be fixed in the next PiecesOS update.\n* Users experiencing the issue can use the temporary fix of restarting PiecesOS.\n* The root cause and solution for the \"unknown origin\" element are pending further investigation.\n\n**Additional Notes:**\n\n* The \"Long Term Memory engine makes piecesOs loop reload\" issue (#644) might be related.\n* The issue was automatically routed to the relevant Pieces team member.\n* Resources like existing issues, documentation, and YouTube channel were shared for the user's reference.\n* @mark-at-pieces offered to elaborate on \"basic mode\" if desired.",
          "activity_level": 8.63
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users reported significant slowdown in Copilot response times after the release of Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The issue appeared to be intermittent and not consistent for all users.\n* The problem was attributed to a bug in the Copilot experience related to clicking \"Hard-Reset Active Runtime\".\n* A fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n\n**Problems Identified:**\n\n* Copilot responses were significantly slower for some users.\n* The issue was not consistent and affected some users more than others.\n* The underlying cause was a bug in the Copilot experience related to the \"Hard-Reset Active Runtime\" feature.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The fix addressed the issue with the \"Hard-Reset Active Runtime\" feature.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for most users with the latest updates to Pieces OS and Pieces Desktop.\n* Some users continued to experience slow response times after the initial fix, with the issue resurfacing after the release of Pieces OS 10.0.3 and Desktop 3.0.2.\n* This issue was addressed by further performance improvements released in Desktop app version 3.1.0.\n\n**Additional Notes:**\n\n* As of November 2023, the reported issues are believed to be resolved.\n* However, new issues may arise in subsequent updates, and users are encouraged to report any problems they encounter.\n\nI hope this summary is helpful! Please let me know if you have any other questions.",
          "activity_level": 4.65
        }
      ]
    },
    {
      "title": "Pieces Desktop and OS Installation and Launch Issues",
      "description": "Users report problems installing, launching, and connecting Pieces Desktop and OS. Issues include application crashes, freezing during launch, and high CPU usage. Troubleshooting steps involve checking log files, reinstalling the application, and replacing corrupted folders. Pieces team offers support through debugging calls and investigates potential software bugs.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 658,
          "title": "Personal Domain backup",
          "text": "Personal Domain backup\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [x] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI want to sync this PC to another PC，but i cann't backup the lastest data.\n![Image](https://github.com/user-attachments/assets/bfb4fb14-5e7f-45c7-828f-5f77f550453a)\n\nthis is another PC\n\n![Image](https://github.com/user-attachments/assets/3c2d880e-a1b2-40c1-82b1-9935bffbf8fb)\n## Conversation Summary:\n\n**Key Points:**\n\n* User `laborer123` is having trouble registering a personal domain and restoring a backup on a new computer.\n* User transferred `com.pieces.os` and `com.pieces.pfd` folders from the old computer to the new one.\n* The user is unable to change the personal domain and the current backup is outdated.\n\n**Problems Identified:**\n\n* User is unable to register a personal domain because it's already taken.\n* The user cannot restore a backup due to the outdated version and lack of new backups.\n* It's unclear if the user wants to create a new backup with their existing domain or transfer the existing personal domain to a new computer.\n\n**Solutions Proposed/Implemented:**\n\n* Mark from the Pieces team suggested trying to register a new domain to ensure the functionality.\n* A screenshot of the \"Restore\" button was provided.\n* Mark offered a scheduled call to assist the user with backup and restore issues.\n\n**Current Status/Outcome:**\n\n* The issue remains open, as the user's backup concerns and ability to create a new backup with the existing domain require further clarification and assistance.\n*  Mark's offer for a scheduled call remains pending.",
          "activity_level": 4.35
        },
        {
          "id": 648,
          "title": "Pieces Desktop not Launching on my Windows PC",
          "text": "Pieces Desktop not Launching on my Windows PC\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows 11 Home, 24H2\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nMy Pieces Desktop application has refused to launch since updating it to the latest version (v4.0.0). It's stuck in the \"Ensure Core Dependencies\" loading state even though I have Pieces OS already running successfully in the background. Kindly find screenshots below. \n\nI've tried force quitting both Pieces OS & Pieces Desktop from my Task Manager, uninstalling and re-installing Pieces Desktop, and restarting my PC, all to no avail. Any help would be highly appreciated, thank you!\n\n![Image](https://github.com/user-attachments/assets/22c14a42-29d6-4a1f-ab34-51ba5074b38e)\n\n![Image](https://github.com/user-attachments/assets/025d2e80-78be-480c-9cc2-a85a440dcf75)\n\n![Image](https://github.com/user-attachments/assets/48c76dde-307a-4451-b85f-0483b74c2321)\n## Summary of GitHub Issue Conversation:\n\n**Problem:** MoyinShabi is having trouble connecting Pieces for Developers to PiecesOS. \n\n**Key points:**\n\n* The issue started after a recent update.\n* MoyinShabi is unable to launch the app.\n* No health check notifications were received.\n* The issue seems to be related to the desktop app's database.\n\n**Solutions proposed/implemented:**\n\n* Log files were requested and analyzed.\n* The \"com.pieces.pfd\" folder was replaced with a repaired version.\n* A GetIt package dependency issue was identified.\n\n**Current status/outcome:**\n\n* The problem is still not fully resolved.\n* A video call is scheduled to troubleshoot the issue further.\n\n**Additional notes:**\n\n* The issue appears to be complex and requires further investigation.\n* The user is actively engaged in troubleshooting with the Pieces team.\n* The issue is being treated with urgency.",
          "activity_level": 7.19
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @bpluly experienced several issues with the Pieces application, including slow Long Term Memory, failure to launch PiecesOS, and boot-up problems.\n* The user provided details about the issues and expressed their disappointment.\n* The user ultimately uninstalled the application due to a frustrating first experience.\n\n**Problems Identified:**\n\n* The application displayed performance and functionality issues, hindering the user experience.\n* The initial setup and initial launch were problematic for the user.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support responded with a triage message offering resources and a follow-up within 24 hours.\n* They linked to related issues and resources that might be helpful.\n* A request was sent for the user to participate in a debugging call to discuss their experience and troubleshoot the problems.\n\n**Current Status/Outcome:**\n\n* The issue remains open, pending a response from the user regarding the call invitation.\n* The Pieces support team is awaiting further engagement to investigate and resolve the identified issues. \n\n**Additional Notes:**\n\n* This summary is based on the provided conversation excerpt.\n* The overall outcome of the issue resolution remains uncertain as it depends on further interaction and troubleshooting.",
          "activity_level": 3.5
        }
      ]
    },
    {
      "title": "Pieces Desktop App Performance Issues",
      "description": "Users reported slow performance, lagging, and unresponsiveness in the Pieces Desktop app, particularly with Copilot chat. Issues were often linked to specific app versions or features like \"Hard-Reset Active Runtime.\" Solutions included bug fixes and performance improvements in subsequent updates.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Users reported significant slowdown in Copilot response times after the release of Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The issue appeared to be intermittent and not consistent for all users.\n* The problem was attributed to a bug in the Copilot experience related to clicking \"Hard-Reset Active Runtime\".\n* A fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n\n**Problems Identified:**\n\n* Copilot responses were significantly slower for some users.\n* The issue was not consistent and affected some users more than others.\n* The underlying cause was a bug in the Copilot experience related to the \"Hard-Reset Active Runtime\" feature.\n\n**Solutions Proposed/Implemented:**\n\n* A bug fix was implemented and released in a patch for Pieces OS 10.0.2 & Pieces Desktop 3.0.2.\n* The fix addressed the issue with the \"Hard-Reset Active Runtime\" feature.\n\n**Current Status/Outcome:**\n\n* The issue appears to be resolved for most users with the latest updates to Pieces OS and Pieces Desktop.\n* Some users continued to experience slow response times after the initial fix, with the issue resurfacing after the release of Pieces OS 10.0.3 and Desktop 3.0.2.\n* This issue was addressed by further performance improvements released in Desktop app version 3.1.0.\n\n**Additional Notes:**\n\n* As of November 2023, the reported issues are believed to be resolved.\n* However, new issues may arise in subsequent updates, and users are encouraged to report any problems they encounter.\n\nI hope this summary is helpful! Please let me know if you have any other questions.",
          "activity_level": 4.65
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @bpluly experienced several issues with the Pieces application, including slow Long Term Memory, failure to launch PiecesOS, and boot-up problems.\n* The user provided details about the issues and expressed their disappointment.\n* The user ultimately uninstalled the application due to a frustrating first experience.\n\n**Problems Identified:**\n\n* The application displayed performance and functionality issues, hindering the user experience.\n* The initial setup and initial launch were problematic for the user.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support responded with a triage message offering resources and a follow-up within 24 hours.\n* They linked to related issues and resources that might be helpful.\n* A request was sent for the user to participate in a debugging call to discuss their experience and troubleshoot the problems.\n\n**Current Status/Outcome:**\n\n* The issue remains open, pending a response from the user regarding the call invitation.\n* The Pieces support team is awaiting further engagement to investigate and resolve the identified issues. \n\n**Additional Notes:**\n\n* This summary is based on the provided conversation excerpt.\n* The overall outcome of the issue resolution remains uncertain as it depends on further interaction and troubleshooting.",
          "activity_level": 3.5
        },
        {
          "id": 661,
          "title": "Pieces desktop this message is empty please try again",
          "text": "Pieces desktop this message is empty please try again\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPieces for Developers 4.0.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen copy paste code sencond time in Ask anything give error  this message is empty please try again\n## Summary of GitHub Issue Conversation:\n\n**Key Points:**\n\n* Users reported errors on the \"Pieces\" desktop app (Windows and Mac) after updating to the latest version.\n* The error message displayed was \"show error pieces desktop\".\n* This issue prevented users from sending messages in chat.\n\n**Problems Identified:**\n\n* Bug in the latest \"Pieces\" desktop app update.\n* The bug affected users across different platforms (Windows and Mac).\n\n**Solutions Proposed/Implemented:**\n\n* The \"Pieces\" team developed a patch release to address the bug.\n* The patch release was announced publicly on GitHub.\n\n**Current Status/Outcome:**\n\n* The patch release was deployed and resolved the \"show error pieces desktop\" issue.\n* Users confirmed that the problem was solved after installing the patch release.\n\n**Additional Notes:**\n\n* The \"Pieces\" team provided links to additional resources in the meantime while the team worked on implementing a fix.\n* The issue was triaged and routed to the appropriate team member within 24 hours of being reported.\n\n**Overall, the conversation highlights the importance of open communication and collaboration between developers and users. The prompt resolution of the issue demonstrates the \"Pieces\" team's commitment to providing a bug-free and user-friendly experience.**",
          "activity_level": 4.74
        }
      ]
    },
    {
      "title": "Pieces OS Installation and Feature Issues",
      "description": "Users report various issues with Pieces OS, including installation failures due to missing dependencies, high CPU usage leading to system unresponsiveness, and difficulties enabling the Long Term Memory (LTM) feature. Proposed solutions involve adding missing dependencies to the installation package, optimizing resource management, and ensuring proper permissions for LTM activation.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 537,
          "title": "Ollama Fails to Install on Linux",
          "text": "Ollama Fails to Install on Linux\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nUser reports immediate \"Ollama failed to install\" diaglog upon clicking install Ollama install button in Pieces desktop app\n## Summary of GitHub Issue Conversation\n\n**Issue:** Ollama installation fails due to missing `curl` in the Pieces-OS snap sandbox.\n\n**Key Points:**\n\n- The issue was first reported in December 2024 with the `curl` program being absent in the Pieces-OS snap sandbox environment.\n- Installing Ollama manually didn't resolve the problem because the sandbox restricts access to external programs.\n\n**Problems Identified:**\n\n- Ollama installation fails due to missing `curl`.\n- This issue impacts both downloading and inference of local LLM models.\n\n**Solutions Proposed/Implemented:**\n\n- Adding `curl` to the Pieces-OS snap definition file.\n- Implementing a solution that allows Ollama to run within the sandbox environment.\n\n**Current Status/Outcome:**\n\n- The issue has been acknowledged by the Pieces team and a fix is currently under development.\n- As of March 2025, the fix is not yet available. \n\n**Additional Information:**\n\n- Users are awaiting the fix, expressing concerns about data privacy when using cloud LLMs.\n- The issue remains open as of March 2025.",
          "activity_level": 5.72
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* User @bpluly experienced several issues with the Pieces application, including slow Long Term Memory, failure to launch PiecesOS, and boot-up problems.\n* The user provided details about the issues and expressed their disappointment.\n* The user ultimately uninstalled the application due to a frustrating first experience.\n\n**Problems Identified:**\n\n* The application displayed performance and functionality issues, hindering the user experience.\n* The initial setup and initial launch were problematic for the user.\n\n**Solutions Proposed/Implemented:**\n\n* Pieces support responded with a triage message offering resources and a follow-up within 24 hours.\n* They linked to related issues and resources that might be helpful.\n* A request was sent for the user to participate in a debugging call to discuss their experience and troubleshoot the problems.\n\n**Current Status/Outcome:**\n\n* The issue remains open, pending a response from the user regarding the call invitation.\n* The Pieces support team is awaiting further engagement to investigate and resolve the identified issues. \n\n**Additional Notes:**\n\n* This summary is based on the provided conversation excerpt.\n* The overall outcome of the issue resolution remains uncertain as it depends on further interaction and troubleshooting.",
          "activity_level": 3.5
        },
        {
          "id": 669,
          "title": "Pieces OS unable to enable LTM",
          "text": "Pieces OS unable to enable LTM\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nPieces OS\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen attempting to enable the LTM engine, either in the Pieces desktop app by clicking \"Allow\" for \"Periodic Application Indexing\" or in the Pieces OS directly, clicking \"Enable Long Term Memory Engine\", nothing happens. Even after multiple Pieces OS restarts and a clean install. \n\nTailed the local log while doing both operations, only clicking \"Enable Long Term Memory Engine\" resulted in logs:\n```\n[D]  Sentry Error Event: 351d4b13dbae46589cabd593569f9049\n```\n\n[piecesOS-03162025log.txt](https://github.com/user-attachments/files/19275571/piecesOS-03162025log.txt)\nAlso confirmed permissions were granted appropriately:\n![Image](https://github.com/user-attachments/assets/2fa7002e-0c18-46fe-abaf-288350a90b1b)\n\nLoop in Detail:\n\nhttps://github.com/user-attachments/assets/c964a15d-2307-4d83-a9f8-0d82d7b608b8\n\nI can reproduce quickly and easily if you need more details/fresh logs!\n## GitHub Issue Summary: LTM Activation Issue\n\n**Key Points:**\n\n* User (@kwburgess) is unable to activate the Long Term Memory (LTM) feature in PiecesOS.\n* The issue appears to be related to permissioning on the user's local machine.\n\n**Problems Identified:**\n\n* PiecesOS may not have the necessary permissions for screen & system recording and accessibility.\n\n**Solutions Proposed/Implemented:**\n\n* @mark-at-pieces suggests confirming permission settings and provides images for reference.\n* An alternative solution is offered: scheduling a real-time meeting via the provided calendar link.\n\n**Current Status/Outcome:**\n\n* The issue is still open. It's unclear whether the user has confirmed the permission settings or scheduled a meeting. \n\n**Additional Notes:**\n\n* The conversation also includes links to related issues and helpful resources.",
          "activity_level": 3.48
        }
      ]
    }
  ],
  "recommendations": [
    "**Prioritize resolving high-frequency issues:** Focus on addressing the \"Pieces OS High CPU Usage and Slow Performance\", \"Copilot vague responses and slow performance\", \"Pieces Desktop and OS Installation and Launch Issues\", \"Pieces Desktop App Performance Issues\", and \"Pieces OS Installation and Feature Issues\" as they represent the bulk of support tickets.",
    "**Investigate and address root causes:**  For recurring issues like slow performance and installation problems, allocate resources to identify and fix the underlying causes rather than just addressing symptoms.",
    "**Improve installation and launch experience:** Given the prevalence of installation and launch issues, dedicate resources to streamline the process, potentially including dependency checks and clearer error messaging.",
    "**Enhance Copilot performance and response quality:** Address concerns about Copilot's speed and the vagueness of its responses. This might involve optimizing its algorithms or providing clearer guidance on its capabilities.",
    "**Review LTM implementation:** Given the performance issues and activation problems related to Long Term Memory, conduct a thorough review of its implementation to improve resource management and user experience.",
    "**Proactively monitor system performance:** Implement monitoring tools to detect performance issues in real-time, allowing for quicker identification and resolution of problems like high CPU usage.",
    "**Improve communication about known issues:**  Maintain a clear and updated list of known issues to keep users informed and reduce support tickets related to already identified problems.",
    "**Develop more comprehensive troubleshooting resources:** Create detailed troubleshooting guides and FAQs to empower users to resolve common issues independently.",
    "**Consider user feedback:** Analyze support tickets and user feedback for patterns and suggestions that can inform product improvements and support strategies.",
    "**Offer personalized support options:** For complex issues, provide options for personalized support, such as debugging calls, to ensure effective resolution and improve user satisfaction."
  ],
  "message": "Daily support report generated successfully."
}