{
  "success": true,
  "date_range": {
    "start": "2025-03-17T00:00:00+00:00",
    "end": "2025-03-23T21:06:17.869831+00:00"
  },
  "summary": {
    "total_tickets": 18,
    "resolved_tickets": 5,
    "open_tickets": 13
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 16,
      "resolved": 5,
      "pending": 11
    },
    {
      "category": "on the roadmap",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:desktop application",
      "received": 16,
      "resolved": 4,
      "pending": 12
    },
    {
      "category": "app:pieces os",
      "received": 10,
      "resolved": 2,
      "pending": 8
    },
    {
      "category": "P0",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "app:sharing web app",
      "received": 1,
      "resolved": 1,
      "pending": 0
    },
    {
      "category": "os:windows",
      "received": 10,
      "resolved": 2,
      "pending": 8
    },
    {
      "category": "status:triaged",
      "received": 9,
      "resolved": 2,
      "pending": 7
    },
    {
      "category": "status:waiting_on_user_responses",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:macos",
      "received": 4,
      "resolved": 2,
      "pending": 2
    },
    {
      "category": "status:pending_release",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "status:resolved",
      "received": 2,
      "resolved": 2,
      "pending": 0
    },
    {
      "category": "status:new",
      "received": 2,
      "resolved": 1,
      "pending": 1
    },
    {
      "category": "os:linux",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "known_issue",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "duplicate",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "enhancement",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 650,
      "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
      "activity_level": 12.67
    },
    {
      "number": 652,
      "title": "\"Secret Message\" Example doesn't work properly",
      "activity_level": 10.02
    },
    {
      "number": 648,
      "title": "Pieces Desktop not Launching on my Windows PC",
      "activity_level": 6.28
    },
    {
      "number": 537,
      "title": "Ollama Fails to Install on Linux",
      "activity_level": 5.37
    },
    {
      "number": 315,
      "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
      "activity_level": 4.39
    },
    {
      "number": 443,
      "title": "Unable to generate personal shareable links for 6+ months",
      "activity_level": 3.93
    },
    {
      "number": 667,
      "title": "Unable to open Pieces for Developers",
      "activity_level": 3.91
    },
    {
      "number": 661,
      "title": "Pieces desktop this message is empty please try again",
      "activity_level": 3.84
    },
    {
      "number": 658,
      "title": "Personal Domain backup",
      "activity_level": 3.6
    },
    {
      "number": 666,
      "title": "Response \"I'll get back to you with my findings as soon as possible\"",
      "activity_level": 3.51
    },
    {
      "number": 672,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 3.47
    },
    {
      "number": 677,
      "title": "Personal cloud connects itself after shutdown and start of app",
      "activity_level": 3.01
    },
    {
      "number": 669,
      "title": "Pieces OS unable to enable LTM",
      "activity_level": 2.84
    },
    {
      "number": 668,
      "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
      "activity_level": 2.37
    },
    {
      "number": 665,
      "title": "Installation doesn't follow the System Apps default location",
      "activity_level": 1.89
    },
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 1.84
    },
    {
      "number": 459,
      "title": "Bug: unable to cancel the download of an LLLM",
      "activity_level": 1.79
    },
    {
      "number": 671,
      "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
      "activity_level": 1.58
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS High CPU Usage and Performance Issues",
      "description": "Users report high CPU usage, slow performance, and lagging, primarily with Long Term Memory (LTM) feature. Issues persist across different hardware and OS versions. Temporary solutions include disabling LTM or moving Pieces folders to a separate drive. Pieces OS v11.2.3 reportedly resolves the issue for most users.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 650,
          "title": "Long Term Memory still slows down my PC, even after updating to LTM-2",
          "text": "Long Term Memory still slows down my PC, even after updating to LTM-2\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nTurning on Long Term Memory has been slowing down my desktop computer, even before LTM-2. After updating today, it still happens. It's most noticeable when I use Slack and Discord, and disabling those apps on LTM doesn't work. Even after switching the Processing Mode to Cloud, as suggested by HRA42 on the Discord server, the lag still occurs. At some point, the total CPU usage went up by over 90%.\n\n![Image](https://github.com/user-attachments/assets/eaef0d65-b19b-41f0-bf8a-f143fa8d1e43)\n\nMy computer specs:\n- CPU: Intel(R) Core(TM) i3-6300 CPU @ 3.80GHz\n- RAM: DDR4 32 GB\n- Graphics: GeForce GTX 950 2 GB\n\nI'm yet to notice significant slowness on other programs, but if I'm getting a lot of lag on those chat apps, I can imagine I would get them too on something heavier like Visual Studio.\n## Summary of GitHub Issue Conversation: High CPU Usage in Pieces OS\n\n**Key Points Raised:**\n\n* High CPU usage issues reported by multiple users on different hardware and OS versions (Windows 10, 11, and Linux Mint 22.1).\n* The Long-Term Memory (LTM2) feature seems to be heavily involved in the issue.\n* Discord and Microsoft Edge are particularly affected.\n* Users are experiencing lagging, freezing, and high fan noise.\n\n**Problems Identified:**\n\n* High and constant CPU usage, reaching up to 100% in some cases.\n* Significant impact on performance, making it difficult to use affected applications.\n* The issue persisted even after LTM2 updates and hotfixes.\n\n**Solutions Proposed/Implemented:**\n\n* Patch releases for Pieces OS were deployed to address the issue.\n* Turning off LTM2 temporarily was reported to alleviate the problem temporarily for some users.\n* Moving relevant folders from the user profile to a separate drive with a different file system (ReFS) was found to improve performance significantly for one user.\n\n**Current Status/Outcome:**\n\n* As of March 22, 2025, the issue has been resolved with the release of Pieces OS v11.2.3. This version appears to stabilize CPU usage and significantly improve performance, particularly for users experiencing issues with LTM2.\n\n**Additional Notes:**\n\n* Further investigation is ongoing to determine the root cause of the excessive CPU usage.\n* The issue primarily affects users with large numbers of open tabs and applications.\n* The use of WebView2 and LTM2 features seems to be a contributing factor.",
          "activity_level": 12.67
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Author:** bpluly (user)\n\n**Date:** March 14, 2025\n\n**Issue:** The user experienced various problems with the Pieces application, including:\n* Slowdowns with Long-Term Memory\n* Difficulty launching PiecesOS\n* Issues booting up PiecesOS\n\n**Resources Provided:** The bot suggested related issues, documentation, and support channels.\n\n**Response from Pieces Support Team:**\n\n* **March 18, 2025:** Mark from Pieces reached out, acknowledging the user's frustration and offering assistance.\n* They proposed a call to discuss the issues and troubleshoot the problems.\n* A link to Mark's calendar was provided for scheduling the call.\n\n**Current Status:**\n\n* User's response to the proposal is not included in the conversation.\n* It's unclear whether the user scheduled the call or not.",
          "activity_level": 2.37
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* Copilot response time was significantly slower than expected.\n* Hard-resetting the active runtime did not resolve the issue.\n* High CPU usage and blocked responses were reported.\n* Context files were not being read, even when specified.\n* The issue persisted after updates to Pieces OS 10.0.3 and Desktop application version 3.0.2.\n\n**Problems Identified:**\n\n* A bug in the copilot experience prevented the websocket from properly re-initializing after a hard-reset.\n* The updates to Pieces OS and Desktop application may have introduced new performance issues.\n\n**Solutions Proposed/Implemented:**\n\n* A fix for the bug was implemented and released in a patch.\n* Pieces Desktop application version 3.1.0 was released with significant performance improvements.\n\n**Current Status/Outcome:**\n\n* The performance issues with the copilot were resolved for most users after the release of version 3.1.0 of the Desktop app.\n* There may still be some users experiencing lag, especially those with older hardware or insufficient RAM.\n\n**Additional Notes:**\n\n* The issue was reported by multiple users, indicating it was a widespread problem.\n* The Pieces team was responsive in addressing the issue and providing updates.\n* Some users may still require technical assistance to resolve the issue.\n\n**Next Steps:**\n\n* Users experiencing continued lag should provide details about their system to the Pieces team for further investigation.\n* The Pieces team should continue to monitor the situation and address any additional issues that arise.",
          "activity_level": 4.39
        }
      ]
    },
    {
      "title": "Pieces Copilot Slow or Unresponsive",
      "description": "Users report Pieces Copilot becoming slow, unresponsive, or failing to provide expected code suggestions. This occurs across macOS and Windows, potentially due to bugs in LLM integration or resource constraints. Updating to the latest Pieces OS and Desktop application versions, restarting the application, or hard-resetting the runtime are suggested workarounds. The Pieces team actively addresses these issues with patches and updates.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 666,
          "title": "Response \"I'll get back to you with my findings as soon as possible\"",
          "text": "Response \"I'll get back to you with my findings as soon as possible\"\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n**The Bug**\nThe chat assistant will respond claiming that it's working on a solution and will get back to you at a later date. \n\n**Expected Behaviour**\nGet an actionable response with some suggested action/code.\n\n**Details**\nMost recent example of this kind of response (\"_\" is not part of the response just a redaction):\n\n> \"I'll carefully examine the data flow related to _, _, _, _, and _  to see if any inconsistencies could lead to bugs. Please give me a few minutes to review the code thoroughly with this specific focus in mind. I'll get back to you with my findings as soon as possible.\"\n\nThis has happened in three different conversations. I first noticed the behaviour this month, so not before updates preceding March. I promise I'm not trying to be lazy on this one, it's difficult to offer reproduction steps.\n\nI use Claude 3.5 more than any option regularly.\n\nThe last conversation where this happened:\n\n- I loaded 15 files into the context menu\n- I sent 22 requests (and received 22 responses where it happened on the 22nd response)\n\nI'll update this issue if there's anything I can do to make the reproduction more narrow.\n## GitHub Issue Summary\n\n**Key Points Raised:**\n\n* @seantiz encountered an issue where the co-pilot doesn't respond properly after exceeding a certain number of requests and responses.\n* The issue does not replicate when using the Gemini 2.0 Flash LLM.\n\n**Problems Identified:**\n\n* The co-pilot malfunctions after a certain number of requests and responses.\n* This could be due to a limitation of the LLM or a bug in the system.\n\n**Solutions Proposed/Implemented:**\n\n* Switching to the Gemini 2.0 Flash LLM resolves the issue.\n\n**Current Status/Outcome:**\n\n* The issue is believed to be fixed with the Gemini 2.0 Flash LLM.\n* The issue will be monitored and the user will be notified if it resurfaces.\n\n**Additional Notes:**\n\n* This issue is similar to issue #652, \"Secret Message\" Example doesn't work properly.\n* The user is encouraged to check the documentation and YouTube channel for further assistance.",
          "activity_level": 3.51
        },
        {
          "id": 652,
          "title": "\"Secret Message\" Example doesn't work properly",
          "text": "\"Secret Message\" Example doesn't work properly\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen using LTM-2 to test the secret message example:\nhttps://pieces.app/magic-moments/ltm\n\nI got a strange response from the LLM:\nClaude 3.5:\nFirst Try:\n![Image](https://github.com/user-attachments/assets/1962a3e4-8b02-4d3f-bc8c-4bdd72c80aa6)\n2. try: (waited longer on the website)\n![Image](https://github.com/user-attachments/assets/cd71c5c1-d5d5-4449-acd5-e070fb244fa9)\n\nGemini 2.0 Flash did fail completely:\n![Image](https://github.com/user-attachments/assets/50735f7a-28a1-4563-b490-e10c271eca23)\n## Summary of GitHub issue conversation:\n\n**Key points raised:**\n\n* M3 mac users are encountering \"basic mode due to device constraints\" error message in PiecesOS.\n* This error prevents some functionalities, like Workstream Activity and LTM updates, from working properly.\n* The error seems to be triggered due to a bug in PiecesOS.\n\n**Problems identified:**\n\n* The \"basic mode\" bug affects M3 Mac users and impacts their experience with PiecesOS features.\n* Users are not able to access Workstream Activity and LTM updates.\n* The presence of an \"unknown origin\" application (version 1.0.10) raises concerns.\n\n**Solutions proposed/implemented:**\n\n* Mark-at-pieces suggests restarting PiecesOS as a temporary workaround. \n* A fix for the \"basic mode\" bug will be implemented in the next PiecesOS version. \n* Mack-at-pieces is looking into the issue of missing Workstream Activity and LTM updates. \n* They're investigating the \"unknown origin\" application.\n\n**Current status/outcome:**\n\n* The \"basic mode\" bug fix will be released soon.\n* Mack-at-pieces is investigating the remaining issues reported by Bartonfriedland.\n* The cause of the \"unknown origin\" application needs further investigation.\n\n**Additional notes:**\n\n* The \"basic mode\" error seems to be related to vector search support on M3 Macs.\n* Bartonfriedland's feedback about the Workstream Activity menu issue will be considered for improvement.\n* The user's previous experimentations with Pieces extensions might explain the \"unknown origin\" application, but further confirmation is needed.",
          "activity_level": 10.02
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* Copilot response time was significantly slower than expected.\n* Hard-resetting the active runtime did not resolve the issue.\n* High CPU usage and blocked responses were reported.\n* Context files were not being read, even when specified.\n* The issue persisted after updates to Pieces OS 10.0.3 and Desktop application version 3.0.2.\n\n**Problems Identified:**\n\n* A bug in the copilot experience prevented the websocket from properly re-initializing after a hard-reset.\n* The updates to Pieces OS and Desktop application may have introduced new performance issues.\n\n**Solutions Proposed/Implemented:**\n\n* A fix for the bug was implemented and released in a patch.\n* Pieces Desktop application version 3.1.0 was released with significant performance improvements.\n\n**Current Status/Outcome:**\n\n* The performance issues with the copilot were resolved for most users after the release of version 3.1.0 of the Desktop app.\n* There may still be some users experiencing lag, especially those with older hardware or insufficient RAM.\n\n**Additional Notes:**\n\n* The issue was reported by multiple users, indicating it was a widespread problem.\n* The Pieces team was responsive in addressing the issue and providing updates.\n* Some users may still require technical assistance to resolve the issue.\n\n**Next Steps:**\n\n* Users experiencing continued lag should provide details about their system to the Pieces team for further investigation.\n* The Pieces team should continue to monitor the situation and address any additional issues that arise.",
          "activity_level": 4.39
        }
      ]
    },
    {
      "title": "Pieces OS Functionality Issues and Errors",
      "description": "Users are experiencing various issues with Pieces OS, including problems enabling Long Term Memory (LTM), unexpected errors with specific LLM responses, and performance problems leading to system unresponsiveness.  Solutions vary depending on the specific issue, but often involve checking permissions, restarting Pieces OS, or waiting for a bug fix in a future release.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 669,
          "title": "Pieces OS unable to enable LTM",
          "text": "Pieces OS unable to enable LTM\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nPieces OS\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.2\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen attempting to enable the LTM engine, either in the Pieces desktop app by clicking \"Allow\" for \"Periodic Application Indexing\" or in the Pieces OS directly, clicking \"Enable Long Term Memory Engine\", nothing happens. Even after multiple Pieces OS restarts and a clean install. \n\nTailed the local log while doing both operations, only clicking \"Enable Long Term Memory Engine\" resulted in logs:\n```\n[D]  Sentry Error Event: 351d4b13dbae46589cabd593569f9049\n```\n\n[piecesOS-03162025log.txt](https://github.com/user-attachments/files/19275571/piecesOS-03162025log.txt)\nAlso confirmed permissions were granted appropriately:\n![Image](https://github.com/user-attachments/assets/2fa7002e-0c18-46fe-abaf-288350a90b1b)\n\nLoop in Detail:\n\nhttps://github.com/user-attachments/assets/c964a15d-2307-4d83-a9f8-0d82d7b608b8\n\nI can reproduce quickly and easily if you need more details/fresh logs!\n## Summary of GitHub Issue Conversation\n\n**Key Points:**\n\n* Kwburgess reported an issue with activating the Long Term Memory (LTM) engine in PiecesOS.\n* The issue was automatically triaged and routed to the Pieces support team.\n* Kwburgess was provided with related issues and helpful resources.\n* Mark-at-pieces identified the issue as a permission problem and requested confirmation of specific permissions.\n* Kwburgess confirmed the issue and thanked Mark-at-pieces for the assistance.\n\n**Problems Identified:**\n\n* LTM engine activation issue.\n* Missing permissions for PiecesOS on the user's machine.\n\n**Solutions Proposed/Implemented:**\n\n* Mark-at-pieces requested confirmation of specific permissions for PiecesOS.\n* Kwburgess confirmed the missing permissions and resolved the issue.\n\n**Current Status/Outcome:**\n\n* The issue was resolved by confirming and enabling the necessary permissions.",
          "activity_level": 2.84
        },
        {
          "id": 652,
          "title": "\"Secret Message\" Example doesn't work properly",
          "text": "\"Secret Message\" Example doesn't work properly\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\n11.2.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nWhen using LTM-2 to test the secret message example:\nhttps://pieces.app/magic-moments/ltm\n\nI got a strange response from the LLM:\nClaude 3.5:\nFirst Try:\n![Image](https://github.com/user-attachments/assets/1962a3e4-8b02-4d3f-bc8c-4bdd72c80aa6)\n2. try: (waited longer on the website)\n![Image](https://github.com/user-attachments/assets/cd71c5c1-d5d5-4449-acd5-e070fb244fa9)\n\nGemini 2.0 Flash did fail completely:\n![Image](https://github.com/user-attachments/assets/50735f7a-28a1-4563-b490-e10c271eca23)\n## Summary of GitHub issue conversation:\n\n**Key points raised:**\n\n* M3 mac users are encountering \"basic mode due to device constraints\" error message in PiecesOS.\n* This error prevents some functionalities, like Workstream Activity and LTM updates, from working properly.\n* The error seems to be triggered due to a bug in PiecesOS.\n\n**Problems identified:**\n\n* The \"basic mode\" bug affects M3 Mac users and impacts their experience with PiecesOS features.\n* Users are not able to access Workstream Activity and LTM updates.\n* The presence of an \"unknown origin\" application (version 1.0.10) raises concerns.\n\n**Solutions proposed/implemented:**\n\n* Mark-at-pieces suggests restarting PiecesOS as a temporary workaround. \n* A fix for the \"basic mode\" bug will be implemented in the next PiecesOS version. \n* Mack-at-pieces is looking into the issue of missing Workstream Activity and LTM updates. \n* They're investigating the \"unknown origin\" application.\n\n**Current status/outcome:**\n\n* The \"basic mode\" bug fix will be released soon.\n* Mack-at-pieces is investigating the remaining issues reported by Bartonfriedland.\n* The cause of the \"unknown origin\" application needs further investigation.\n\n**Additional notes:**\n\n* The \"basic mode\" error seems to be related to vector search support on M3 Macs.\n* Bartonfriedland's feedback about the Workstream Activity menu issue will be considered for improvement.\n* The user's previous experimentations with Pieces extensions might explain the \"unknown origin\" application, but further confirmation is needed.",
          "activity_level": 10.02
        },
        {
          "id": 668,
          "title": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive",
          "text": "Pieces stuck on 70% CPU on one processor interfering with other keyboard chain handlers. System became unresponsive\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nCurrent\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nA specific keyboard chain handler that was affected and incapacitated was zvirtualDesktop which has been in use for several years and behaves well with other handlers.\n\nEventually I was able to kill the Pieces OS instance but as I didn''t know what, if any, other effects there had been I restarted the machine. In logging in the MS new machine set of dialogs started, it evidently believed that this was the first run. I restarted again and so far the machine is working normally.\n\nI uninstalled the Pieces OS and Pieces Desktop before the initial reboot. It's possible there was a dirty Registry on the first restart as it was a warm restart.\n\nI do not believe that this product is suitable for public use without a considerable warning that there may be trouble ahead. As it is I don't think it's a product ready for market given the other points I've observed, (the inability to install it to other than the boot drive, the lack of information or control of where data is stored and so on.\n## Summary of GitHub Issue Conversation\n\n**Author:** bpluly (user)\n\n**Date:** March 14, 2025\n\n**Issue:** The user experienced various problems with the Pieces application, including:\n* Slowdowns with Long-Term Memory\n* Difficulty launching PiecesOS\n* Issues booting up PiecesOS\n\n**Resources Provided:** The bot suggested related issues, documentation, and support channels.\n\n**Response from Pieces Support Team:**\n\n* **March 18, 2025:** Mark from Pieces reached out, acknowledging the user's frustration and offering assistance.\n* They proposed a call to discuss the issues and troubleshoot the problems.\n* A link to Mark's calendar was provided for scheduling the call.\n\n**Current Status:**\n\n* User's response to the proposal is not included in the conversation.\n* It's unclear whether the user scheduled the call or not.",
          "activity_level": 2.37
        }
      ]
    },
    {
      "title": "Pieces Desktop Failing to Launch",
      "description": "Users are reporting that the Pieces Desktop application is failing to launch after a recent update. The app gets stuck in the \"Ensure Core Dependencies\" loading state.  Suggested workarounds such as restarting the app, restarting the machine, and reinstalling the app have proven unsuccessful.  The issue may stem from database errors or dependency issues with Pieces OS.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 648,
          "title": "Pieces Desktop not Launching on my Windows PC",
          "text": "Pieces Desktop not Launching on my Windows PC\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows 11 Home, 24H2\n\n### Your Pieces OS Version\n\n11.2.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nMy Pieces Desktop application has refused to launch since updating it to the latest version (v4.0.0). It's stuck in the \"Ensure Core Dependencies\" loading state even though I have Pieces OS already running successfully in the background. Kindly find screenshots below. \n\nI've tried force quitting both Pieces OS & Pieces Desktop from my Task Manager, uninstalling and re-installing Pieces Desktop, and restarting my PC, all to no avail. Any help would be highly appreciated, thank you!\n\n![Image](https://github.com/user-attachments/assets/22c14a42-29d6-4a1f-ab34-51ba5074b38e)\n\n![Image](https://github.com/user-attachments/assets/025d2e80-78be-480c-9cc2-a85a440dcf75)\n\n![Image](https://github.com/user-attachments/assets/48c76dde-307a-4451-b85f-0483b74c2321)\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* MoyinShabi is experiencing issues connecting Pieces for Developers to Pieces OS.\n* The issue started after a recent update.\n* MoyinShabi did not receive any notifications about a health check.\n* Mack suspects there is an issue with MoyinShabi's desktop app's database.\n* MoyinShabi shared log files and the \"com.pieces.pfd\" folder.\n* MoyinShabi still encounters the issue after replacing the \"com.pieces.pfd\" folder with the repaired version.\n* MoyinShabi found an error related to the GetIt flutter package in the log file.\n\n**Problems Identified:**\n\n* Pieces for Developers cannot connect to Pieces OS.\n* There is an issue with MoyinShabi's desktop app's database.\n* The GetIt flutter package is not finding a particular dependency.\n\n**Solutions Proposed/Implemented:**\n\n* Mack requested log files and the \"com.pieces.pfd\" folder.\n* Mack provided a repaired \"com.pieces.pfd\" folder.\n* Mack suggested a video call for further troubleshooting.\n\n**Current Status/Outcome:**\n\n* MoyinShabi is still experiencing the issue.\n* Mack is available for a video call to troubleshoot further.\n\n**Note:**\n\n* The conversation is ongoing as of 2025-03-18.\n* There is no resolution yet.",
          "activity_level": 6.28
        },
        {
          "id": 667,
          "title": "Unable to open Pieces for Developers",
          "text": "Unable to open Pieces for Developers\n### Checked for Existing Issues?\n\n- [ ] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nlatest\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\npieses for developers can not find the pieses OS. so it not opening.\n## Summary of GitHub Issue Conversation\n\n**Key points raised:**\n\n* User fardin631 reported the issue of Pieces Desktop not launching on their Windows PC.\n* Bot triaged and routed the issue to the Pieces support team.\n* User was advised to check log files in specific folder locations and provide information about their hardware and Windows build number.\n\n**Problems identified:**\n\n* Pieces Desktop was not launching on user's PC.\n* Cause of the issue was not immediately apparent.\n\n**Solutions proposed/implemented:**\n\n* User was requested to provide log files and system information for further analysis.\n* The issue was marked as a duplicate of another issue with similar symptoms.\n\n**Current status/outcome:**\n\n* Additional information needed from user to diagnose the problem.\n* Open and ongoing issue.\n\n**Additional notes:**\n\n* The user was provided with links to potentially helpful resources and existing issues.\n* The user agreed to share requested information.",
          "activity_level": 3.91
        },
        {
          "id": 671,
          "title": "Invalid Port (at character 18) http://127.0.0.1:null/connect",
          "text": "Invalid Port (at character 18) http://127.0.0.1:null/connect\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nLatest from 17032025 (can't find it)\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHi I am stuck at the initial stages. Where the desktop app is being initialized. I am at verify dependency connections and it says unable to open pieces core services. \"FormatException: Invalid Port (at character 18) http://127.0.0.1:null/connect.\n\nIt might be an antivirus stopping it. I am not sure. But I have restarted and reinstalled to no effect.\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* @SherlockSol reported an issue with Pieces crashing and freezing constantly.\n* The issue began after a recent update.\n* Other users reported similar issues (see suggested related issues).\n\n**Problems Identified:**\n\n* Pieces crashes and freezes make the application unusable.\n* The issue is widespread and affects many users.\n\n**Solutions Proposed/Implemented:**\n\n* No specific solutions were proposed or implemented in this initial conversation.\n* The issue was acknowledged and assigned to the appropriate team member for investigation.\n\n**Current Status/Outcome:**\n\n* The issue is being investigated by the Pieces team.\n* Users are advised to check existing issues, documentation, and YouTube channel for further information and potential solutions.\n\n**Additional Notes:**\n\n* The conversation occurred on March 17, 2025.\n* The issue seems to be related to a recent update.\n\nThis summary provides a concise overview of the key points raised, problems identified, and current status of the GitHub issue regarding Pieces crashing and freezing.",
          "activity_level": 1.58
        }
      ]
    },
    {
      "title": "Pieces OS Download and Installation Issues",
      "description": "Users report problems downloading, installing, and running Pieces OS components, including LLM models and Ollama. Issues include unresponsive downloads, slow performance, and installation failures. Proposed solutions involve infrastructure updates, package patching, and temporary workarounds like manual downloads and data deletion.",
      "frequency": 3,
      "related_issues": [
        {
          "id": 459,
          "title": "Bug: unable to cancel the download of an LLLM",
          "text": "Bug: unable to cancel the download of an LLLM\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nlatest\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![image](https://github.com/user-attachments/assets/6e730898-a168-4571-ab0d-6331c4d389a4)\r\n\r\ni want stop but its not working \r\n\n## Summary of GitHub Issue Conversation: Mistral Download Stuck & Non-Responsive\n\n**Key Points:**\n\n* Users (@msaqibbop, @AkhilTrivediX, @jaybuidl) reported issues with the Mistral download getting stuck and becoming non-responsive. \n* The issue seems to affect both Windows and macOS users.\n* Stopping the download doesn't work, and clicking it repeatedly can lead to other models showing \"Initialization\" instead of \"Please wait.\"\n\n**Problems Identified:**\n\n* Mistral download gets stuck and won't complete.\n* Stop button for download is unresponsive.\n* Repeatedly clicking Stop button causes other models to display \"Initialization\" instead of \"Please wait.\"\n\n**Solutions Proposed/Implemented:**\n\n* **Temporary fix:** Delete all files from C:/Users/[YOUR-USERNAME]/Documents/com.pieces.os/ and reinstall Pieces OS and Desktop App.\n* **Others tried:** Reinstalling Pieces OS and Desktop App without deleting data, reinstalling Ollama, disconnecting from the internet, restarting the machine (all unsuccessful).\n* **Upcoming Replacement:** The local large language model stack is being replaced with a new infrastructure, expected to be in production within 2-3 weeks.\n\n**Current Status/Outcome:**\n\n* The temporary fix has provided some users with relief.\n* The long-term solution involving the new infrastructure is still under development and will be released in the coming weeks. \n\n**Additional Notes:**\n\n* The author of the issue (@mark-at-pieces) has offered to chat in real-time to discuss the issue further.\n* Users are encouraged to provide more information about their machine and the specific steps they have taken to reproduce the issue.",
          "activity_level": 1.79
        },
        {
          "id": 315,
          "title": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.",
          "text": "Pieces desktop application is very slow/laggy, not generating any response in copilot chat.\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.0.1\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nPieces desktop application is working very much slow after latest update, takes very much time to give any response. Even after doing a hard reset active runtime, it just do not work. \n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* Copilot response time was significantly slower than expected.\n* Hard-resetting the active runtime did not resolve the issue.\n* High CPU usage and blocked responses were reported.\n* Context files were not being read, even when specified.\n* The issue persisted after updates to Pieces OS 10.0.3 and Desktop application version 3.0.2.\n\n**Problems Identified:**\n\n* A bug in the copilot experience prevented the websocket from properly re-initializing after a hard-reset.\n* The updates to Pieces OS and Desktop application may have introduced new performance issues.\n\n**Solutions Proposed/Implemented:**\n\n* A fix for the bug was implemented and released in a patch.\n* Pieces Desktop application version 3.1.0 was released with significant performance improvements.\n\n**Current Status/Outcome:**\n\n* The performance issues with the copilot were resolved for most users after the release of version 3.1.0 of the Desktop app.\n* There may still be some users experiencing lag, especially those with older hardware or insufficient RAM.\n\n**Additional Notes:**\n\n* The issue was reported by multiple users, indicating it was a widespread problem.\n* The Pieces team was responsive in addressing the issue and providing updates.\n* Some users may still require technical assistance to resolve the issue.\n\n**Next Steps:**\n\n* Users experiencing continued lag should provide details about their system to the Pieces team for further investigation.\n* The Pieces team should continue to monitor the situation and address any additional issues that arise.",
          "activity_level": 4.39
        },
        {
          "id": 537,
          "title": "Ollama Fails to Install on Linux",
          "text": "Ollama Fails to Install on Linux\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nLinux\n\n### Your Pieces OS Version\n\n11.0.0\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nUser reports immediate \"Ollama failed to install\" diaglog upon clicking install Ollama install button in Pieces desktop app\n## Summary of GitHub Issue Conversation\n\n**Key Points Raised:**\n\n* One of Pieces' packages tries to use `curl` which might not be installed.\n* This issue affects both LLM model downloads and inference.\n* Using a sandboxed environment (snap) for Pieces-OS prevents access to `curl`.\n* Users are waiting for a solution to avoid using cloud-based LLMs.\n\n**Problems Identified:**\n\n* `curl` is missing in the Pieces-OS sandbox environment.\n* Patching the package to use `curl` is needed.\n* Infrastructure updates delayed the fix.\n\n**Solutions Proposed/Implemented:**\n\n* Patching the package to allow `curl` usage within the sandbox.\n* Providing a temporary workaround for downloading LLM models manually.\n\n**Current Status/Outcome:**\n\n* The fix is nearing completion and is expected to be released soon.\n* Users are still waiting for the issue to be resolved.\n* There is no current workaround for inference.\n\n**Additional Points:**\n\n* The issue is impacting users who want to use local LLMs instead of cloud-based ones due to privacy concerns. \n* Users are requesting updates on the progress and a solution is urgently needed.",
          "activity_level": 5.37
        }
      ]
    }
  ],
  "recommendations": [
    "**Address Top Issues:** Prioritize resolving the common issues related to Pieces OS high CPU usage, Pieces Copilot slowness, Pieces OS functionality errors, and Pieces Desktop launch failures. These issues have the highest frequency and are likely impacting a significant number of users.",
    "**Improve Installation and Download Experience:** Investigate and resolve issues related to Pieces OS downloads, installations, and LLM model integration. This includes addressing unresponsive downloads, slow performance, and installation failures to ensure a smooth user onboarding process.",
    "**Enhance Copilot Performance and Reliability:** Investigate and optimize Pieces Copilot performance, particularly its responsiveness and code suggestion accuracy. Address bugs in LLM integration and explore solutions for resource constraints to improve the user experience.",
    "**Proactive Communication:**  Keep users informed about ongoing issues, particularly those impacting core functionality like Pieces OS and Copilot. Provide clear timelines for fixes and workarounds to manage user expectations and reduce support ticket volume.",
    "**Review Resource Requirements:**  Investigate if the high CPU usage and performance issues are related to minimum system requirements. Provide clear guidelines to users about the necessary hardware and software configurations for optimal performance.",
    "**Improve Error Messaging:** Review error messages related to Pieces OS and Desktop application failures to make them more informative and actionable for users. This will help users troubleshoot issues independently and reduce support requests.",
    "**Gather Detailed System Information:**  During support interactions, ensure sufficient system information is collected from users experiencing issues, including OS version, Pieces OS version, hardware specs, and relevant log files. This will aid in faster diagnosis and resolution.",
    "**Develop Robust Testing Procedures:** Implement rigorous testing procedures for new releases and updates to catch issues like the Pieces Desktop launch failure before they reach users. This will help maintain the stability and reliability of the application."
  ],
  "message": "Daily support report generated successfully."
}