{
  "success": true,
  "date_range": {
    "start": "2025-07-21T00:00:00+00:00",
    "end": "2025-07-24T05:12:14.857618+00:00"
  },
  "summary": {
    "total_tickets": 1,
    "resolved_tickets": 0,
    "open_tickets": 1
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:macos",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "queued for release",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 801,
      "title": "Auto Generated Context Always returns to Medium",
      "activity_level": 4.33
    }
  ],
  "common_issues": [
    {
      "title": "Auto-Generated Context Resets to Medium",
      "description": "Users report that the Auto-Generated Context setting in the Pieces desktop app (macOS) repeatedly reverts to \"Medium\" from \"High\" after app restarts, OS updates, or periods of inactivity.  The behavior has persisted across multiple builds. It's unclear whether the \"High\" setting ever takes effect.",
      "frequency": 1,
      "related_issues": [
        {
          "id": 801,
          "title": "Auto Generated Context Always returns to Medium",
          "text": "Auto Generated Context Always returns to Medium\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application\n\n### Operating System / Platform\n\nmacOS\n\n### Your Pieces OS Version\n\nPlatform MacOS Version 15.5 (Build 24F74)\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nHello!\n\nThis is an issue that I've seen happen in all of the builds since I've started using pieces. When changing the Auto-Generated Context (Saved Material Enrichment) option in Machine Learning from the menu, in my case I want it to be \"High\", but every time I change it, when I check the next day or any time later, or every time the app or os updates, the option selected goes back to \"Medium\". So I don't actually even know if it ever used \"High\", because it always returns the option to \"Medium\".\nError generating summary: 404 Publisher Model `projects/pi3c3s-cloud-server/locations/us-east1/publishers/google/models/gemini-pro` was not found or your project does not have access to it. Please ensure you are using a valid model version. For more information, see: https://cloud.google.com/vertex-ai/generative-ai/docs/learn/model-versions",
          "activity_level": 4.33
        }
      ]
    }
  ],
  "recommendations": [
    "Investigate and address the bug causing the 'Auto-Generated Context' setting to revert to 'Medium'. This appears to be the most frequent issue and source of user frustration.",
    "Monitor the fix for the 'Auto-Generated Context' setting to ensure it resolves the issue permanently and doesn't reoccur in future updates.",
    "Consider adding a notification or confirmation message within the app when the 'Auto-Generated Context' setting is changed, to confirm the change has been saved and to inform users about any potential conflicts or automatic resets."
  ],
  "message": "Daily support report generated successfully."
}