{
  "success": true,
  "date_range": {
    "start": "2025-03-26T00:00:00+00:00",
    "end": "2025-03-26T13:12:56.124433+00:00"
  },
  "summary": {
    "total_tickets": 2,
    "resolved_tickets": 0,
    "open_tickets": 2
  },
  "ticket_breakdown": [
    {
      "category": "bug",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "on the roadmap",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:desktop application",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "app:pieces os",
      "received": 2,
      "resolved": 0,
      "pending": 2
    },
    {
      "category": "P0",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "app:sharing web app",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "os:windows",
      "received": 1,
      "resolved": 0,
      "pending": 1
    },
    {
      "category": "status:triaged",
      "received": 1,
      "resolved": 0,
      "pending": 1
    }
  ],
  "most_active_tickets": [
    {
      "number": 443,
      "title": "Unable to generate personal shareable links for 6+ months",
      "activity_level": 5.31
    },
    {
      "number": 663,
      "title": "Kaspersky Internet Security flags Pieces OS as a virus",
      "activity_level": 3.25
    }
  ],
  "common_issues": [
    {
      "title": "Pieces OS Functionality Issues and Antivirus Conflicts",
      "description": "Users report problems with Pieces OS features like shareable links and software updates. Antivirus software, including Kaspersky, often flags Pieces OS, causing update failures and functionality issues. Temporary solutions involve allowlisting Pieces OS in antivirus settings, but a permanent fix from Pieces is pending.",
      "frequency": 2,
      "related_issues": [
        {
          "id": 443,
          "title": "Unable to generate personal shareable links for 6+ months",
          "text": "Unable to generate personal shareable links for 6+ months\n### Software\n\nDesktop Application, Web Extension, VS Code, Sharing Web App\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\n10.1.12\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\nI've been unable to generate shareable personal links and utilize the web sharing app since before June '24. I've created an issue about this twice before, and the last time was just completely disregarded and it was closed out.\r\n\r\nHere is the screenshot from within my Pieces Desktop when trying to generate a personal link, as well as generate a GitHub Gist:\r\n\r\n![image](https://github.com/user-attachments/assets/0966a1a9-3076-4d9b-9006-88a14673cc9f)\n## Summary of GitHub Conversation regarding Shareable Links Feature\n\n**Main Issue:** Shareable link functionality in the pieces-os wasn't working reliably.\n\n**Timeline:**\n* **Initial report:** November 7th, 2024 (tombinga)\n* **Diagnosis:** November 7th, 2024 (mark-at-pieces, identified outdated infrastructure as the cause)\n* **Temporary fix:** November 8th, 2024 (mark-at-pieces, suggested individual cloud cleanups)\n* **Patch:** November 12th, 2024 (mark-at-pieces), included in version 10.1.13\n* **Remaining issues:** January 6th, 2025 (tombinga, reported issues with GitHub Gist generation)\n* **New issue logged:** March 23rd, 2025 (Om-Nandurkar)\n* **Ongoing:** Still needs v2 development and removal from beta\n\n**Key details:**\n\n* Shareable Links feature was in beta and experiencing instability.\n* While temporary fixes and patches were implemented, the core issue likely required a larger overhaul (v2).\n* Individual cloud cleanups offered some temporary relief.\n* Specific issues like GitHub Gist generation were reported after the original patch. \n* The issue remains active and is being addressed in development.\n\n**Actionable:**\n\n* Users experiencing issues are encouraged to schedule time with developers for individual cloud cleanups and further diagnosis.\n\n**Overall:** While progress has been made, the Shareable Links feature remains under development and full resolution requires further work.\n\n***\n\nPlease note that this information is presented in an objective manner, summarizing the conversation without taking sides or injecting personal opinions. If you would like me to do so, I can add more details or highlight specific parts of the conversation, or you can ask me specific questions about the conversation.",
          "activity_level": 5.31
        },
        {
          "id": 663,
          "title": "Kaspersky Internet Security flags Pieces OS as a virus",
          "text": "Kaspersky Internet Security flags Pieces OS as a virus\n### Checked for Existing Issues?\n\n- [x] Yes, I have checked existing issues and cannot find one related to this.\n\n### Software\n\nDesktop Application, Pieces OS\n\n### Operating System / Platform\n\nWindows\n\n### Your Pieces OS Version\n\nPiecesOS_11.2.2.0_x64\n\n### Early Access Program\n\n- [ ] Yes, this is related to an Early Access Program feature.\n\n### Kindly describe the bug and include as much detail as possible on what you were doing so we can reproduce the bug.\n\n![Image](https://github.com/user-attachments/assets/160ed12d-f0a1-46be-bf36-05502353405e)\n## Summary of GitHub Issue Conversation: \n\n**Key Points:**\n\n* Users are experiencing issues updating Pieces OS, with some encountering error messages or the update failing to complete.\n* Some antivirus software, such as Kaspersky, Nod32, and Malwarebytes, is blocking the update or preventing Pieces OS from running.\n\n**Problems Identified:**\n\n* Antivirus software interfering with Pieces OS updates and functionality.\n* Users experiencing frustration and inconvenience due to update failures.\n\n**Solutions Proposed/Implemented:**\n\n* Allowlisting Pieces OS in antivirus software settings.\n* Seeking an official update from Pieces to address compatibility issues with antivirus programs.\n\n**Current Status/Outcome:**\n\n* The issue appears to be ongoing, with users still reporting problems.\n* No official resolution has been implemented by Pieces yet.\n\n**Additional Notes:**\n\n* The conversation suggests other users might be experiencing similar problems with different antivirus software.\n* Pieces support has not provided an update on the issue since March 18th, 2025.",
          "activity_level": 3.25
        }
      ]
    }
  ],
  "recommendations": [
    "**Investigate and address the root cause of Pieces OS being flagged by antivirus software, particularly Kaspersky.** This will reduce support tickets related to update failures and functionality issues.",
    "**Provide clear and accessible documentation on how to allowlist Pieces OS in popular antivirus programs.** This will empower users to resolve the issue themselves and reduce the load on support.",
    "**Prioritize a permanent fix for the shareable links feature and communicate the timeline to users.** This will address a long-standing issue and improve user satisfaction.",
    "**Consider implementing a system to proactively identify and address potential antivirus conflicts before each Pieces OS update.** This will minimize disruptions for users and reduce the number of support tickets related to this issue.",
    "**Improve communication with users regarding known issues and their resolution progress.** This will manage expectations and reduce frustration caused by recurring problems like the shareable links bug."
  ],
  "message": "Daily support report generated successfully."
}